{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDE5LzcvMy9ob25nLWtvbmctcHJvdGVzdHMtYWxsLXRoZS1sYXRlc3QtdXBkYXRlc9IBVWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAxOS83LzMvaG9uZy1rb25nLXByb3Rlc3RzLWFsbC10aGUtbGF0ZXN0LXVwZGF0ZXM?oc=5\n", "title": "Hong Kong protests: All the latest updates | Hong Kong Protests News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_138", "input": "", "char_offset": "0-2187"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lmhydy5vcmcvbmV3cy8yMDIwLzA3LzI5L2NoaW5hLW5ldy1ob25nLWtvbmctbGF3LXJvYWRtYXAtcmVwcmVzc2lvbtIBAA?oc=5\n", "title": "China: New Hong Kong Law a Roadmap for Repression | Human Rights Watch", "stance": "pos", "content": "", "translation": "", "uid": "02_00_63", "input": "", "char_offset": "0-1915"}
{"language": "Chinese", "url": "https://news.china.com/domestic/945/20190703/36531010.html", "title": "对香港冲击立法会大楼事件 三大央媒重磅发声", "stance": "neg", "content": "", "translation": "In response to the violent attack on the Legislative Council building in the Hong Kong Special Administrative Region on July 1, the People's Daily, Xinhua News Agency, and CCTV's \"News Network\" made a strong statement: Hong Kong cannot withstand the torment and internal strife, and Hong Kong's rule of law cannot be challenged. Violent acts must be severely punished in accordance with the law!\n\nPeople's Daily commentator: We firmly support the SAR government in pursuing serious violations to the end\n\nJuly 1 is a happy day for people from all walks of life in Hong Kong to commemorate Hong Kong’s return to the motherland and the establishment of the Hong Kong Special Administrative Region. However, some extreme radicals violently attacked the Legislative Council building on the pretext of opposing the amendment of relevant regulations of the SAR government. This is a serious violation of the rule of law in Hong Kong, a great damage to Hong Kong's social order, and a blatant challenge to the bottom line of \"one country, two systems.\"\n\nThey used iron rods and iron cages to destroy the glass exterior walls of the Legislative Council building, used toxic chemical powder to attack the police, forced their way into the Legislative Council building, and wantonly damaged the solemn chamber and the SAR emblem...these are acts of lawless violence. This behavior is very shocking, sad and angry! No country or society will tolerate this. The central government firmly supports Chief Executive Carrie Lam and the SAR government in administering the law in accordance with the law, and firmly supports the Hong Kong police in strictly enforcing the law, pursuing illegal activities to the end, and ensuring social order and citizen safety.", "uid": "02_06_84", "input": "", "char_offset": "0-405"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/28/c_138344686.htm", "title": "Interview: Radical protesters responsible for violence in Hong Kong, expert says", "stance": "neg", "content": "", "translation": "", "uid": "02_06_161", "input": "", "char_offset": "0-1204"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wOS8yNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0LXZpb2xlbmNlLWludGwtaG5rL2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDE5LzA5LzI2L2FzaWEvaG9uZy1rb25nLXByb3Rlc3QtdmlvbGVuY2UtaW50bC1obms?oc=5\n", "title": "How a summer of protest pushed young Hong Kongers to the edge | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_160", "input": "", "char_offset": "0-2103"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/06/c_138286032.htm", "title": "Xinhua Headlines: Protesters cause mayhem as HKSAR chief executive warns of \"very dangerous situation\"", "stance": "neg", "content": "", "translation": "", "uid": "02_06_168", "input": "", "char_offset": "0-901"}
{"language": "English", "url": "https://www.chinadaily.com.cn/a/201908/22/WS5d5dc96aa310cf3e35567288.html", "title": "Peer influence among factors blamed in HK", "stance": "neg", "content": "", "translation": "", "uid": "02_06_208", "input": "", "char_offset": "0-1067"}
{"language": "English", "url": "https://www.rnz.co.nz/news/world/511934/hong-kong-actor-gregory-wong-among-12-jailed-over-2019-protest?utm_source=ground.news&utm_medium=referral", "title": "Hong Kong: Actor Gregory Wong among 12 jailed over 2019 protest", "stance": "neutral", "content": "", "translation": "", "uid": "02_09_0", "input": "", "char_offset": "0-2132"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1694219167959307257&wfr=spider&for=pc", "title": "幕后金主正被调查！香港“民阵”陷入分崩离析，多个团体宣布退出", "stance": "neg", "content": "", "translation": "As the saying goes, \"When a tree falls, the hozen will scatter.\" Foreign media recently quoted sources as saying that the Hong Kong SAR government is investigating whether the \"Democratic Front\" violated Hong Kong's national security law, including whether it accepted funding from the \"National Endowment for Democracy\" (NED). If true, it may be banned in a short time. As soon as the news came out, many opposition groups announced their withdrawal from the Democratic Front in the past few days.", "uid": "02_06_39", "input": "", "char_offset": "0-110"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/28/c_138344686.htm", "title": "Interview: Radical protesters responsible for violence in Hong Kong, expert says", "stance": "neg", "content": "", "translation": "", "uid": "02_06_160", "input": "", "char_offset": "0-1046"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1701437536366264007&wfr=spider&for=pc", "title": "最新铁证！美国在香港搞“政治731”实验，上千大学生成“小白鼠”", "stance": "neg", "content": "", "translation": "Investigating the paper's author team revealed more.\nFor example, a man named David Yang, who has an Asian face, is officially an assistant professor in the Department of Economics at Harvard University, and many of his \"research results\" involve social interaction and protests. What's even more coincidental is that many co-authors are also \"contributors\" to this paper on Hong Kong.\nAfter looking at his social media accounts, I discovered more.\nIn a tweet on June 15, 2019, he mentioned an article published by the team on the London School of Political Science website two years ago, which stated that the mainland has a so-called \"triple dilemma\" in Hong Kong, and that protests are detrimental to maintaining Hong Kong's political stability is \"vital\".\nIs doing things in Hong Kong conducive to Hong Kong's stability? Isn’t this similar to Pelosi’s “beautiful landscape”?\nThe article, which Yang co-wrote, claimed: \"As long as the people of Hong Kong threaten credible protests, Beijing can be restrained.\"\nThe use of protests to force the passage of Article 23 of the Basic Law was called a \"successful case\" by the paper, and in the author's eloquent article on the LSE website, there is even this statement: \"Article 23 of the Basic Law Doing nothing is important to Hong Kong's stability and \"one country, two systems.\" Protests are a source of stability, not instability. Beijing's attempts to pass national security legislation within the framework of Article 23 of the Basic Law are actually a source of instability. \"\nTranslate: Obstructing the legislation under Article 23 is a matter of abiding by the Basic Law and safeguarding \"one country, two systems\"; establishing national security legislation based on Article 23 is illegal and is not conducive to the stability of Hong Kong.\nWhat is even more obvious is that the views of several authors of the paper were also included in the article on the LSE website. They interviewed thousands of students who participated in the \"Occupy Central\" movement, and based on the survey results of 1,500 of them, The so-called \"evidence\" that young people in Hong Kong have become radicalized was obtained: 88% of people consider themselves Hong Kongers rather than Chinese; 22% support the use of violence to pursue political rights in Hong Kong. And when they \"encouraged\" students to express anonymously, the proportion of those who supported violence reached 40%.\nThe LSE official website also stated that \"this article represents the views of the author of the paper and has nothing to do with LSE.\"\nDavid Yang called the South China Morning Post's 2017 report on gang violence on the streets of Hong Kong a \"Nice report\".\nOn the day when the black riots broke out in Hong Kong in 2019, he retweeted articles from accounts supporting the riots and \"praised\": \"Collective action is the most spectacular scene showing human power.\"\nFrom 2017 to 2018, David Yang was also one of the main disseminators of Xinjiang-related rumors. He also reposted social media tweets from the famous lie maker Adrian Zenz. This has to make people wonder, how many Zheng Guoen and others are there in Western university circles? What role does Yang play in this circle?", "uid": "02_06_29", "input": "", "char_offset": "0-931"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnRoZWF0bGFudGljLmNvbS9waG90by8yMDE5LzA3L2hvbmcta29uZy1wcm90ZXN0ZXJzLWJyZWFrLWludG8tbGVnaXNsYXRpdmUtY291bmNpbC1idWlsZGluZy1waG90b3MvNTkzMTU4L9IBAA?oc=5\n", "title": "Hong Kong Protesters Break Into Legislative Council Building: Photos - The Atlantic", "stance": "pos", "content": "", "translation": "", "uid": "02_00_72", "input": "", "char_offset": "0-1013"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wNy8wMS9hc2lhL2hvbmcta29uZy1qdWx5LTEtcHJvdGVzdC1leHRyYWRpdGlvbi1pbnRsLWhuay9pbmRleC5odG1s0gFVaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAxOS8wNy8wMS9hc2lhL2hvbmcta29uZy1qdWx5LTEtcHJvdGVzdC1leHRyYWRpdGlvbi1pbnRsLWhuaw?oc=5\n", "title": "Hong Kong protests: Carrie Lam responds to protestor takeover | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_55", "input": "", "char_offset": "0-2204"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/201911/21/WS5dd5eaeca310cf3e35578e1e_10.html", "title": "How much economic pain has violence inflicted upon Hong Kong?", "stance": "neg", "content": "", "translation": "", "uid": "02_06_197", "input": "", "char_offset": "0-913"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_13", "input": "", "char_offset": "0-395"}
{"language": "English", "url": "http://www.chinadaily.com.cn/kindle/2019-11/23/content_37524955.htm", "title": "HK protests expose Western media bias", "stance": "neg", "content": "", "translation": "", "uid": "02_06_119", "input": "", "char_offset": "0-927"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1701437536366264007&wfr=spider&for=pc", "title": "最新铁证！美国在香港搞“政治731”实验，上千大学生成“小白鼠”", "stance": "neg", "content": "", "translation": "This paper focuses on the so-called \"protests\" with clear purpose and specificity since Hong Kong's return to the motherland, citing the so-called arguments and euphemistically calling them \"the spirit of Hong Kong's democratic struggle.\" And they tend to refer to the anniversary of Hong Kong's return as \"the anniversary of Hong Kong's handover to China.\"\nWe have to wonder about their real purpose of doing this research: after observing a phenomenon, draw their own conclusions through research and analysis, or in the name of research, to be the organizers, planners, and motivators of the \"color revolution\" ?\nCoincidentally, their intentions were \"revealed\" later in the article.\nIn what the authors call “overcoming difficulties,” they mention that “because Hong Kong’s ‘democratic’ people have a tradition of protest, existing protests allow us to gain forward-looking perspectives in real time.”\nBy choosing the Hong Kong University of Science and Technology as the research target, they \"can use incentives to obtain in advance the opinions of more than 1,200 college students on their classmates' participation in the upcoming demonstrations\" and thus \"randomly process information on some of them, and Lead to a posteriori perspectives and finally, “lead out students’ own protest participation behavior.”\nThe paper concludes that within a political movement, incentives to attend one protest increase attendance at subsequent protests; one-time incentive mobilization has positive consequences, while mobilization at the social network level is very important for sustained political participation. important.\nIn the appendix of the 2019 version of the paper, we see a questionnaire \"tailored\" by the authors of the paper for Hong Kong students. There is also content suggesting that the interviewed students donate their remuneration to the \"Hong Kong Independence\" organization \"Hong Kong People's Liberation Army\".\nIn addition, in the paper they also designed related questions about the Hong Kong subway. Unsurprisingly, during the riots in Hong Kong in 2019, the most targeted target of the thugs was the Hong Kong subway. In addition, the paper further claims that its research complied with ethical requirements during the operation: \"Participating in the July 1st demonstrations was clearly legal and peaceful in all years before the study; the demonstrations we studied remained peaceful, and during the two years of the study No protesters were prosecuted for any crimes during the year; our experiment was small relative to the size of the July 1 demonstrations we studied.\"", "uid": "02_06_28", "input": "", "char_offset": "0-724"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lmhydy5vcmcvbmV3cy8yMDIwLzA3LzI5L2NoaW5hLW5ldy1ob25nLWtvbmctbGF3LXJvYWRtYXAtcmVwcmVzc2lvbtIBAA?oc=5\n", "title": "China: New Hong Kong Law a Roadmap for Repression | Human Rights Watch", "stance": "pos", "content": "", "translation": "", "uid": "02_00_68", "input": "", "char_offset": "0-2943"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wOC8xNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0cy1ldm9sdXRpb24taW50bC1obmstdHJuZC9pbmRleC5odG1s0gFSaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAxOS8wOC8xNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0cy1ldm9sdXRpb24taW50bC1obmstdHJuZA?oc=5\n", "title": "Hong Kong protest timeline: The evolution of a movement | CNN", "stance": "neutral", "content": "", "translation": "", "uid": "02_00_214", "input": "", "char_offset": "0-1407"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDE5LzcvMy9ob25nLWtvbmctcHJvdGVzdHMtYWxsLXRoZS1sYXRlc3QtdXBkYXRlc9IBVWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAxOS83LzMvaG9uZy1rb25nLXByb3Rlc3RzLWFsbC10aGUtbGF0ZXN0LXVwZGF0ZXM?oc=5\n", "title": "Hong Kong protests: All the latest updates | Hong Kong Protests News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_132", "input": "", "char_offset": "0-1708"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDE5LzcvMy9ob25nLWtvbmctcHJvdGVzdHMtYWxsLXRoZS1sYXRlc3QtdXBkYXRlc9IBVWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAxOS83LzMvaG9uZy1rb25nLXByb3Rlc3RzLWFsbC10aGUtbGF0ZXN0LXVwZGF0ZXM?oc=5\n", "title": "Hong Kong protests: All the latest updates | Hong Kong Protests News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_130", "input": "", "char_offset": "0-2309"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wOC8xNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0cy1ldm9sdXRpb24taW50bC1obmstdHJuZC9pbmRleC5odG1s0gFSaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAxOS8wOC8xNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0cy1ldm9sdXRpb24taW50bC1obmstdHJuZA?oc=5\n", "title": "Hong Kong protest timeline: The evolution of a movement | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_218", "input": "", "char_offset": "0-1096"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vaG9uZ2tvbmdmcC5jb20vMjAyMy8wNy8wMy8xNS1zdG9wcGVkLWJ5LWhvbmcta29uZy1wb2xpY2Utb24tYW5uaXZlcnNhcnktb2YtY2l0eXMtcmV0dXJuLXRvLWNoaW5lc2UtcnVsZS_SAQA?oc=5\n", "title": "15 stopped by Hong Kong police on anniversary of city's return to Chinese rule | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_80", "input": "", "char_offset": "0-2932"}
{"language": "Chinese", "url": "https://www.thepaper.cn/newsDetail_forward_1253904", "title": "香港七一游行500余名被捕者悉数获释，有人身藏攻击性武器", "stance": "neg", "content": "", "translation": "The central government respects the rights of Hong Kong citizens to express their opinions, but any form of so-called \"referendum\" in the Hong Kong Special Administrative Region has no constitutional legal basis, is illegal, and is invalid.\nThe overseas edition of People's Daily published an article today criticizing the July 1st demonstrations in Hong Kong. According to reports, Hong Kong's radical opposition organizations \"Scholar Citizen Thought\" and the Federation of Students rehearsed \"Occupy Central\" on the evening of July 1, illegally trying to force the Hong Kong SAR government to accept \"citizen nominations\" that were not in compliance with the Basic Law. People from all walks of life in Hong Kong pointed out that the opposition first used the illegal \"referendum\" to build momentum, and then illegally \"Occupy Central\". They were kidnapping public opinion in order to challenge \"one country, two systems\", ignore the mainstream public opinion in Hong Kong society, and harm the interests of Hong Kong's 7 million citizens.\n\nFamous person: \"Don't do anything illegal\"\n\nThe report also interviewed many Hong Kong people to express their views on the matter. Chen Yongqi, a member of the Standing Committee of the National Committee of the Chinese People's Political Consultative Conference, told the People's Daily that he was young and opposed many things, but no one should do anything illegal. The so-called \"referendum\" launched by the \"Occupy Central\" group a few days ago \"can't see the actual number of people voting and whether the votes are duplicated, so there must be something wrong.\"\n\nCheng Yaotang, executive chairman of the Hong Kong Celebration Committee, told the People's Daily that the most important thing for citizens to express their demands is to abide by the law, and instigating violations of the law and causing trouble are not Hong Kong's core values. Tam Yiu-chung, chairman of the Democratic Alliance for the Betterment of China and member of the Legislative Council, pointed out that the voices from all walks of life against \"Occupy Central\" are very loud, and he does not understand why the opposition still goes against public opinion. \"Occupy Central\" is blatantly illegal. It not only blocks traffic, but also affects people's daily lives and poses a danger to people's lives and property. He was worried that the situation would eventually get out of control, and urged the opposition to think carefully and \"illegal things should not be done.\" Ip Kwok-him, convener of the DAB Legislative Council caucus, pointed out that everyone, including students, should not engage in illegal and violent behaviors. The police should act in accordance with the law.\n\nThe numbers are false and there is a black hand behind it.\n\nThe People's Daily stated that the \"Democratic Front\", which launched the \"July 1\" march in Hong Kong, claimed that the number of people marching this year was more than five times that announced by the police. This shows that the \"Democratic Front\" is crazy about counting (big numbers). The newspaper cited an article by Wen Pingli published by Hong Kong's Wen Wei Po and pointed out that in fact, the police used a scientific and rigorous statistical method to count the number of people in the march, which was well-founded. The opposition insists that this is nothing more than a \"self-fulfilling lie\", telling and directing its own lies. Who else would believe such numbers?\n\nFollow-up: More than 500 demonstrators in Hong Kong have been released\n\nAccording to the People's Daily, the Hong Kong police have released more than 500 arrested demonstrators. The police issued warning notices to 486 people who participated in the \"July 1 Parade\", and 25 others were granted bail pending investigation and reported to the police from late July to early August. The police said that three arrested men aged 18 to 68 were found with screwdrivers, knives or folding knives on their bodies and were arrested on suspicion of \"possession of offensive weapons\", while another 21-year-old woman was arrested on suspicion of \"assaulting a police officer\" .", "uid": "02_06_38", "input": "", "char_offset": "0-940"}
{"language": "Chinese", "url": "https://news.china.com/domestic/945/20141119/18980930_all.html", "title": "香港愤慨立法会遭冲击 港媒称下一站是旺角", "stance": "neg", "content": "", "translation": "\"Do you think that the incident that occurred in the Legislative Council in the early hours of Wednesday morning marks the complete failure of the non-violent principle of 'Occupy Central'?\" Yesterday, 82% of the respondents chose \"Yes\" in a poll on the Hong Kong \"South China Morning Post\" website with this title. \". From late night on the 18th to early morning on the 19th, the Hong Kong Legislative Council building was violently attacked by dozens of demonstrators wearing masks. Many glass doors were destroyed, and one of them briefly broke into the Legislative Council building. The relevant meeting of the Legislative Council originally scheduled to be held on the 19th was forced to be rescheduled. Since the incident occurred on the day when law enforcement officers were clearing occupied roads in the Admiralty area, some people suspected that the radical demonstrators who stormed the Legislative Council were retaliating for the above actions. There were also \"Occupy Central\" people who suspected that the perpetrators were \"ghosts\" and claimed that the move was \"Framing and framing\" \"Occupy Central\". After this \"restless night\", the Hong Kong government, establishment and pan-democratic lawmakers unanimously condemned the violent attacks, while the student leader who led the \"occupation\" said those who stormed the Legislative Council \"should not be condemned.\" On the 19th, Hong Kong media such as \"Ming Pao\" urged students to \"persuad students to quit\" while urging the police to \"enforce the law decisively.\" Under the \"cloud of Occupy Central\", Hong Kong spent its 53rd day of \"occupation\" in this way. The focus of the 54th day is Mong Kok, where law enforcement officers are about to launch a similar \"road clearing\" operation.", "uid": "02_06_102", "input": "", "char_offset": "0-384"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2NoaW5hLWJlaWppbmctaG9uZy1rb25nLWRiNWNiMjdhZjZmYmE2ZWRmNzA2NGU1ZGY4NzRhODg50gEA?oc=5\n", "title": "Timeline: Hong Kong under 25 years of Chinese rule | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_190", "input": "", "char_offset": "0-3174"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vaG9uZ2tvbmdmcC5jb20vMjAyMi8wNy8wMi90aW1lbGluZS1ob25nLWtvbmdzLWp1bHktMS1jYXJuaXZhbC1vZi1kaXNzZW50LWhvdy0xNy15ZWFycy1vZi1wcm90ZXN0LWRlbWFuZHMtZmVsbC1zaWxlbnQv0gEA?oc=5\n", "title": "Timeline: Hong Kong's July 1 carnival of dissent - how 17 years of protest demands fell silent | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_48", "input": "", "char_offset": "0-2616"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAyMS8wNi8yOS9hc2lhL2hvbmcta29uZy1uc2wtb25lLXllYXItaW50bC1obmstZHN0L2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDIxLzA2LzI5L2FzaWEvaG9uZy1rb25nLW5zbC1vbmUteWVhci1pbnRsLWhuay1kc3Q?oc=5\n", "title": "Hong Kong: One year after China passed the national security law, residents feel Beijing’s tightening grip | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_151", "input": "", "char_offset": "0-2019"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-10/04/c_138448524_2.htm", "title": "Unrest-hit Hong Kong outlaws wearing masks in protests", "stance": "neg", "content": "", "translation": "", "uid": "02_06_117", "input": "", "char_offset": "0-642"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vaG9uZ2tvbmdmcC5jb20vMjAyMi8wNy8wMi90aW1lbGluZS1ob25nLWtvbmdzLWp1bHktMS1jYXJuaXZhbC1vZi1kaXNzZW50LWhvdy0xNy15ZWFycy1vZi1wcm90ZXN0LWRlbWFuZHMtZmVsbC1zaWxlbnQv0gEA?oc=5\n", "title": "Timeline: Hong Kong's July 1 carnival of dissent - how 17 years of protest demands fell silent | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_46", "input": "", "char_offset": "0-898"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1666105065670489802&wfr=spider&for=pc", "title": "香港修例风波回望：当青年被绑上暴力战车", "stance": "neg", "content": "", "translation": "Last November, black-clad thugs, including some students, occupied the Chinese University of Hong Kong and the Hong Kong Polytechnic University. They occupied bridges and threw objects at traffic thoroughfares, threw petrol bombs at the police, and confronted the police with bows and arrows. They used the campus as a \"battlefield.\" The Chinese University of Hong Kong was even called a \"violent university\" by the society. However, the president of the student union of the school even shouted: \"I think this (title) is an affirmation of CUHK students, and I am proud of being a 'big' student.\"\n\"Many young people learn to break the law before they know what law-abiding is.\" Liang Meifen, a member of the Hong Kong Basic Law Committee of the Standing Committee of the National People's Congress, said bluntly that the so-called \"violating the law to achieve justice\" \"romanticizes\" and \"heroizes\" the way of committing crimes, inducing people to There are many young people who have nothing to do.\nIn order to tightly kidnap Hong Kong youth on the stalled chariot, the anti-China and anti-Hong Kong forces are trying their best to excuse illegal acts and justify crimes. They trick young people into saying \"leaving a criminal record will make life more exciting\" and instigate them to ignore the law and attack the police.\nHuang Xihua, a Hong Kong social worker who was born in 1990, has been following the entire legislative controversy with a cold eye. He pointed out: \"Hong Kong has always been praised for its rule of law. Hong Kong youth who were born and raised here will not fail to understand the importance of the rule of law to Hong Kong. But under the endorsement of the theory of 'justice without error', they knew the law and broke the law.\"\nOctober 1, 2019 is a day for the whole country to celebrate the 70th anniversary of the founding of New China. On this day, a large number of thugs violently attacked police officers in Tsuen Wan, Hong Kong. Video from the scene showed a thug wearing blue gloves and holding a shield wildly hitting the police officer with an iron rod in his hand, and the police officer was forced to shoot and wound him. The person who was shot was only 18 years old.\nAnyone with a modicum of common sense and rationality knows that violent attacks on the government will be severely punished, and attacking police officers is a felony. However, the anti-China and destabilizing forces in Hong Kong instigate young people to be \"righteous men\" and \"martyrs\" to attack the government, attack the police, block roads and set fires, and do everything possible to cause bloodshed. This 18-year-old middle school student became a \"cannon fodder\" in a muddle-headed manner.", "uid": "02_06_51", "input": "", "char_offset": "0-629"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lmhydy5vcmcvbmV3cy8yMDIwLzA3LzI5L2NoaW5hLW5ldy1ob25nLWtvbmctbGF3LXJvYWRtYXAtcmVwcmVzc2lvbtIBAA?oc=5\n", "title": "China: New Hong Kong Law a Roadmap for Repression | Human Rights Watch", "stance": "pos", "content": "", "translation": "", "uid": "02_00_64", "input": "", "char_offset": "0-1816"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_28", "input": "", "char_offset": "0-273"}
{"language": "English", "url": "http://www.chinadaily.com.cn/kindle/2019-11/23/content_37524955.htm", "title": "HK protests expose Western media bias", "stance": "neg", "content": "", "translation": "", "uid": "02_06_123", "input": "", "char_offset": "0-1433"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LnZveC5jb20vd29ybGQvMjAxOS84LzI4LzIwODM1NDYyL2hvbmcta29uZy1wcm90ZXN0cy0yMDE5LW5ld3MtdXBkYXRlc9IBAA?oc=5\n", "title": "Hong Kong protests 2019: news and updates - Vox", "stance": "pos", "content": "", "translation": "", "uid": "02_00_99", "input": "", "char_offset": "0-3041"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-09/14/c_138391586.htm", "title": "Xinhua Headlines: Prolonged unrest plunges Hong Kong into rift and pain", "stance": "neg", "content": "", "translation": "", "uid": "02_06_227", "input": "", "char_offset": "0-1561"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDE5LzcvMy9ob25nLWtvbmctcHJvdGVzdHMtYWxsLXRoZS1sYXRlc3QtdXBkYXRlc9IBVWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAxOS83LzMvaG9uZy1rb25nLXByb3Rlc3RzLWFsbC10aGUtbGF0ZXN0LXVwZGF0ZXM?oc=5\n", "title": "Hong Kong protests: All the latest updates | Hong Kong Protests News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_129", "input": "", "char_offset": "0-1727"}
{"language": "English", "url": "https://www.chinadaily.com.cn/global/2019-08/22/content_37504425.htm", "title": "Peer influence among factors blamed in HK", "stance": "neg", "content": "", "translation": "", "uid": "02_06_246", "input": "", "char_offset": "0-1643"}
{"language": "English", "url": "https://www.chinadaily.com.cn/global/2019-08/27/content_37505767.htm", "title": "86 protesters detained over weekend violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_164", "input": "", "char_offset": "0-1627"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1637942845376337424&wfr=spider&for=pc", "title": "外交部：香港示威者冲击立法会是践踏法治、危害社会秩序的严重违法行为", "stance": "neg", "content": "", "translation": "On July 1, a violent attack on the Legislative Council building occurred in the Hong Kong SAR. Foreign Ministry spokesman Geng Shuang said on the 2nd that this was a serious illegal act that trampled on the rule of law and endangered social order. China strongly condemns this. The central government firmly supports the Hong Kong SAR government and police in handling the incident in accordance with the law.\nAccording to reports, the United States, the United Kingdom, and the European Union issued a statement regarding the Hong Kong demonstrators' attack on the Legislative Council, stating that the people of Hong Kong should have the right to peaceful protest and should avoid violence. At present, it is more important to exercise restraint. Geng Shuang responded: \"If the violent attack on the Legislative Council in Hong Kong happened in the United States or Europe, how would they handle it? Will they let it go? Everyone has seen on TV the scenes of police officers in the United States and Europe dealing with violent law enforcement. . Why do they not only fail to condemn the same thing when it happens in Hong Kong, but also make irresponsible remarks and point fingers, seemingly impartially advocating for the right to peaceful protest and calling for the avoidance of violence? This is completely naked double standards, extremely hypocritical and ugly. !”\nGeng Shuang reiterated that Hong Kong is a special administrative region of China and Hong Kong affairs are purely China's internal affairs. China expresses strong dissatisfaction and firm opposition to relevant countries' gross interference in Hong Kong affairs and China's internal affairs. We once again urge relevant countries to be cautious in their words and deeds and not to interfere in Hong Kong's internal affairs in any way, not to embolden violent lawbreakers in any form, and not to issue Any misleading signals, don’t make any wrong moves.", "uid": "02_06_77", "input": "", "char_offset": "0-453"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wNy8wMS9hc2lhL2hvbmcta29uZy1wcm90ZXN0cy1kaXZpZGUtaW50bC1obmsvaW5kZXguaHRtbNIBSmh0dHBzOi8vYW1wLmNubi5jb20vY25uLzIwMTkvMDcvMDEvYXNpYS9ob25nLWtvbmctcHJvdGVzdHMtZGl2aWRlLWludGwtaG5r?oc=5\n", "title": "Hong Kong is protesting a China extradition bill, but violence could open divisions | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_169", "input": "", "char_offset": "0-2472"}
{"language": "Chinese", "url": "https://news.china.com/domestic/945/20190703/36531010.html", "title": "香港：宣誓辱国辱华“港独”分子冲击立法会罪名成立", "stance": "neg", "content": "", "translation": "On November 2, 2016, the former Legislative Council-elect of the Hong Kong Special Administrative Region Leung Chung-hang and Yau Wai-chen, together with three former parliamentary assistants, barged into the Legislative Council conference room, brought their own loudspeakers and tried to forcefully swear an oath. In the chaos, many security personnel were injured, 5 The person was later charged with participating in an illegal assembly. Hong Kong's Kowloon City Magistrates' Court issued a verdict this morning: five people were found guilty of illegal assembly.\nOn October 12, 2016, at the swearing-in ceremony for members of the new Hong Kong Legislative Council, \"Youth New Deal\" elected members Leung Chung-hang and Yau Waizhen displayed the slogans \"HONGKONG IS NOT CHINA\" (Hong Kong is not China) and \"Hong Kong independence\", declaring allegiance to \" \"Hong Kong Nation\", and added words that insulted the country and China, pronouncing \"CHINA\" as \"China\"; Yau Wai-chen even made a profanity and pronounced \"REPUBLIC\" (Republic) as \"REFXXXING\" (a curse word). The Secretary-General of the Legislative Council, who was responsible for administering the oath that day, immediately stated that he could not administer the oath for the two of them.\nOn November 2 of the same year, Leung Chung-hang and Yau Wai-chen forced their way into the Legislative Council chamber without the approval of the Chairman of the Legislative Council and attempted to take an oath on their own. During the process, they insulted, pushed, and kicked security guards, resulting in injuries to six security guards and one security guard. Lost consciousness in the chaos. Legislative Council Chairman Leung Jun-yin subsequently called the police, and five people including Leung Chung-heng and Yau Waizhen were charged with illegal assembly.", "uid": "02_06_85", "input": "", "char_offset": "0-421"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-10/03/c_138444842.htm", "title": "Hong Kong society choruses against violence escalation on National Day", "stance": "neg", "content": "", "translation": "", "uid": "02_06_181", "input": "", "char_offset": "0-1751"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1638081771440085054&wfr=spider&for=pc", "title": "涉嫌暴力冲击香港立法会，12人已被警方拘捕！", "stance": "neg", "content": "", "translation": "\"If violence is used, Hong Kong will definitely collapse.\"\nAccording to the New York Times, Cecilia Zhang is the kind of Chinese who might be considered sympathetic to Hong Kong protesters—she studied at a prestigious American school, has been working in the financial industry in Hong Kong for the past four years, and has not moved back to the mainland. Intend. But in fact, she thinks it's time for those protesters to go home. \"With strikes and school strikes, Hong Kong's economy will be very ugly this year.\" The newspaper said that many educated Chinese people believe that protesters should work hard to rebuild Hong Kong. Hong Kong was once a beacon of prosperity, but now it is losing its luster.\n\"Social disputes continue, and if violence is used, Hong Kong will definitely collapse.\" Sing Tao Daily quoted Wu Yingxiang, chairman of Hong Kong's Hopewell Holdings, as saying on the 3rd that continued social disputes will damage Hong Kong's business environment, and if it turns into \"mob politics\" \" will undermine investor confidence. Hong Kong's \"Sing Tao Daily\" published an editorial on the 3rd, saying that just as Hong Kong people don't like to travel to violent places, overseas people will also be greatly reduced in their willingness to visit Hong Kong when they see international news articles and conspicuous reports on Hong Kong's violent attacks. It affects the employment opportunities of many people. Popular Japanese boy band KAT-TUN has canceled its first performance in Hong Kong scheduled for this Friday.\nThe newspaper said that the current situation in Hong Kong has a lot to do with the long-term propaganda of pan-democrats. They have opened Pandora's box and instilled in young people the so-called fallacy of \"violating the law to achieve justice.\" This toxic thought, after several years of \"latency\", finally played a role in this incident. An editorial in Hong Kong's \"Toutiao Daily\" on the 3rd stated that Hong Kong society must now choose between unstoppable conflict or the restoration of rational dialogue. The former will only bring endless violence and continue to sink, while the latter can bring Hong Kong out of its predicament and allow everyone to live a normal and peaceful life again.", "uid": "02_06_81", "input": "", "char_offset": "0-551"}
{"language": "English", "url": "https://localnews8.com/news/ap-national/2024/03/15/hong-kong-jails-12-people-for-over-the-storming-of-the-legislature-in-2019-protests/?utm_source=ground.news&utm_medium=referral", "title": "Hong Kong jails 12 people for over the storming of the legislature in 2019 protests", "stance": "neutral", "content": "", "translation": "", "uid": "02_09_5", "input": "", "char_offset": "0-648"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/28/c_138345173.htm", "title": "Commentary: Hong Kong's status as int'l financial hub should be cherished", "stance": "neg", "content": "", "translation": "", "uid": "02_06_223", "input": "", "char_offset": "0-530"}
{"language": "Chinese", "url": "", "title": "环球时报：香港现七一游行，国家不可能让步", "stance": "neg", "content": "", "translation": "The mentality of Hong Kong society today is very complex. In addition to being generally valued, the issue of democracy has also become a special psychological fulcrum for some people when the gap between developed mainland regions and Hong Kong is narrowing. Hong Kong's living standards have long been much higher than those on the mainland, and many people are used to facing the pride of mainlanders. Nowadays, many people's sense of superiority is under attack, and Western-style \"democracy\" has become the thing that some Hong Kong people identify as \"most different from the mainland.\"\n\nIn today's value system, such differences may make them feel \"proud.\" They will think that you in the mainland cannot hold the \"July 1st Parade\", but we can. You value political unity, but we can \"confront\" the central government. These confrontational activities make some people feel \"high-mainland\". They may not attach great importance to the results, but are willing to participate, thus being exploited by the radical opposition.\n\nThe different political systems of the mainland and Hong Kong seem destined to have some points of intersection and friction. How to manage the differences between the two sides has become a challenge to the country. It is very important to study Hong Kong's chaotic July 1st demonstrations clearly, distinguish between what the radical opposition demands and what ordinary citizens are thinking, and not be kidnapped by Hong Kong's various demonstrations. Such stability is very important.\n\nThere is no contradiction between adhering to the principles of the Basic Law and responding to the numerous demands of ordinary citizens. Taking care of the emotions of ordinary Hong Kong citizens should not be at the expense of increasing the distance or even antagonism between the mainland and Hong Kong people. The country does not have to expect too much from Hong Kong society, and it must be able to withstand demonstrations and demonstrations there. If this is the case, the \"July 1st Parade\" in Hong Kong is nothing, and even if there are local conflicts between police and citizens, it is nothing significant.\n\nAs long as those who participate in the demonstrations confirm that the country cannot retreat at all through this method, the political enthusiasm gathered by this kind of protest will eventually decline, and demonstrations will become a daily thing in Hong Kong, and as a kind of political culture, it will remain tepid. The presence of fire. Therefore, for protests such as the July 1st Parade, adapting to them, not taking them too seriously, and encouraging illegal actions to be dealt with in accordance with the law should be the basic starting point for the country to formulate strategies.", "uid": "02_06_18", "input": "", "char_offset": "0-677"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1638081771440085054&wfr=spider&for=pc", "title": "涉嫌暴力冲击香港立法会，12人已被警方拘捕！", "stance": "neg", "content": "", "translation": "Geng Shuang: Is the British police's response to the London riots repression?\nAgence France-Presse reported on the 3rd that British Prime Minister Theresa May told members of Congress that day that she directly expressed her \"concerns\" to China about protecting Hong Kong's autonomy. May admitted she was \"surprised\" by the violent demonstrations at Hong Kong's Legislative Council, but stressed that hundreds of thousands of Hong Kong people marched \"peacefully and lawfully\". Agence France-Presse stated that a few hours before May's remarks, Beijing had just expressed its strong dissatisfaction and firm opposition to British Foreign Secretary Hunt's erroneous remarks on Hong Kong, and revealed that both London and Beijing had lodged stern representations with the British side.\nHunt claimed on the 2nd that the \"Sino-British Joint Declaration\" is still legally binding and if it is not implemented, \"the consequences will be very serious.\" The British \"Times\" said that his threatening remarks made relations between Britain and China tense. Beijing had previously hit back at Hunter's words and deeds for two consecutive days, warning the UK not to interfere in China's internal affairs. \"He (Hunter) seems to be still immersed in the illusion of the British colonists in the past, and is still obsessed with the bad habit of dictating the affairs of other countries from a superior position. He still does not want to repent and continues to talk nonsense. I will simply say a few more words today.\" Geng Shuang said on the 3rd that the British side has no sovereignty, no governance power, and no supervision power over Hong Kong after its return. There is no so-called \"responsibility\" at all. \"I would like to ask Mr. Hunt, during the British colonial rule of Hong Kong, what kind of democracy was there in Hong Kong? Hong Kong people did not even have the right to march on the streets.\"\nHunter ignored the facts and ignored the violent attack on the Legislative Council by extremists, but urged the Hong Kong government not to use the vandalism during the protests as an excuse for \"repression.\" Geng Shuang asked three sharp questions: If the British Parliament is besieged, broken into, and destroyed, will the British government let it go and sit idly by? If, as Mr. Hunt says, this is democracy, does he think that the police who closely guard the British Parliament should be withdrawn and the demonstrators who have always stood opposite the Parliament should be allowed to enter the Parliament? Does he also think that the British police's handling of the riots in London in August 2011 was repression?\nOn the 2nd, Peter, a British man who has worked and lived in mainland China and Hong Kong for at least 35 years, bluntly said in an interview with the Associated Press that if in Western countries such as the United Kingdom and the United States, thugs would face real bullets instead of rubber bullets, almost Ten or even hundreds of people could be killed or injured. He called the thugs' damage to the democratic process in Hong Kong and the mainland \"the most tragic thing.\"\nBritain, which is stuck in the quagmire of Brexit, is currently facing a battle for prime minister. One of the candidates is Hunt, who has frequently used the Hong Kong issue to show his toughness in recent days. Another candidate, former Foreign Secretary Johnson, seems to understand this well and is not willing to lag behind. British Reuters reported that Johnson claimed on the 3rd that he warned Beijing not to abandon \"one country, two systems\"\nOn the 3rd, the head of the Commissioner's Office of the Chinese Ministry of Foreign Affairs in Hong Kong solemnly requested the British side to face up to the reality that Hong Kong has returned to the motherland 22 years ago, immediately stop interfering in Hong Kong affairs and China's internal affairs, and stop going further down the wrong path.", "uid": "02_06_80", "input": "", "char_offset": "0-914"}
{"language": "Chinese", "url": "https://www.guancha.cn/local/2017_08_15_422956.shtml", "title": "香港13人冲击立法会一案改判 即时监禁8到13个月", "stance": "neg", "content": "", "translation": "According to Hong Kong Wenhui.com, on August 15, the case of 13 demonstrators convicted of storming the Hong Kong SAR Legislative Council in June 2014 was announced to have been changed. The judge finally ruled that based on the level of violence in the case and everyone's attitudes, the previous sentence of social service order was obviously too light. This time, starting from 15 months' imprisonment, the defendants were sentenced to 8 to 13 months' imprisonment.\n\nWenhui.com reported that demonstrators stormed the Legislative Council building when the Finance Committee of the Legislative Council was reviewing funding for the early stage development of the Northeast New Territories in June 2014. A large number of demonstrators hit the door of the Legislative Council with bamboo poles and other objects. In February last year, the Eastern District Magistrates' Court found 13 defendants guilty of \"participating in an illegal assembly\" but not guilty of \"attempting to enter by force\". They were sentenced to 80 to 150 hours of community service orders.\n\nThe Department of Justice applied to the Court of Appeal for a sentence review yesterday (14th), stating that the situation that day was extremely serious and the violent behavior of several defendants was close to the critical point of riot. Only imprisonment is the appropriate sentence. Wan Dehao, Senior Assistant Public Prosecution Commissioner of the Department of Justice, stated in court that the crime in this case was extremely serious. Not only the arrested persons were involved, but also a large-scale illegal assembly of more than 100 people. They were \"complicit in committing the crime\" and \"a collective action\". Taking advantage of their large numbers and ignoring the police presence inside the Legislative Council, the demonstrators used bamboo branches, umbrellas and metal tools removed from trolleys to force open the glass door of the Legislative Council building. The Legislative Council is an important symbol of the rule of law in Hong Kong. The large-scale attack by demonstrators is a blatant challenge to law and order, a disregard for public order, and a serious illegal act. The situation may turn into a riot.", "uid": "02_06_91", "input": "", "char_offset": "0-505"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_25", "input": "", "char_offset": "0-262"}
{"language": "English", "url": "https://www.chinadaily.com.cn/global/2019-08/01/content_37497652.htm", "title": "Preserving HK's bridging role in everyone's interest", "stance": "neg", "content": "", "translation": "", "uid": "02_06_214", "input": "", "char_offset": "0-505"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wOS8yNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0LXZpb2xlbmNlLWludGwtaG5rL2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDE5LzA5LzI2L2FzaWEvaG9uZy1rb25nLXByb3Rlc3QtdmlvbGVuY2UtaW50bC1obms?oc=5\n", "title": "How a summer of protest pushed young Hong Kongers to the edge | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_162", "input": "", "char_offset": "0-2685"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy93b3JsZC1hc2lhLWNoaW5hLTQ0Njc0OTgy0gE2aHR0cHM6Ly93d3cuYmJjLmNvbS9uZXdzL3dvcmxkLWFzaWEtY2hpbmEtNDQ2NzQ5ODIuYW1w?oc=5\n", "title": "Hong Kong pro-democracy protests draw lower turnout", "stance": "pos", "content": "", "translation": "", "uid": "02_00_58", "input": "", "char_offset": "0-2036"}
{"language": "Chinese", "url": "https://www.guancha.cn/local/2014_11_21_301216.shtml", "title": "香港警方再拘4人 冲击立法会暴力分子大起底", "stance": "neg", "content": "", "translation": "Clearance operation in Mong Kok causes concern\n\nHuang Yangda flatly denied planning to attack the Legislative Council. However, his affiliated \"Hot Blood Times\" continued to publish articles online on the 19th, supporting that the incident was just hitting a dead object and not hurting anyone, and that it was a reasonable behavior. He praised the thugs for \"they can muster the courage to try to escalate the action and break the gap.\" very impressive\". According to Hong Kong’s Ta Kung Pao, it is initially expected that the removal of obstacles in Mong Kok will begin as early as next Tuesday. At present, in order to resist the court injunction, \"hot-blooded citizens\" have hoarded a large amount of anti-clearance equipment in Mong Kok. \"It is expected that the clearance and clearing operations in Mong Kok will encounter more obstructions, which may lead to large-scale violent conflicts.\"\n\nThe Federation of Students and pan-democratic parties have drawn a clear line with the \"passionate citizens\". \"Sing Tao Daily\" disclosed on the 20th that after the students' federation failed to invade Beijing, Hong Kong media spread rumors that the central government might have a \"blacklist\" of 500 people, and that 300 \"Occupy Central\" supporters were planning to try to enter the country in batches through different mainland gates. Shenzhen paid close attention to it. Starting from the early morning customs clearance on the 19th, a large number of mobile training brigade personnel were divided into multiple groups and patrolled at different locations at Luohu Port. They were equipped with batons and explosion-proof helmets to guard against possible attacks and riots.", "uid": "02_06_98", "input": "", "char_offset": "0-391"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-09/20/c_138407666.htm", "title": "Interview: Hong Kong MTR under strain amid prolonged violence, says CEO", "stance": "neg", "content": "", "translation": "", "uid": "02_06_206", "input": "", "char_offset": "0-1339"}
{"language": "English", "url": "http://www.chinadaily.com.cn/kindle/2019-11/23/content_37524955.htm", "title": "HK protests expose Western media bias", "stance": "neg", "content": "", "translation": "", "uid": "02_06_124", "input": "", "char_offset": "0-1369"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI0LzAzLzE5L2hvbmcta29uZy1hcnRpY2xlLTIzLXNlY3VyaXR5LWxhdy_SAQA?oc=5\n", "title": "Hong Kong passes sweeping Article 23 security law - The Washington Post", "stance": "neutral", "content": "", "translation": "", "uid": "02_00_3", "input": "", "char_offset": "0-2515"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/06/c_138286032.htm", "title": "Xinhua Headlines: Protesters cause mayhem as HKSAR chief executive warns of \"very dangerous situation\"", "stance": "neg", "content": "", "translation": "", "uid": "02_06_166", "input": "", "char_offset": "0-864"}
{"language": "English", "url": "https://www.chinadaily.com.cn/kindle/2019-08/25/content_37505382.htm", "title": "Protests disrupt city's stability and operations", "stance": "neg", "content": "", "translation": "", "uid": "02_06_134", "input": "", "char_offset": "0-2011"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1708487851822358792&wfr=spider&for=pc", "title": "非法运作近20年，这个香港组织何以逍遥法外这么久？涉嫌勾结境外势力危害国家安全，光解散还不能完", "stance": "neg", "content": "", "translation": "The \"Democratic Front\" declared that it was \"relentless in its evil intentions\" and still attempted to create a binary opposition between the central government, the SAR government and the so-called civil society. It played the card of tragedy, created an image of being forced to disband, and concealed the fact that it was abandoned.\nThe Democratic Front was first abandoned by the times. Today, when the international situation is undergoing profound and complex changes, Hong Kong, as a special administrative region of the country, must of course stand with the country to safeguard national security and defend national interests in a complex multilateral international environment. Especially after the central government took the initiative to fill Hong Kong's legal loopholes in maintaining national security in 2020 in response to the international situation and the situation in Hong Kong, maintaining national security has become an important issue in Hong Kong. Of course, the \"Han\" organization will only end up being abandoned by the times.\nSecondly, the Democratic Front was abandoned by its former fellow travelers. As early as early March this year, after news spread that the Democratic Front might be banned according to law, its members cut their seats one after another and announced that they would terminate their participation in the work of the Democratic Front. The \"Democratic Front\" groups quickly shrunk from 48 to less than 10 before disbandment, leaving behind the radical political group and its satellite organizations of the last two conveners. Members are jumping ship one after another. Is it because the world is so cold and they throw it away after use, or are they cutting off their robes and severing their righteousness to protect themselves wisely? On the bright side, these pan-democratic groups participating in the \"Democratic Front\" also have legal concepts. Faced with possible legal liabilities, of course they choose to cut themselves off to protect themselves. When the members dispersed, the platform of the \"Democratic Front\" naturally collapsed.\nIn the end, the \"Democratic Front\" was abandoned by the Hong Kong people. As the initiator, leader, and operator of the \"July 1 Parade\" and the \"Amendment Movement\" demonstrations in Hong Kong for many years, the \"Democratic Front\" is well aware of whether these demonstrations have brought a good reputation or a bad influence to Hong Kong. After experiencing a series of incidents such as the \"revision storm\", the disbandment of \"Hong Kong independence\" organizations after the promulgation of the Hong Kong National Security Law, the imprisonment of \"Hong Kong independence\" elements, and the flight of others, many Hong Kong people have seen more To make it clear: what kind of organization and what kind of behavior are really good for Hong Kong, and what kind of organization and what kind of behavior are specifically bringing chaos to Hong Kong. Now that Hong Kong people have seen clearly, the disbandment of the Democratic Front is the inevitable result of the development of Hong Kong's social situation.", "uid": "02_06_44", "input": "", "char_offset": "0-701"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vZ2FsbGVyeS8yMDE5LzcvMS9pbi1waWN0dXJlcy1ob25nLWtvbmctcHJvdGVzdGVycy1zdG9ybS1nb3Zlcm5tZW50LWhlYWRxdWFydGVyc9IBbWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL2dhbGxlcnkvMjAxOS83LzEvaW4tcGljdHVyZXMtaG9uZy1rb25nLXByb3Rlc3RlcnMtc3Rvcm0tZ292ZXJubWVudC1oZWFkcXVhcnRlcnM?oc=5\n", "title": "In Pictures: Hong Kong protesters storm government headquarters | Hong Kong Protests | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_71", "input": "", "char_offset": "0-1064"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1793693314473700201&wfr=spider&for=pc", "title": "2019年冲击香港立法会大楼12人暴动罪成", "stance": "neg", "content": "", "translation": "The Hong Kong police announced on the 16th that in the case of demonstrators attacking the Legislative Council (Legislative Council) building of the Hong Kong Special Administrative Region on July 1, 2019, the 14 defendants involved were found guilty after trial. The case was sentenced in the Hong Kong District Court on the 16th. Among them, 12 The man was sentenced to 54 months to 82 months in prison for rioting.\nChief Inspector Wong Chi-tang of the Police Organized Crime and Triad Investigation Bureau said that on the afternoon of July 1, 2019, a large number of demonstrators gathered outside the Legislative Council Building and used iron cages, iron bars, etc. to attack the glass outside the Legislative Council Building, and then Break in and cause massive destruction. After investigation, the police charged 14 defendants, including 12 men and 2 women, aged 19 to 40 at the time of the crime, for \"riot\", \"criminal damage\" and \"violation of administrative instructions\". All were found guilty after trial, and 12 of them were sentenced to prison terms ranging from 54 months to 82 months.\nHuang Zhiteng said that the relevant cases were planned and premeditated, and he believed that the court's sentence could reflect the seriousness of the case and also act as a deterrent. He said that the Legislative Council has a unique constitutional status and symbolic significance. In addition to destroying objects in the Legislative Council building, the demonstrators also tried to weaken and overthrow Hong Kong's constitution and attack Hong Kong's rule of law. The judge also pointed out in the ruling that this was a serious case. .\nHuang Zhiteng mentioned that this incident involved more than a thousand demonstrators. The police analyzed online clips and found 14 people involved. If new evidence is discovered or discovered later, the police may continue to arrest and prosecute.", "uid": "02_06_58", "input": "", "char_offset": "0-462"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/201908/17/WS5d578b28a310cf3e355664f1_1.html", "title": "Who is behind Hong Kong protests?", "stance": "neg", "content": "", "translation": "", "uid": "02_06_175", "input": "", "char_offset": "0-1120"}
{"language": "Chinese", "url": "https://m.thepaper.cn/baijiahao_4310240", "title": "突发！大量示威者冲击港府立法会，投掷汽油弹", "stance": "neg", "content": "", "translation": "According to @globaltimes, Hong Kong police reported that radical and violent demonstrators occupied Harcourt Road in Admiralty, damaged the Legislative Council building, and repeatedly threw petrol bombs, corrosive liquids and bricks. The police used minimum force, including colored water and tear gas, to disperse the demonstrators after repeatedly warning them to stop violating the law.\nThe Global Times previously reported that on the afternoon of August 31, although the police had issued a notice of objection to the demonstration, a large number of demonstrators still illegally marched westward from Wan Chai. At around 16:20, the Hong Kong police issued another warning.\n\nAt about 16:30 in the afternoon, the reporter saw on Des Voeux Road West in Sheung Wan near the Central Liaison Office in Sai Ying Pun, Hong Kong Island. Most of the street shops were closed and there were few pedestrians on the road. Citizens were obviously very worried about violence caused by illegal demonstrations. . The Sai Ying Pun area is a famous seafood market on Hong Kong Island. Many residents come to buy seafood on weekdays and weekends. Today, reporters saw almost no people here.\nAt around 17:40 in the afternoon, some \"demonstrators\" set fire in front of the water horse formation deployed by the Hong Kong police at the intersection of Harcourt Road and Tim Wah Road in Admiralty, Hong Kong. The police water cannon truck was immediately dispatched to put out the fire. Subsequently, the illegal demonstrators continued to provoke, and the police once again used water cannon trucks and sprayed colored water spray instead.\nHong Kong police previously introduced that \"colored water\" is actually edible paint, which is non-toxic in itself and can be fired by a \"mobile high-pressure liquid spray device\" or a backpack tear gas injector. If the paint water is sprayed, it will remain on the surface of the body or clothes. If necessary, the police can use this to identify whether an individual is at the demonstration site.", "uid": "02_06_94", "input": "", "char_offset": "0-501"}
{"language": "Chinese", "url": "https://world.huanqiu.com/article/44L8ry2e53p", "title": "乱港分子制定“三条战线”妄想七一决战？乱港四人帮各怀啥心思？", "stance": "neg", "content": "", "translation": "\"Local Front\" - an attempt to \"law and justice\"\nThis \"front\" plans to \"shut down\" Hong Kong by inciting millions of people to demonstrate and protest, and to carry out \"everywhere\" strikes and school strikes.\nIn the early days, Wu Man-yee, the chairman of the Workers' Union who set up stalls and \"stood on the streets\" to persuade Hong Kong citizens to boycott the national security law, and was jointly pursued by the Hong Kong police and citizens, finally succeeded in hiding behind the scenes and serving as the \"general commander\". It is said that his soldiers and crab generals have included \"two The \"Million Three Strikes United Front\", \"Student Mobilization\", \"Private Journalists Club\", as well as some opposition members of the 17th District, and many other reasons.\nFor this long-planned farce, the Hong Kong chaos elements also worked hard: they held a sparse \"preview\" on the streets on June 14, and subsequently staged \"street movements\" on July 1 and August 31. But the Hong Kong police have been resolute in enforcing the law recently. What should I do? They have pinned their hopes on the idea that \"the law does not punish the public\", and it is said that they also want to use this to give the \"Hong Kong version of the National Security Law\" a \"powerful\" blow. It’s so easy to break a sweet dream! All I can do is laugh.", "uid": "02_06_22", "input": "", "char_offset": "0-326"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5pZmoub3JnL21lZGlhLWNlbnRyZS9uZXdzL2RldGFpbC9jYXRlZ29yeS9wcmVzcy1yZWxlYXNlcy9hcnRpY2xlL2hvbmcta29uZy1jb3VydC1jb252aWN0cy1qb3VybmFsaXN0cy1vZi11bmF1dGhvcmlzZWQtZW50cnktaW50by1sZWdpc2xhdHVyZdIBAA?oc=5\n", "title": " Hong Kong: Court convicts journalists of unauthorised entry into legislature - IFJ", "stance": "pos", "content": "", "translation": "", "uid": "02_00_10", "input": "", "char_offset": "0-3104"}
{"language": "Chinese", "url": "https://www.thepaper.cn/newsDetail_forward_3852661", "title": "香港警方拘捕16男2女 涉冲击立法会等多项暴力事件", "stance": "neg", "content": "", "translation": "According to the latest news from the Hong Kong police, after investigation, the Hong Kong police arrested a total of 11 men and 1 woman, aged between 14 and 36, in connection with the violent incident that occurred in the area of ​​the Legislative Council Complex on the morning of July 1. \"Sex weapons\", \"illegal assembly\", \"assaulting police officers\", \"obstructing police officers in the performance of their duties\", \"violating the Air Navigation (Hong Kong) Order 1995\" and \"failure to produce identification documents\" and other crimes.\nIn addition, the police arrested a total of 5 men and 1 woman, aged between 20 and 72, for multiple cases that occurred during a public gathering in Central District on June 30. They were suspected of \"possessing offensive weapons\" and \"assault\". Causing bodily harm\", \"common assault\" and \"fighting in a public place\".\n\nFunders bribed Hong Kong youths to attack the Legislative Council.\n\n\"Division of labor\" clearly states that the amounts vary", "uid": "02_06_66", "input": "", "char_offset": "0-260"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-09/14/c_138391586.htm", "title": "Xinhua Headlines: Prolonged unrest plunges Hong Kong into rift and pain", "stance": "neg", "content": "", "translation": "", "uid": "02_06_226", "input": "", "char_offset": "0-1589"}
{"language": "English", "url": "https://www.chinadaily.com.cn/global/2019-07/03/content_37487390.htm", "title": "Manipulated protests harming Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_183", "input": "", "char_offset": "0-1619"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS93b3JsZC8yMDI0L21hci8xNi9ob25nLWtvbmctY291cnQtamFpbHMtMTItZm9yLXN0b3JtaW5nLXBhcmxpYW1lbnQtaW4tcHJvLWRlbW9jcmFjeS1wcm90ZXN0c9IBeGh0dHBzOi8vYW1wLnRoZWd1YXJkaWFuLmNvbS93b3JsZC8yMDI0L21hci8xNi9ob25nLWtvbmctY291cnQtamFpbHMtMTItZm9yLXN0b3JtaW5nLXBhcmxpYW1lbnQtaW4tcHJvLWRlbW9jcmFjeS1wcm90ZXN0cw?oc=5\n", "title": "Hong Kong court jails 12 for storming parliament in pro-democracy protests | Hong Kong | The Guardian", "stance": "pos", "content": "", "translation": "", "uid": "02_00_11", "input": "", "char_offset": "0-3083"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNubi5jb20vMjAyNC8wMy8xNi9hc2lhL2hvbmcta29uZy1qYWlscy0xMi1sZWdjby1zdG9ybWluZy1pbnRsLWhuay9pbmRleC5odG1s0gFSaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAyNC8wMy8xNi9hc2lhL2hvbmcta29uZy1qYWlscy0xMi1sZWdjby1zdG9ybWluZy1pbnRsLWhuaw?oc=5\n", "title": "Hong Kong jails 12 people over the storming of the legislature in 2019 | CNN", "stance": "neutral", "content": "", "translation": "", "uid": "02_00_8", "input": "", "char_offset": "0-1115"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_29", "input": "", "char_offset": "0-375"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy52b2FuZXdzLmNvbS9hL2Vhc3QtYXNpYS1wYWNpZmljX2hvbmcta29uZy1wcm90ZXN0ZXJzLW91dHJhZ2VkLWJlaWppbmdzLWNvbXBhcmlzb24tdXMtY2FwaXRvbC1zaWVnZS1zdG9ybWluZy82MjAwNTg3Lmh0bWzSAYYBaHR0cHM6Ly93d3cudm9hbmV3cy5jb20vYW1wL2Vhc3QtYXNpYS1wYWNpZmljX2hvbmcta29uZy1wcm90ZXN0ZXJzLW91dHJhZ2VkLWJlaWppbmdzLWNvbXBhcmlzb24tdXMtY2FwaXRvbC1zaWVnZS1zdG9ybWluZy82MjAwNTg3Lmh0bWw?oc=5\n", "title": "Hong Kong Protesters Outraged by Beijing’s Comparison of US Capitol Siege to Storming of Legislature", "stance": "pos", "content": "", "translation": "", "uid": "02_00_100", "input": "", "char_offset": "0-2616"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wOS8yNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0LXZpb2xlbmNlLWludGwtaG5rL2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDE5LzA5LzI2L2FzaWEvaG9uZy1rb25nLXByb3Rlc3QtdmlvbGVuY2UtaW50bC1obms?oc=5\n", "title": "How a summer of protest pushed young Hong Kongers to the edge | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_163", "input": "", "char_offset": "0-2404"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/21/c_138324268.htm", "title": "Xinhua Headlines: How external forces have inflamed tensions in Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_218", "input": "", "char_offset": "0-1331"}
{"language": "English", "url": "https://www.chinadaily.com.cn/hkedition/2019-10/22/content_37517400.htm", "title": "'Liberate Hong Kong' is a separatist movement", "stance": "neg", "content": "", "translation": "", "uid": "02_06_233", "input": "", "char_offset": "0-3187"}
{"language": "English", "url": "https://www.chinadaily.com.cn/a/201909/07/WS5d739360a310cf3e3556a4ad.html", "title": "Fake reporters obstruct officers on duty: Hong Kong police", "stance": "neg", "content": "", "translation": "", "uid": "02_06_127", "input": "", "char_offset": "0-2251"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmNubi5jb20vMjAyMC8wNy8wMS9hc2lhL2dhbGxlcnkvaG9uZy1rb25nLXVucmVzdC0yMDIwL2luZGV4Lmh0bWzSAQA?oc=5\n", "title": "New security law sparks protests in Hong Kong | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_91", "input": "", "char_offset": "0-1125"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDIyLzYvMzAvaG9uZy1rb25nLXRpbWVsaW5lLTE5OTctdG8tMjAyMtIBTGh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAyMi82LzMwL2hvbmcta29uZy10aW1lbGluZS0xOTk3LXRvLTIwMjI?oc=5\n", "title": "Hong Kong: 25 years under Chinese rule | Politics News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_73", "input": "", "char_offset": "0-1312"}
{"language": "English", "url": "https://krdo.com/news/2024/03/16/hong-kong-jails-12-people-over-the-storming-of-the-legislature-in-2019/?utm_source=ground.news&utm_medium=referral", "title": "Hong Kong jails 12 people over the storming of the legislature in 2019", "stance": "neutral", "content": "", "translation": "", "uid": "02_09_2", "input": "", "char_offset": "0-852"}
{"language": "Chinese", "url": "https://www.thepaper.cn/newsDetail_forward_1253787", "title": "香港“七一游行”凌晨清场，警方共拘捕511名滋事者", "stance": "neg", "content": "", "translation": "The U.S. State Department takes another stance on Hong Kong affairs\n\n        U.S. State Department spokesman Harf expressed the U.S. attitude toward the \"July 1st March\" in Hong Kong at a regular press conference.\n\n        \"We support Hong Kong's long-established traditions and basic legal protections, including universally recognized freedoms such as peaceful assembly and freedom of expression,\" Harf claimed.\n\n        She said, \"We believe that an open society with the greatest degree of autonomy and governance by law is truly a necessary factor for Hong Kong's stability and prosperity.\"\n\n        Harf said she knew the process for the 2017 chief executive election was still being worked out, but the United States \"believes that if universal suffrage can be achieved and if the chief executive election can provide a choice of candidates who truly represent the will of the voters, it will strengthen the legitimacy of this person.\" sex\".\n\n        The U.S. State Department has repeatedly stated its position on the \"Occupy Central Referendum\" incident in Hong Kong. On June 26, Chinese Foreign Ministry spokesperson Hua Chunying once again reiterated at a regular press conference that issues of political development are Hong Kong's internal affairs. China The government firmly opposes any foreign intervention in any form.\n\n        In response to the demonstrations on July 1, a Hong Kong government spokesman pointed out that the Hong Kong government respects the freedom and right of citizens to express their opinions, and has always encouraged citizens to express their opinions peacefully through legal channels.\n\n        When meeting with representatives of several Hong Kong youth visiting delegations at the Great Hall of the People in Beijing yesterday, Chinese Vice President Li Yuanchao said that the Hong Kong government is currently promoting political reform under the framework of the Basic Law and hopes that young people in Hong Kong can raise their awareness of the rule of law and support Hong Kong. In accordance with the Basic Law and relevant decisions of the Standing Committee of the National People's Congress, the government will promote Hong Kong's political reform in an orderly manner and safeguard \"one country, two systems\", the Basic Law and Hong Kong's prosperity and stability.", "uid": "02_06_5", "input": "", "char_offset": "0-586"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1638022607520854108&wfr=spider&for=pc", "title": "维修费达6000万！香港警方将拘捕冲击立法会暴徒", "stance": "neg", "content": "", "translation": "On the 2nd, detectives from the Organized Crime and Triad Investigation Bureau of the Hong Kong Police searched for evidence inside and outside the Legislative Council Building and collected a large amount of evidence. The police currently have evidence against at least 10 people and will arrest them as soon as possible.\nAccording to reports, the Organized Crime and Triad Investigation Bureau sent a total of about 30 detectives to the Legislative Council Building, Tim Mei Road and the Legislative Council Demonstration Area on the morning of the 2nd to conduct investigations with the Forensic Bureau and Government Chemist personnel. Investigators used 3D scanners to produce three-dimensional or plan views, hoping to obtain accurate measurement data.\nThe police currently have information on at least 10 people involved in violent crimes. They are suspected of online bullying, attacking various government departments and besieging the police headquarters. The police will carry out continuous arrest operations in the near future. On the 1st, the police arrested 9 people involved in different crimes, including a 35-year-old man surnamed Liu who was involved in transporting supplies.\nOn the 3rd, Hong Kong's \"Bus Daily\" quoted a number of legal professionals as saying that the demonstrators who stormed the Legislative Council building had committed multiple criminal offences.\nHong Kong lawyer Luk Wei-hsiung believes that the actions of the demonstrators on the evening of the 1st violated multiple crimes. First of all, those who initially assembled outside the Legislative Council and used tools to break the glass and doors can be charged with illegal assembly and sentenced to up to five years in prison. They also He can be charged with rioting and criminal damage, both of which carry a maximum penalty of ten years in prison.\nAfter entering the Legislative Council building, Lu Weixiong believed that those who vandalized the Legislative Council should add Article 20 of the Public Security Ordinance \"rioters demolish buildings and other acts\" and Article 21 \"rioters destroy buildings, machinery, etc.\" , Article 23 \"Forcible entry\" and Article 24 \"Forcible occupation of premises\". The first two crimes carry a maximum sentence of fourteen years and ten years respectively, while the last two crimes carry a maximum sentence of two years.\nHong Kong lawyer Shi Shuming added that some demonstrators spray-blackened the SAR emblem in the Council Chamber. He said that relevant persons may violate the \"Regional Flag and Regional Emblem Ordinance\". Anyone can openly and deliberately burn, destroy, scribble, defile, trample, etc. Anyone who insults the regional flag or emblem in such a manner may be punished with a maximum penalty of three years in prison and a fine of NT$50,000.", "uid": "02_06_75", "input": "", "char_offset": "0-650"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3Lm5wci5vcmcvMjAyNC8wMy8xNi8xMjM4OTc2MDY2L2hvbmcta29uZy1qYWlscy0xMi1wZW9wbGUtc3Rvcm1pbmctbGVnaXNsYXR1cmUtMjAxOS1wcm90ZXN0c9IBAA?oc=5\n", "title": "Hong Kong jails 12 people over the storming of the legislature in 2019 protests  : NPR", "stance": "neutral", "content": "", "translation": "", "uid": "02_00_0", "input": "", "char_offset": "0-2413"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/16/c_138313334.htm", "title": "Opinion: Protesters in Hong Kong shock world with ugly tactics", "stance": "neg", "content": "", "translation": "", "uid": "02_06_129", "input": "", "char_offset": "0-1471"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-09/14/c_138391586.htm", "title": "Xinhua Headlines: Prolonged unrest plunges Hong Kong into rift and pain", "stance": "neg", "content": "", "translation": "", "uid": "02_06_229", "input": "", "char_offset": "0-1008"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_27", "input": "", "char_offset": "0-293"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1694219167959307257&wfr=spider&for=pc", "title": "幕后金主正被调查！香港“民阵”陷入分崩离析，多个团体宣布退出", "stance": "neg", "content": "", "translation": "Hong Kong public opinion calls for ban\nArticle 29 of the Hong Kong National Security Law states that “directly or indirectly accepting the instigation, control, funding or other forms of support from foreign or overseas institutions, organizations, personnel, and using various illegal means to cause Hong Kong SAR residents to express their disapproval of the central government or the SAR government. hatred and may cause serious consequences, it is a crime of colluding with foreign countries or external forces to endanger national security.\" Some analysts said that if the Democratic Front accepts donations from unknown sources, law enforcement agencies can prompt or notify the relevant banks to freeze their accounts. It can be seen from this that groups such as the Civic Party have jumped ship. Not only because the Democratic Front has not been registered, but also because they are worried that law enforcement agencies will be implicated when they investigate the source of funds of the Democratic Front. DAB Legislative Council member Ge Peifan said that most of the demonstrations initiated by the \"Democratic Front\" eventually turned into riots of beating, smashing, and burning, which raised doubts about the involvement of foreign forces behind the scenes; now, many \"speculation-seeking\" parties are completely in conflict with the \"Democratic Front\" The cutting of seats further reflects that the incident is unusual and that relevant departments should investigate as quickly as possible while ensuring national security. Vice Chairman of the New Democratic Party and barrister Yung Hoi-en said that this incident reflects the success of Hong Kong’s national security law in dismantling the forces of chaos in Hong Kong. After the implementation of the National Security Law in Hong Kong, the \"speculators\" realized that staying in the Democratic Front would have no good results and that the past actions of the Democratic Front may be illegal, so they withdrew one after another. This has further raised questions about their alleged collusion with foreign countries to endanger the country. security, and even received funding from the \"anti-China chaos in Hong Kong\" forces. The Security Bureau and the National Security Division of the Police should further investigate. Some Hong Kong media said on the 13th that Russian media disclosed in July 2019 that the \"Hong Kong Society of Human Resources Management\", \"Hong Kong Workers' Union\" and \"Hong Kong Journalists Association\" had cooperated with NED and obtained funds. The above-mentioned organizations were all \"Floem Democratic\" \"member. The SAR government is launching an investigation. If it is confirmed that the Democratic Front has received foreign funding, the organization should be banned.", "uid": "02_06_43", "input": "", "char_offset": "0-587"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1670636022493002538&wfr=spider&for=pc", "title": "香港警方反对7月1日集会游行：增加市民染疫风险", "stance": "neg", "content": "", "translation": "Overseas Network, June 27th According to Hong Kong's \"Eastern Network\" report, the Hong Kong opposition planned to hold rallies and marches on June 28 and July 1 respectively. The police issued notices on the 26th to object.\nAccording to reports, due to the impact of the new coronavirus epidemic, the Hong Kong SAR government has extended the \"ban on gatherings\" until July 2, restricting gatherings of more than 50 people. The notice of objection issued by the Hong Kong Police yesterday (26th) also pointed out that taking into account factors such as the epidemic and the \"ban on gatherings\", it is believed that holding public gatherings or processions will increase the risk of citizens contracting the epidemic and pose a threat to the lives and health of all citizens. Serious threats, endangering public safety and affecting the rights of others.\nIn addition, the police mentioned in the notice of objection that violent incidents occurred during the parade on July 1 last year, as well as at many public gatherings or parades from May to June this year, and the application for this parade was very close to being approved. Buildings at high risk of conflict and violence.\nAfter the police issued the notice of objection, the applicant immediately lodged an appeal. The Public Meetings and Processions Appeal Committee held a hearing this morning (27th) and ultimately decided to uphold its objection to the holding of the above two processions and rallies on the grounds that the processions were contrary to public safety, order and security.", "uid": "02_06_0", "input": "", "char_offset": "0-381"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAyMS8wNi8yOS9hc2lhL2hvbmcta29uZy1uc2wtb25lLXllYXItaW50bC1obmstZHN0L2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDIxLzA2LzI5L2FzaWEvaG9uZy1rb25nLW5zbC1vbmUteWVhci1pbnRsLWhuay1kc3Q?oc=5\n", "title": "Hong Kong: One year after China passed the national security law, residents feel Beijing’s tightening grip | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_149", "input": "", "char_offset": "0-1211"}
{"language": "English", "url": "http://www.chinadaily.com.cn/kindle/2019-11/23/content_37524955.htm", "title": "HK protests expose Western media bias", "stance": "neg", "content": "", "translation": "", "uid": "02_06_125", "input": "", "char_offset": "0-835"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vaHViLmpodS5lZHUvMjAyMC8wNy8wNC9ob25nLWtvbmctc2VjdXJpdHktbGF3L9IBAA?oc=5\n", "title": "An end to Hong Kong as we know it? | Hub", "stance": "pos", "content": "", "translation": "", "uid": "02_00_201", "input": "", "char_offset": "0-2405"}
{"language": "Chinese", "url": "https://www.thepaper.cn/newsDetail_forward_1253787", "title": "香港“七一游行”凌晨清场，警方共拘捕511名滋事者", "stance": "neg", "content": "", "translation": "Hundreds of thousands of Hong Kong citizens took to the streets on July 1 to demand that the SAR government implement true universal suffrage. Hong Kong police arrested a total of 511 people during a clearance operation early this morning. Chief Superintendent Hui Chun-tak of the Police Public Relations Branch said the arrested persons were suspected of participating in an unauthorized assembly and obstructing police officers in the performance of their duties. Some have now been released.\n\n        Hong Kong media said the parade ended at 10pm last night and most citizens dispersed peacefully. However, about 2,000 people still occupied Chater Road in Central and besieged the Chief Executive's office, threatening to \"welcome\" Chief Executive Leung Chun-ying to work today.", "uid": "02_06_3", "input": "", "char_offset": "0-194"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3Lm55dGltZXMuY29tL2ludGVyYWN0aXZlLzIwMTkvMDcvMDEvd29ybGQvYXNpYS9ob25nLWtvbmctcHJvdGVzdC1tYXAuaHRtbNIBAA?oc=5\n", "title": "Hong Kong Protests: Mapping Where Police and Crowds Clashed - The New York Times", "stance": "pos", "content": "", "translation": "", "uid": "02_00_102", "input": "", "char_offset": "0-776"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vaG9uZ2tvbmdmcC5jb20vMjAyMi8wNy8wMi90aW1lbGluZS1ob25nLWtvbmdzLWp1bHktMS1jYXJuaXZhbC1vZi1kaXNzZW50LWhvdy0xNy15ZWFycy1vZi1wcm90ZXN0LWRlbWFuZHMtZmVsbC1zaWxlbnQv0gEA?oc=5\n", "title": "Timeline: Hong Kong's July 1 carnival of dissent - how 17 years of protest demands fell silent | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_50", "input": "", "char_offset": "0-2886"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3Lm55dGltZXMuY29tL2ludGVyYWN0aXZlLzIwMTkvMDcvMDMvd29ybGQvYXNpYS9ob25nLWtvbmctcHJvdGVzdC1jcm93ZC1haS5odG1s0gEA?oc=5\n", "title": "How A.I. Helped Improve Crowd Counting in Hong Kong Protests - The New York Times", "stance": "pos", "content": "", "translation": "", "uid": "02_00_121", "input": "", "char_offset": "0-3567"}
{"language": "Chinese", "url": "https://wenhui.whb.cn/third/baidu/201907/19/278019.html", "title": "部分冲击香港立法会的暴徒已躲至台湾！前特首质问：他们为啥急着出逃？", "stance": "neg", "content": "", "translation": "According to Hong Kong News Network, former Hong Kong Chief Executive Leung Chun-ying stated on social media on the 19th that the recent series of illegal demonstrations in Hong Kong showed the characteristics of \"participants with mixed moral character and the activities constantly deteriorating\". \"The masses thought they were It is spontaneous, and others participate voluntarily. In fact, there are planners, commanders and coordinators behind the scenes, each with his own purpose, taking advantage of each other, and each 'extracting' (Cantonese, profit-making).\"\n\nLiang Zhenying also said that as the violent tendencies of illegal demonstrations become more and more obvious, \"Now except for a few silly ones, the rest (opposition) have moved to the rear. Why? Because they cannot afford the consequences.\"\nLooking at the Taiwan authorities, why do they treat these thugs from Hong Kong so favorably? A comment previously posted on China Taiwan Online clearly pointed out the reason——\n\nThe DPP supports Hong Kong demonstrators from top to bottom. It is nothing more than adding fuel to the fire and intensifying conflicts, encouraging Hong Kong demonstrators to be more violent, and Hong Kong society to be more chaotic, the better. This proves that \"Hong Kong's 'one country, two systems' is \"Failed\" and \"Taiwan's rejection of 'one country, two systems' is justified.\"\n\nTherefore, everyone must see clearly the true face of Tsai Ing-wen and the Taiwan authorities. No matter how fanciful they are, they cannot conceal the essence of authoritarianism hidden in their democratic outer shell.", "uid": "02_06_89", "input": "", "char_offset": "0-424"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlLzhhMjQxNjEyMTJjMTQwZWJhZjllYWMwMjA0OWE5Nzhh0gEA?oc=5\n", "title": "In Hong Kong, colonial flag still a symbol of prized values | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_209", "input": "", "char_offset": "0-2902"}
{"language": "English", "url": "https://www.chinadaily.com.cn/kindle/2019-08/25/content_37505382.htm", "title": "Protests disrupt city's stability and operations", "stance": "neg", "content": "", "translation": "", "uid": "02_06_136", "input": "", "char_offset": "0-1313"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDIzLzA3LzAxL2hvbmcta29uZy1jaGluYS1jcmFja2Rvd24tZGVtb2NyYWN5L9IBAA?oc=5\n", "title": "Opinion | Hong Kong’s downfall is a warning to the world  - The Washington Post", "stance": "pos", "content": "", "translation": "", "uid": "02_00_38", "input": "", "char_offset": "0-1961"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3Lm55dGltZXMuY29tL2ludGVyYWN0aXZlLzIwMTkvMDcvMDMvd29ybGQvYXNpYS9ob25nLWtvbmctcHJvdGVzdC1jcm93ZC1haS5odG1s0gEA?oc=5\n", "title": "How A.I. Helped Improve Crowd Counting in Hong Kong Protests - The New York Times", "stance": "pos", "content": "", "translation": "", "uid": "02_00_120", "input": "", "char_offset": "0-2469"}
{"language": "Chinese", "url": "https://opinion.huanqiu.com/article/9CaKrnJF8ZV", "title": "社评：搞“七一大游行”不符合香港利益", "stance": "neg", "content": "", "translation": "The so-called \"political reform referendum\" initiated by Hong Kong's \"Occupy Central\" activists was announced yesterday, with organizers claiming that \"more than 780,000 people\" participated in the vote. This figure has been widely questioned, with many saying they were able to vote electronically repeatedly through various means. Tomorrow is July 1, and the opposition calls on Hong Kong citizens who have voted to participate in the \"July 1\" demonstrations to continue to put pressure on the central government.\n\nSuch demonstrations are legal in Hong Kong, but from holding a \"referendum\" to organizing the \"July 1 Parade\" to planning the large-scale \"Occupy Central\" action, all of this has continued to portray and accumulate the \"political power\" of the radical opposition. The image of \"antagonist\" pushes the diversity of Hong Kong society in the direction of division, which is not in the interest of the vast majority of Hong Kong people.\n\nThe Hong Kong opposition is supposed to be an opposition within the Special Administrative Region. The entire political operation mechanism of Hong Kong is determined by the Basic Law and supervised by the central government. However, the radical forces in the Hong Kong opposition are now targeting the central government and the Basic Law. From the perspective of the national constitution, this is a serious misalignment.\n\nThe white paper issued by the central government not long ago clearly requires that the candidate for chief executive must be selected from people who \"patriotize and love Hong Kong.\" The radical opposition rejected this condition, which implicitly requires that people who are hostile to the central government can also run for election. If the central government makes concessions to them, Hong Kong's future will face huge uncertainty.\n\nThe radical opposition in Hong Kong probably knows that their request is impossible to achieve, and they seem to be treating the current series of actions as a mobilization process for the \"opposition\" of Hong Kong society. Officials and scholars in Hong Kong and the Mainland have repeatedly called for the need to avoid confrontation between Mainland society and Hong Kong society. In fact, there is no organizational force in the Mainland to promote confrontation with Hong Kong society. When Mainland public opinion rebounds against the radical opposition in Hong Kong, it also All have this consciousness.\n\nHowever, Hong Kong's radical opposition seems to be trying every possible means to build a \"chariot\" to trick as many Hong Kong citizens into boarding this vehicle. Its target is the central government and the general public across the country. We want to say to the citizens of Hong Kong, don’t get on this “chariot”, don’t be kidnapped by the radical opposition, and use Hong Kong’s prosperity and your well-being as bargaining chips for them.", "uid": "02_06_24", "input": "", "char_offset": "0-678"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDE5LzcvMy9ob25nLWtvbmctcHJvdGVzdHMtYWxsLXRoZS1sYXRlc3QtdXBkYXRlc9IBVWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAxOS83LzMvaG9uZy1rb25nLXByb3Rlc3RzLWFsbC10aGUtbGF0ZXN0LXVwZGF0ZXM?oc=5\n", "title": "Hong Kong protests: All the latest updates | Hong Kong Protests News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_134", "input": "", "char_offset": "0-2232"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LnZveC5jb20vd29ybGQvMjAxOS84LzI4LzIwODM1NDYyL2hvbmcta29uZy1wcm90ZXN0cy0yMDE5LW5ld3MtdXBkYXRlc9IBAA?oc=5\n", "title": "Hong Kong protests 2019: news and updates - Vox", "stance": "pos", "content": "", "translation": "", "uid": "02_00_97", "input": "", "char_offset": "0-2249"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1666105065670489802&wfr=spider&for=pc", "title": "香港修例风波回望：当青年被绑上暴力战车", "stance": "neg", "content": "", "translation": "Looking back at the turmoil over the extradition bill that seriously impacted Hong Kong society in 2019, one set of figures is the most deplorable: as of early March this year, students accounted for 40% of the more than 7,700 people arrested for participating in the riots, and more than half of them were college students; 18 People under the age of 10 were arrested on suspicion of criminal damage, accounting for 5% of the total from June to July last year. By January this year, the number had exceeded 50%.\nThe blooming season is suddenly involved in a bloody storm; the passion of youth is lost in the street madness...\nHow were these young people kidnapped and driven to the cliff in an out-of-control chariot? After the illusory passion, who will be responsible for their wasted years? What happened to them at the stage in their lives when they needed the most correct guidance?", "uid": "02_06_46", "input": "", "char_offset": "0-214"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/21/c_138324268.htm", "title": "Xinhua Headlines: How external forces have inflamed tensions in Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_222", "input": "", "char_offset": "0-960"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5uZXd5b3JrZXIuY29tL25ld3MvZGFpbHktY29tbWVudC90aGUtZGlzaWxsdXNpb24tYW5kLWZydXN0cmF0aW9uLW9mLWEtbmV3LWdlbmVyYXRpb24taXMtZnVlbGxpbmctaG9uZy1rb25ncy1wcm90ZXN0c9IBAA?oc=5\n", "title": "The Disillusion and Frustration of a New Generation is Fuelling Hong Kong’s Protests | The New Yorker", "stance": "pos", "content": "", "translation": "", "uid": "02_00_111", "input": "", "char_offset": "0-3032"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lmhydy5vcmcvbmV3cy8yMDIzLzA3LzA0L2hvbmcta29uZy13YXJyYW50cy1haW0tYWN0aXZpc3RzLWFicm9hZNIBAA?oc=5\n", "title": "Hong Kong: Warrants Aim at Activists Abroad | Human Rights Watch", "stance": "pos", "content": "", "translation": "", "uid": "02_00_36", "input": "", "char_offset": "0-2174"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/21/c_138326851.htm", "title": "Woman's courage inspires Hong Kong society against violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_173", "input": "", "char_offset": "0-1467"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2FwbmV3cy5jb20vYXJ0aWNsZS94aS1qaW5waW5nLWhvbmcta29uZy1jYXJyaWUtbGFtLWdvdmVybm1lbnQtYW5kLXBvbGl0aWNzLWRvbmFsZC10c2FuZy0yZWVjMzA1MmY2NTdlNjRmMjg2YmIwY2Q4NjIzMWFiZtIBAA?oc=5\n", "title": "Xi defends vision of Hong Kong on 25th anniversary of return | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_173", "input": "", "char_offset": "0-3434"}
{"language": "English", "url": "https://www.chinadaily.com.cn/a/201908/22/WS5d5dc96aa310cf3e35567288.html", "title": "Peer influence among factors blamed in HK", "stance": "neg", "content": "", "translation": "", "uid": "02_06_211", "input": "", "char_offset": "0-1223"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-10/03/c_138444842.htm", "title": "Hong Kong society choruses against violence escalation on National Day", "stance": "neg", "content": "", "translation": "", "uid": "02_06_182", "input": "", "char_offset": "0-1147"}
{"language": "Chinese", "url": "https://www.gov.cn/xinwen/2019-07/02/content_5405427.htm", "title": "香港中联办负责人对香港发生暴力冲击立法会事件表示强烈谴责", "stance": "neg", "content": "", "translation": "Xinhua News Agency, Hong Kong, July 2 (Xinhua) The head of the Liaison Office of the Central People's Government in the Hong Kong Special Administrative Region issued a statement on July 2, stating that he was shocked, indignant and strongly condemned the violent incident that occurred in the Legislative Council Building in Hong Kong on July 1, and firmly condemned it. Support the SAR government in pursuing relevant serious violations to the end.\n\nThe official pointed out that some extremists stormed the Legislative Council building in an extremely violent manner. The series of lawless acts of vandalism inside the building are shocking, heartbreaking and outrageous. Their atrocities are a great provocation and trample on Hong Kong's rule of law, seriously damaging Hong Kong's social stability, and must not be tolerated.\n\nThe person in charge said that the Liaison Office of the Central People's Government in Hong Kong firmly supports the SAR government in pursuing relevant violent acts in accordance with the law, resolutely safeguards the rule of law and social order in Hong Kong, and works with people from all walks of life in Hong Kong to safeguard Hong Kong's prosperity and stability.", "uid": "02_06_54", "input": "", "char_offset": "0-268"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lm5wci5vcmcvMjAxOS8wNy8wMS83Mzc1NTY1MDEvaG9uZy1rb25nLXByb3Rlc3RlcnMtdGFrZS1kb3duLXdhbGwtYXQtbGVnaXNsYXRpdmUtY291bmNpbC1hcy1vZmZpY2lhbHMtbWFyay1oYW7SAQA?oc=5\n", "title": "Hong Kong Protesters Storm Legislative Council On Anniversary Of Handover To China : NPR", "stance": "pos", "content": "", "translation": "", "uid": "02_00_195", "input": "", "char_offset": "0-3219"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1789666708797220456&wfr=spider&for=pc", "title": "港媒：涉冲击香港立法会，“乱港”艺人王宗尧被裁定暴动罪成立", "stance": "neg", "content": "", "translation": "According to the report, the six defendants are Huang Jiahao (24 years old, reporter), He Junyan (23 years old, transportation worker), Ma Qicong (34 years old, online media reporter), Wang Zongyao (44 years old, artist), and Wu Zhiyong (27 years old) and Lin Jinjun (27 years old), they are accused of participating in riots with others in and around the Legislative Council Complex on or about July 1, 2019; Lin Jinjun was also charged with one count of criminal damage; Wang Zongyiu and Wu Zhiyong were earlier charged He previously pleaded guilty to one count each of \"entering or remaining within the confines of the conference hall\".\nThe report mentioned that the judge today ruled that Wang Zongyao, He Junyan, Wu Zhiyong and Lin Jinjun were guilty of rioting; Huang Jiahao and Ma Qicong were acquitted of rioting, but they and He Junyan were found guilty of entering the conference hall; Lin Jinjun was also found guilty of criminal damage established.", "uid": "02_06_59", "input": "", "char_offset": "0-243"}
{"language": "English", "url": "https://www.chinadaily.com.cn/a/201908/14/WS5d52f04fa310cf3e355658dc.html", "title": "Protesters paralyze airport as HKSAR chief executive appeals for end to violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_156", "input": "", "char_offset": "0-1665"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vYWJjbmV3cy5nby5jb20vSW50ZXJuYXRpb25hbC9ob25nLWtvbmctcHJvdGVzdGVycy1zdGFnZS1wZWFjZWZ1bC1yYWxseS13ZWVrLXZpb2xlbnQvc3Rvcnk_aWQ9NjQxNzc3ODDSAXFodHRwczovL2FiY25ld3MuZ28uY29tL2FtcC9JbnRlcm5hdGlvbmFsL2hvbmcta29uZy1wcm90ZXN0ZXJzLXN0YWdlLXBlYWNlZnVsLXJhbGx5LXdlZWstdmlvbGVudC9zdG9yeT9pZD02NDE3Nzc4MA?oc=5\n", "title": "Hong Kong protesters stage peaceful rally, 1 week after violent break-ins - ABC News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_206", "input": "", "char_offset": "0-2532"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lmhydy5vcmcvbmV3cy8yMDIwLzA3LzI5L2NoaW5hLW5ldy1ob25nLWtvbmctbGF3LXJvYWRtYXAtcmVwcmVzc2lvbtIBAA?oc=5\n", "title": "China: New Hong Kong Law a Roadmap for Repression | Human Rights Watch", "stance": "pos", "content": "", "translation": "", "uid": "02_00_62", "input": "", "char_offset": "0-1416"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZm9yZWlnbnBvbGljeS5jb20vMjAxOS8xMi8yMC9ob25nLWtvbmctcHJvdGVzdHMtMjAxOS_SAQA?oc=5\n", "title": "Hong Kong’s Protest Year", "stance": "pos", "content": "", "translation": "", "uid": "02_00_178", "input": "", "char_offset": "0-1048"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNubi5jb20vYXNpYS9saXZlLW5ld3MvaG9uZy1rb25nLWp1bHktMS1wcm90ZXN0cy1pbnRsLWhuay9oXzliMTQxZGE4MTYxNjg1MzQ3ZDkyZDI5MWM4M2U3ODli0gFUaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vYXNpYS9saXZlLW5ld3MvaG9uZy1rb25nLWp1bHktMS1wcm90ZXN0cy1pbnRsLWhuay9pbmRleC5odG1s?oc=5\n", "title": "July 1 protest march sets off from Victoria Park", "stance": "pos", "content": "", "translation": "", "uid": "02_00_104", "input": "", "char_offset": "0-1003"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm55dGltZXMuY29tL2ludGVyYWN0aXZlLzIwMTkvd29ybGQvYXNpYS9ob25nLWtvbmctcHJvdGVzdHMtYXJjLmh0bWzSAQA?oc=5\n", "title": "Six Months of Hong Kong Protests. How Did We Get Here? - The New York Times", "stance": "pos", "content": "", "translation": "", "uid": "02_00_106", "input": "", "char_offset": "0-2281"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/201911/28/WS5ddf3bc8a310cf3e3557aa42.html", "title": "Perspective: Distinguishing between protests and riots in Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_139", "input": "", "char_offset": "0-1615"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy93b3JsZC1hc2lhLWNoaW5hLTUyNzY1ODM40gE2aHR0cHM6Ly93d3cuYmJjLmNvbS9uZXdzL3dvcmxkLWFzaWEtY2hpbmEtNTI3NjU4MzguYW1w?oc=5\n", "title": "Hong Kong national security law: What is it and is it worrying?", "stance": "neutral", "content": "", "translation": "", "uid": "02_00_1", "input": "", "char_offset": "0-2689"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDE5LzcvMy9ob25nLWtvbmctcHJvdGVzdHMtYWxsLXRoZS1sYXRlc3QtdXBkYXRlc9IBVWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAxOS83LzMvaG9uZy1rb25nLXByb3Rlc3RzLWFsbC10aGUtbGF0ZXN0LXVwZGF0ZXM?oc=5\n", "title": "Hong Kong protests: All the latest updates | Hong Kong Protests News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_131", "input": "", "char_offset": "0-2015"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1670560806171488613&wfr=spider&for=pc", "title": "七一还想闹事，港警发反对通知书", "stance": "neg", "content": "", "translation": "According to Hong Kong's \"Wen Wei Po\", Eastern District Councilor Xu Zijian and others who participated in the \"primary election\" of the speculators wanted to increase their political capital. On the 25th, they threatened to hold demonstrations on the 28th of this month and the 1st of next month.\nHowever, the embarrassing thing is that the only onlookers that day were the media, with almost no pedestrians stopping to support, and the scene was very deserted. Even Xu Zijian himself admitted that currently there are only more than 30 district councilors who are pro-speculators supporting the demonstration, accounting for less than 10% of the total district council members who are pro-speculators.\nThe Hong Kong police have currently issued a \"notice of objection\" to the above-mentioned parade, and responded to Xu Zijian on the 26th, saying that it is prohibited to hold rallies and parades on Hong Kong Island this Sunday and July 1.\nThe police said that taking into account factors such as the epidemic and the \"gathering restriction order\", the police believe that public gatherings and parades are high-risk activities where large numbers of people gather.\nThe letter states that the COVID-19 response level in Hong Kong is the highest level of \"emergency\". The relevant public gatherings and processions are not exempted from the \"Restriction on Gathering Order\" group gatherings. Holding or participating in rallies and processions is illegal and will disrupt public order. . The police have reason to believe that holding relevant activities will increase the risk of virus infection among participants and other citizens, and will pose a major threat to the lives and health of all citizens.\nThe police also stated that given that the social atmosphere has remained unstable recently, after careful assessment, there is reason to believe that some participants in this rally and procession may deviate from the original route and violently damage nearby high-risk buildings, including MTR stations, Police Headquarters and Government Headquarters. The police said that any person who knowingly participates in an unauthorized assembly without reasonable excuse commits an offence.", "uid": "02_06_12", "input": "", "char_offset": "0-492"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1638022607520854108&wfr=spider&for=pc", "title": "维修费达6000万！香港警方将拘捕冲击立法会暴徒", "stance": "neg", "content": "", "translation": "According to reports, demonstrators caused extremely serious damage to the Legislative Council building. The underground security control room was completely destroyed, all security systems were inoperable, and the power supply and fire protection systems were disrupted. It is estimated that the maintenance cost of the building is expected to be HK$60 million (approximately RMB 52.98 million), and the maintenance time will be more than three months, and it will not be put into use until October this year.\nIn addition, Hong Kong Chief Executive Carrie Lam Cheng Yuet-ngor also stated that demonstrators have been confronting the police since the morning of the 1st, blocking roads, using unknown liquids and toxic chemical powders to attack the police, and storming the Legislative Council building in an extremely violent manner.\nIn response, Carrie Lam Cheng Yuet-ngor stated in the early morning of the 2nd that these violent acts have seriously affected the core values ​​of Hong Kong's rule of law and must be strongly condemned. The Hong Kong government will \"pursue to the end\" any illegal behavior.\nLi Ka-chiu, Secretary for Security of the Hong Kong SAR Government, and Lo Wai-chung, Commissioner of Police of the Hong Kong SAR Government, stated that the actions of the violent attackers were seriously illegal and posed a great threat to the public. The police condemn this series of acts of disregard of law and order in the strongest possible terms, and will conduct a comprehensive investigation and follow up seriously.\nChairman of the Hong Kong Legislative Council Leung Kwan-yin said that no matter what political opinions, violence should never be used to resolve the issue.", "uid": "02_06_76", "input": "", "char_offset": "0-392"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2hvbmdrb25nZnAuY29tLzIwMjMvMDcvMDEvaG9wZS1yZWZsZWN0aW9uLWFuZC1kaXNhcHBvaW50bWVudC1hcy1wZW9wbGUtbWFyay0yNnRoLWFubml2ZXJzYXJ5LW9mLWhvbmcta29uZ3MtcmV0dXJuLXRvLWNoaW5lc2UtcnVsZS_SAQA?oc=5\n", "title": "Hope, reflection and disappointment as people mark 26th anniversary of Hong Kong's return to Chinese rule | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_113", "input": "", "char_offset": "0-1648"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/14/c_138309095.htm", "title": "Feature: Hong Kong residents visit injured reporter, call for end of violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_153", "input": "", "char_offset": "0-1988"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_23", "input": "", "char_offset": "0-367"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5uZXd5b3JrZXIuY29tL25ld3MvZGFpbHktY29tbWVudC90aGUtZGlzaWxsdXNpb24tYW5kLWZydXN0cmF0aW9uLW9mLWEtbmV3LWdlbmVyYXRpb24taXMtZnVlbGxpbmctaG9uZy1rb25ncy1wcm90ZXN0c9IBAA?oc=5\n", "title": "The Disillusion and Frustration of a New Generation is Fuelling Hong Kong’s Protests | The New Yorker", "stance": "pos", "content": "", "translation": "", "uid": "02_00_112", "input": "", "char_offset": "0-3984"}
{"language": "English", "url": "http://www.chinadaily.com.cn/kindle/2019-11/23/content_37524955.htm", "title": "HK protests expose Western media bias", "stance": "neg", "content": "", "translation": "", "uid": "02_06_121", "input": "", "char_offset": "0-978"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2FwLXRvcC1uZXdzLWxhd3MtaW50ZXJuYXRpb25hbC1uZXdzLWFycmVzdHMtaG9uZy1rb25nLTQ4MWU0MDUxNDYyOTU0ZjZkZGMzYmIzMDc5ZjE0YWQ00gEA?oc=5\n", "title": "Hong Kong police make first arrests under new security law | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_143", "input": "", "char_offset": "0-1752"}
{"language": "English", "url": "https://www.chinadaily.com.cn/global/2019-08/01/content_37497652.htm", "title": "Preserving HK's bridging role in everyone's interest", "stance": "neg", "content": "", "translation": "", "uid": "02_06_215", "input": "", "char_offset": "0-1756"}
{"language": "English", "url": "http://www.chinadaily.com.cn/global/2019-10/30/content_37519413.htm", "title": "HK protest effects inescapable", "stance": "neg", "content": "", "translation": "", "uid": "02_06_147", "input": "", "char_offset": "0-2417"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wNy8wMi9hc2lhL2hvbmcta29uZy1wcm90ZXN0cy1hbmdlci1pbnRsL2luZGV4Lmh0bWzSAUVodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDE5LzA3LzAyL2FzaWEvaG9uZy1rb25nLXByb3Rlc3RzLWFuZ2VyLWludGw?oc=5\n", "title": "Hong Kong’s democracy movement was about hope. These protests are driven by desperation | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_123", "input": "", "char_offset": "0-3903"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wOS8yNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0LXZpb2xlbmNlLWludGwtaG5rL2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDE5LzA5LzI2L2FzaWEvaG9uZy1rb25nLXByb3Rlc3QtdmlvbGVuY2UtaW50bC1obms?oc=5\n", "title": "How a summer of protest pushed young Hong Kongers to the edge | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_167", "input": "", "char_offset": "0-2523"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2hvbmdrb25nZnAuY29tLzIwMjMvMDcvMDEvaG9wZS1yZWZsZWN0aW9uLWFuZC1kaXNhcHBvaW50bWVudC1hcy1wZW9wbGUtbWFyay0yNnRoLWFubml2ZXJzYXJ5LW9mLWhvbmcta29uZ3MtcmV0dXJuLXRvLWNoaW5lc2UtcnVsZS_SAQA?oc=5\n", "title": "Hope, reflection and disappointment as people mark 26th anniversary of Hong Kong's return to Chinese rule | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_117", "input": "", "char_offset": "0-2280"}
{"language": "English", "url": "https://www.channelnewsasia.com/asia/hong-kong-protest-storm-legislature-jail-7-12-years-2019-4199796?utm_source=ground.news&utm_medium=referral", "title": "Jail terms of up to 7 years for 12 who stormed Hong Kong legislature in 2019", "stance": "neutral", "content": "", "translation": "", "uid": "02_09_4", "input": "", "char_offset": "0-3453"}
{"language": "Chinese", "url": "https://www.chinanews.com.cn/ga/2014/11-19/6792430.shtml", "title": "香港特区政府强烈谴责冲击立法会暴行 六人被捕", "stance": "neg", "content": "", "translation": "China News Service, November 19. According to the website of the Hong Kong Special Administrative Region government, Hong Kong \"Occupy Action\" demonstrators attacked the Hong Kong Legislative Council building in the early morning of the 19th, causing damage to many parts of the building. Police have arrested six people and strongly condemned acts that disrupted public order. \n\nHong Kong government sources said that the incident occurred at 1 a.m., and demonstrators used iron horses (obstacles) and bricks to violently attack the building many times. Many glass doors in the building were shattered and brick walls were pried off. The police arrived at the scene to assist at the request of the Legislative Council.\n\nThe demonstrators also attempted to prevent the police from enforcing the law. The demonstrators ignored the advice and warnings, so the police used minimum force to stop the attack, including using pepper spray to prevent the demonstrators from continuing to attack and defend themselves against attacks. Three police officers were injured in the incident. \n\nThe police reiterated that Hong Kong society agrees that demands should be expressed in a rational and peaceful manner and that behaviors that undermine public order and public safety will never be tolerated.\n\nThe Special Administrative Region Government strongly condemned the actions of thugs who stormed the Legislative Council building on the 19th, emphasizing that citizens must abide by the law when expressing their opinions or demands and will never tolerate violence. \n\nAs a result, the Public Works Subcommittee meeting and the Legislative Council meeting originally scheduled to be held on the morning of the 19th were forced to be rescheduled, and the operations of the Parliament were further delayed.\n\nYuen Kwok-keung, the Secretary for Justice of the SAR Government, emphasized that the police and the Department of Justice will handle matters in accordance with laws and established procedures. He reiterated that illegal or unlawful acts will not be allowed to undermine the rule of law. If there is sufficient evidence, law enforcement will be strictly enforced. He does not want to release the idea that \"people who commit illegal acts can get away with it.\" ” information, which is also the basic requirement and practice of the rule of law.\n\nYuen Guoqiang said that he believed that the vast majority of Hong Kong people did not want to see violent incidents or express their demands in a violent way, and called on the occupying people or other demonstrators not to express their demands in a violent way.", "uid": "02_06_100", "input": "", "char_offset": "0-555"}
{"language": "English", "url": "https://www.chinadaily.com.cn/hkedition/2019-10/15/content_37515511.htm", "title": "US has 'hidden agenda' with Act", "stance": "neg", "content": "", "translation": "", "uid": "02_06_188", "input": "", "char_offset": "0-1514"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNubi5jb20vMjAyMC8wNy8wMS9jaGluYS9ob25nLWtvbmctbmF0aW9uYWwtc2VjdXJpdHktbGF3LWp1bHktMS1pbnRsLWhuay9pbmRleC5odG1s0gFYaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAyMC8wNy8wMS9jaGluYS9ob25nLWtvbmctbmF0aW9uYWwtc2VjdXJpdHktbGF3LWp1bHktMS1pbnRsLWhuaw?oc=5\n", "title": "Hong Kong protests: First arrest made under new security law | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_42", "input": "", "char_offset": "0-2607"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnBicy5vcmcvbmV3c2hvdXIvd29ybGQvY2hpbmFzLXhpLWppbnBpbmctY291bnRlcnMtY3JpdGljaXNtcy1vbi0yNXRoLWFubml2ZXJzYXJ5LW9mLWhvbmcta29uZ3MtcmV0dXJu0gF1aHR0cHM6Ly93d3cucGJzLm9yZy9uZXdzaG91ci9hbXAvd29ybGQvY2hpbmFzLXhpLWppbnBpbmctY291bnRlcnMtY3JpdGljaXNtcy1vbi0yNXRoLWFubml2ZXJzYXJ5LW9mLWhvbmcta29uZ3MtcmV0dXJu?oc=5\n", "title": "China’s Xi Jinping counters criticisms on 25th anniversary of Hong Kong’s return | PBS NewsHour", "stance": "pos", "content": "", "translation": "", "uid": "02_00_193", "input": "", "char_offset": "0-2235"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL2hvbmdrb25nZnAuY29tLzIwMjMvMDcvMDEvaG9uZy1rb25ncy1qb2huLWxlZS13YXJucy1hZ2FpbnN0LXNvZnQtcmVzaXN0YW5jZS1hcy1wb21wLXBhdHJpb3Rpc20tcmVwbGFjZS1wcm90ZXN0cy1vbi1oYW5kb3Zlci1hbm5pdmVyc2FyeS_SAQA?oc=5\n", "title": "Hong Kong's John Lee warns against 'soft resistance' as pomp, patriotism replace protests on Handover anniversary | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_59", "input": "", "char_offset": "0-2483"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/21/c_138324268.htm", "title": "Xinhua Headlines: How external forces have inflamed tensions in Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_220", "input": "", "char_offset": "0-1548"}
{"language": "Chinese", "url": "https://world.huanqiu.com/article/44L8ry2e53p", "title": "乱港分子制定“三条战线”妄想七一决战？乱港四人帮各怀啥心思？", "stance": "neg", "content": "", "translation": "\"International Front\" - America's \"New Sanctions\"\nThe so-called \"sanctions\" under the \"strong reaction\" of the United States in the early stage were extremely unreliable, and the pretense of saying that it would take in \"refugees\" while vigorously cleaning up and driving away immigrants from abroad made even die-hard traitors like Luo Guancong sigh. Calling the United States \"daddy\" actually puts interests first and is simply unreliable.\nThis time, as Joshua Wong said, \"it's not the stairs,\" the U.S. is about to take \"real measures\" and threatens to inflict a \"heavy blow\" to the SAR government: it will include the main officials of the SAR government in the \"global blacklist\" and collude with \" More European countries outside the Five Eyes Alliance are participating in sanctions, restricting officials on the list from entering Europe, and studying \"abolition\" of some agreements with Hong Kong.", "uid": "02_06_23", "input": "", "char_offset": "0-236"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_31", "input": "", "char_offset": "0-244"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2FwLXRvcC1uZXdzLWxhd3MtaW50ZXJuYXRpb25hbC1uZXdzLWFycmVzdHMtaG9uZy1rb25nLTQ4MWU0MDUxNDYyOTU0ZjZkZGMzYmIzMDc5ZjE0YWQ00gEA?oc=5\n", "title": "Hong Kong police make first arrests under new security law | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_142", "input": "", "char_offset": "0-1773"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LnZveC5jb20vd29ybGQvMjAxOS84LzI4LzIwODM1NDYyL2hvbmcta29uZy1wcm90ZXN0cy0yMDE5LW5ld3MtdXBkYXRlc9IBAA?oc=5\n", "title": "Hong Kong protests 2019: news and updates - Vox", "stance": "pos", "content": "", "translation": "", "uid": "02_00_98", "input": "", "char_offset": "0-2755"}
{"language": "Chinese", "url": "", "title": "环球时报：香港现七一游行，国家不可能让步", "stance": "neg", "content": "", "translation": "For protests such as the \"July 1 Parade\", adapt to them and don't take them too seriously\nHong Kong held another \"July 1st Parade\" yesterday. The number of people was said to be more than in previous years, but there is a big gap between the statistics of various parties. The opposition is happy and considers this year's march and the previous \"referendum\" to be their \"victory\" by adding pressure on the central government. Two Hong Kong student organizations staged an \"Occupy Central\" event in advance last night, claiming that they would wait until Hong Kong Chief Executive Leung Chun-ying went to work this morning and demand dialogue with him. Their plan challenged Hong Kong's laws and constituted a test of the Hong Kong government's handling capabilities.\n\nThe July 1st March has become a new \"protest political tradition\" in Hong Kong. Its core organizer is the Hong Kong opposition, but the actual participants and their demands are becoming more and more diverse. \"Democracy activists\" and gay supporters who have fled from the mainland will use the July 1st parade to show their presence. There are also many people who just express their \"dissatisfaction\" or just want to join in the fun, treating the parade as a party and carnival to relieve stress and jointly create a grand impression.\n\nThe opposition is very concerned about the number of people attending the July 1st demonstrations, and the numbers they publish every time are higher than the actual statistics of the police. When watching the July 1st Parade in Hong Kong from the mainland, you must have a relieved attitude. The number of people marching to a certain extent reflects the sentiment of Hong Kong society, but the relationship between the two is not equal. Public opinion in Hong Kong is complex, and rational fundamentals have always existed. The opposition wants to influence policy formulation through street actions, which should never be encouraged.\n\nIn the coming period, the Hong Kong opposition will intensify various protests and even \"disobedience\" activities to strive for the central government to make concessions that break through the Basic Law around Hong Kong's political reform. It is difficult for ordinary citizens in Hong Kong to fully understand the Basic Law. The opposition's use of \"Hong Kong democracy is under threat\" to scare everyone can cater to the concerns of many ordinary people, thereby drawing them into protests and building momentum against the central government.", "uid": "02_06_17", "input": "", "char_offset": "0-596"}
{"language": "English", "url": "https://www.chinadaily.com.cn/global/2019-08/22/content_37504425.htm", "title": "Peer influence among factors blamed in HK", "stance": "neg", "content": "", "translation": "", "uid": "02_06_247", "input": "", "char_offset": "0-2136"}
{"language": "English", "url": "https://www.chinadaily.com.cn/a/201908/18/WS5d58f7efa310cf3e355665d7_2.html", "title": "How violence has disrupted Hong Kong over last 2 months", "stance": "neg", "content": "", "translation": "", "uid": "02_06_114", "input": "", "char_offset": "0-1757"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lm5wci5vcmcvMjAxOS8wNy8wMS83Mzc1NTY1MDEvaG9uZy1rb25nLXByb3Rlc3RlcnMtdGFrZS1kb3duLXdhbGwtYXQtbGVnaXNsYXRpdmUtY291bmNpbC1hcy1vZmZpY2lhbHMtbWFyay1oYW7SAQA?oc=5\n", "title": "Hong Kong Protesters Storm Legislative Council On Anniversary Of Handover To China : NPR", "stance": "pos", "content": "", "translation": "", "uid": "02_00_196", "input": "", "char_offset": "0-2983"}
{"language": "English", "url": "https://www.cnn.com/asia/live-news/hong-kong-july-1-protests-intl-hnk/index.html", "title": "Here's what happened at the Hong Kong protests", "stance": "neutral", "content": "", "translation": "", "uid": "02_09_6", "input": "", "char_offset": "0-1142"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1638039324875300681&wfr=spider&for=pc", "title": "香港各界谴责暴力冲击立法会事件", "stance": "neg", "content": "", "translation": "All sectors of Hong Kong society strongly condemned the violent attack on the Legislative Council building of the SAR by some extreme radicals on the 1st and demanded that the offenders be held criminally accountable in accordance with the law.\nUnofficial members of the Executive Council of the Hong Kong Special Administrative Region issued a statement saying that all unofficial members strongly condemned the demonstrators for seriously undermining Hong Kong's fine tradition of the rule of law and supported the police in bringing lawbreakers to justice.\nYoung people from all walks of life in Hong Kong issued a statement stating that the extremely violent and crazy behavior of the demonstrators has exceeded the basic law, morality and the bottom line of humanity, and seriously threatens the rule of law and the fundamental interests of Hong Kong's more than 7.4 million citizens.\nMany people in Hong Kong expressed their sadness at the violent attack on the Legislative Council and the destruction of Hong Kong's rule of law, and demanded that the offenders be brought to justice.", "uid": "02_06_73", "input": "", "char_offset": "0-224"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1714688125201271570&wfr=spider&for=pc", "title": "香港之乱丨侮辱国旗、冲击立法会……暴力示威让东方之珠蒙尘", "stance": "neg", "content": "", "translation": "In the early morning of June 13, 2019, Yang Guanhua, the owner of a tea restaurant and a Hong Kong citizen, came to Central.\n\nThe area around Wan Chai, Admiralty and Central is the \"heart\" of Hong Kong. The SAR Government Headquarters, the Legislative Council Building and the Police Headquarters are all nearby.\nHours before Yang Guanhua arrived, the place was still in chaos.\n\nYang Guanhua: Some demonstrations and demonstrations in Hong Kong have turned into violent incidents. Then I want to go to the scene to experience for myself what is happening in Hong Kong.\n\nYang Guanhua picked up his mobile phone and took a picture of the \"post-catastrophe scene\" in the heart of Hong Kong.\nIn Yang Guanhua's lens, you can see many masks, eye masks, and umbrellas, which are used by demonstrators as supplies. Who provides these supplies? Who is messing up Hong Kong? This became the confusion lingering in Yang Guanhua's mind.\nYang Guanhua: Many major media, including TV, newspapers, etc., as well as online media, I saw them saying that these student demonstrators were gathering peacefully and were unarmed. But when I went to the site, I saw a large amount of equipment, which was organized and planned. In fact, there was a large consortium behind it to fully support these rations.\n\nThe situation has long gone beyond peaceful demonstrations, and acts of vandalism continue to occur.", "uid": "02_06_35", "input": "", "char_offset": "0-366"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/21/c_138326851.htm", "title": "Woman's courage inspires Hong Kong society against violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_172", "input": "", "char_offset": "0-1239"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy52b2FuZXdzLmNvbS9hL2Vhc3QtYXNpYS1wYWNpZmljX2hvbmcta29uZy1wcm90ZXN0ZXJzLW91dHJhZ2VkLWJlaWppbmdzLWNvbXBhcmlzb24tdXMtY2FwaXRvbC1zaWVnZS1zdG9ybWluZy82MjAwNTg3Lmh0bWzSAYYBaHR0cHM6Ly93d3cudm9hbmV3cy5jb20vYW1wL2Vhc3QtYXNpYS1wYWNpZmljX2hvbmcta29uZy1wcm90ZXN0ZXJzLW91dHJhZ2VkLWJlaWppbmdzLWNvbXBhcmlzb24tdXMtY2FwaXRvbC1zaWVnZS1zdG9ybWluZy82MjAwNTg3Lmh0bWw?oc=5\n", "title": "Hong Kong Protesters Outraged by Beijing’s Comparison of US Capitol Siege to Storming of Legislature", "stance": "pos", "content": "", "translation": "", "uid": "02_00_101", "input": "", "char_offset": "0-3137"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1675603286203906050&wfr=spider&for=pc", "title": "港媒：参与冲击立法会，香港12名暴动罪嫌犯受审", "stance": "neg", "content": "", "translation": "According to Hong Kong's \"Wen Wei Po\", 12 people, including the spokesperson of the civil assembly team Liu Yuankuang, the former president of the Hong Kong University Students' Union Sun Xiaolan and the artist Wang Zongyao, were involved in demonstrating outside the Legislative Council and attacking the Legislative Council on July 1 last year under the \"extradition bill storm\". , were charged with the crime of entering or staying in the conference hall and the crime of rioting. The case was divided into five cases and was arraigned in the Hong Kong District Court for the first time yesterday.\nIn court yesterday, except for Bi Huifen and Pan Haochao who had to continue to repay due to other cases, eight of the other defendants who were granted bail applied to change one of the bail conditions from reporting to the police station once a week to once every two weeks. The prosecution objected, but the judge ultimately approved the defendant's application. In addition, the prosecution applied to consolidate the cases that were originally divided into five cases. One of the defendants reserved the right to object, so the judge adjourned the case to October 16 for another hearing at the West Kowloon Magistrates' Courts.\nThe 12 defendants were charged with the crime of entering or remaining in the Legislative Council Chamber, which refers to violating the \"Legislative Council (Powers and Privileges) Ordinance\" when they entered the Legislative Council Chamber with other unknown persons on the evening of July 1 last year. \"Administrative instructions issued by \"Failure to comply with order or instructions issued by members of the Legislative Council to maintain order.\" As for the riot charges they were charged with, it was alleged that they participated in a riot with other unknown persons at the Legislative Council Complex on the same day and night.\nAccording to reports, 12 people including Liu Yingkuang, who advocated \"soliciting speculation\" and incited violence, and Sun Xiaolan, former president of the Hong Kong Students' Union, were originally charged with entering or staying in the conference hall. Later, they were charged with an additional charge at the Eastern District Magistrates' Court. Riot crime.\nIn addition, one of the defendants, \"Zhan Wang painter\" Poon Ho-chiu, was also charged with one more crime of rioting, alleging that he participated in a riot at the Legislative Council Building on the same afternoon, illegally assembled at the Main Foreign Affairs Office of Tim Mei Road in Admiralty, and illegally damaged property belonging to the Hong Kong government. It is reported that someone threw eggs and kettles at the gates of the Political Chief Executive and the Legislative Council that day.", "uid": "02_06_61", "input": "", "char_offset": "0-588"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vaHViLmpodS5lZHUvMjAyMC8wNy8wNC9ob25nLWtvbmctc2VjdXJpdHktbGF3L9IBAA?oc=5\n", "title": "An end to Hong Kong as we know it? | Hub", "stance": "pos", "content": "", "translation": "", "uid": "02_00_200", "input": "", "char_offset": "0-2715"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1638089933687566947&wfr=spider&for=pc", "title": "香港各界痛批冲击立法会暴行：打着民主旗号破坏法治", "stance": "neg", "content": "", "translation": "Reference News Network reported on July 4 that overseas media said that the Chinese central government condemned those who stormed the Hong Kong Legislative Council building on July 2 as \"extreme radicals\" and expressed \"firm support\" for the Hong Kong Special Administrative Region government and police to handle the incident in accordance with the law. And hold violent offenders criminally accountable in accordance with the law.\nAccording to a report on Singapore's \"Straits Times\" website on July 2, a spokesman for the Hong Kong and Macao Affairs Office of the State Council said: \"Such serious violations trample on the rule of law in Hong Kong, undermine Hong Kong's social order, and damage Hong Kong's fundamental interests. It is a blatant violation of the bottom line of 'one country, two systems'. challenge.\"\nAccording to reports, on July 1, China also lashed out at the United Kingdom because its foreign secretary made remarks accusing China of Hong Kong.\nAccording to a report by Japan's \"Yomiuri Shimbun\" on July 3, Hong Kong young people once occupied the Legislative Council, which has received increasing criticism.\nThe Chinese government also pointed out on the 2nd that this move \"trampled on the rule of law in Hong Kong.\" The Ministry of Foreign Affairs and other departments issued statements and held press conferences to condemn the attack on the Legislative Council.\nThe Chinese government said the attack on the Legislative Council \"undermined Hong Kong's social order.\"", "uid": "02_06_71", "input": "", "char_offset": "0-341"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2FwLXRvcC1uZXdzLWxhd3MtaW50ZXJuYXRpb25hbC1uZXdzLWFycmVzdHMtaG9uZy1rb25nLTQ4MWU0MDUxNDYyOTU0ZjZkZGMzYmIzMDc5ZjE0YWQ00gEA?oc=5\n", "title": "Hong Kong police make first arrests under new security law | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_144", "input": "", "char_offset": "0-1785"}
{"language": "Chinese", "url": "https://news.china.com/domestic/945/20141119/18980930_all.html", "title": "香港警方拘捕4名冲击立法会示威者", "stance": "neg", "content": "", "translation": "On November 18, the 52nd day of Hong Kong's illegal \"Occupy Movement\", many bailiffs in Hong Kong formally launched an operation to clear obstacles outside the CITIC Building in Admiralty in the morning. The staff wearing gloves cut open the iron horses with iron pliers. tape between them and removed the iron horses one by one. \n    China News Service, November 19. According to the Hong Kong Special Administrative Region government website, the Hong Kong police strongly condemned the \"Occupy Action\" demonstrators who stormed the Hong Kong Legislative Council building and disrupted public order in the early morning of the 19th. During the incident, the police arrested four men aged 18 to 24 on suspicion of criminal damage and assaulting police officers. Three male police officers were injured and sent to hospital for treatment.\n\n    At around 1 a.m. this morning, demonstrators stormed the Legislative Council building, causing damage to many parts of the building. The police arrived at the scene to provide assistance at the request of the Legislative Council. The demonstrators repeatedly attacked the police lines. After persuasion and warnings failed, the police took measures, including the use of pepper spray, to prevent the demonstrators from continuing to attack and to defend against attacks.\n\n    The Hong Kong police strongly condemn the actions of these demonstrators that disrupt public order. The police appealed to demonstrators at the scene to follow the instructions of police officers and leave the scene peacefully and orderly. The police reiterated that Hong Kong society agrees to express demands in a rational and peaceful manner, and the police will never tolerate behavior that undermines public order and public safety.\n\n    With the assistance of court bailiffs and the police, the Hong Kong High Court again issued an injunction on the CITIC Building in Admiralty and began to implement it on the 18th. The court authorized the police to arrest, if necessary, those who obstructed bailiffs from carrying out their duties. Enforcing a court injunction is not always smooth sailing.\n\n    The radical student organization \"Students\", the Hong Kong Federation of Students, opposition members of the SAR Legislative Council, and members of radical organizations stood in front of the iron fence and continued to make noises. They even besieged the bailiff and prevented the staff from clearing the roadblock. Members of the Federation of Students even asked the bailiff to explain the injunction and prove how the roadblock blocked traffic.\n\n    On the 18th, despite the presence of bailiffs to assist, the clearing of roadblocks continued intermittently. After a morning of hustle and bustle, part of the road outside CITIC Tower was reopened to traffic at about 2 p.m.\n\n    On November 18, the 52nd day of Hong Kong's illegal \"Occupy Movement\", many bailiffs in Hong Kong formally launched an operation to clear obstacles outside the CITIC Building in Admiralty in the morning. The staff wearing gloves cut open the iron horses with iron pliers. They removed the tape between them and moved the iron horses one by one without encountering any obstacles. \n\n    On November 18, Hong Kong bailiffs went to the entrance and exit of the CITIC Building in Admiralty to enforce the injunction order in the morning. Some illegal occupiers first went outside the CITIC Building and removed some obstacles.", "uid": "02_06_101", "input": "", "char_offset": "0-858"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1638081771440085054&wfr=spider&for=pc", "title": "涉嫌暴力冲击香港立法会，12人已被警方拘捕！", "stance": "neg", "content": "", "translation": "Police have arrested 12 people\nA \"Global Times\" reporter saw on the 3rd that the internal facilities of the Hong Kong Legislative Council were severely damaged, extreme words were sprayed on the walls and elevators, documents in the archives were scattered all over the floor, and even members' personal lockers were pried open. A staff member of the Legislative Council told reporters that everyone should see with their own eyes the evidence of the violent acts of extreme radicals. On the second floor, the building's CCTV was destroyed, suspected to be by violent demonstrators to avoid being photographed. The wall was cut open and the network cables were cut in a very \"professional\" manner. The above-mentioned Legislative Council staff member said that it is difficult to believe that this kind of method was done by ordinary students. Former Hong Kong Chief Executive and Vice Chairman of the National Committee of the Chinese People's Political Consultative Conference, Tung Chee-hwa, questioned on the 3rd that the attack on the Legislative Council may involve a behind-the-scenes organization, hoping that it can be traced.\nWhen a \"Global Times\" reporter interviewed the Legislative Council on the 3rd, Hong Kong police were cleaning up debris and crime tools left by violent demonstrators, including iron bars, scaffolding, floor tiles and umbrellas dismantled from nearby construction sites. Legislative Council staff told reporters that the police evidence collection work has been completed.\nThe violent acts of extreme radicals have aroused the anger of Hong Kong citizens. Many people launched a \"city-wide arrest order to protect the harbor\" through online discussion forums and social media, calling for the reporting of demonstrators suspected of participating in illegal actions. A reporter from the Global Times saw the article titled \"All People Unite, Wanted Thugs\" saying that on the evening of the 1st, someone directed the rioters through an online private chat group to cut off wires and steal computer information.\nHong Kong's Hong Kong Economic Journal published an editorial on the 3rd saying that the Legislative Council was broken into and occupied for about three hours. There is no need to deny the violence, it is justifiable to condemn it, and it is understandable to impose sanctions in accordance with the law. Hong Kong's \"Sing Tao Daily\" reported that Legislative Council member Leung Mei-fun and some members of the legal profession initiated a joint signature, with more than 130 participants. They described July 1 this year as \"the darkest day in the 176-year history of the Legislative Council.\" They condemned the attack, destruction and insult on the Legislative Council that day, which completely exceeded the bottom line of a society governed by the rule of law. They stressed that expressing opinions must not go beyond the law and the Basic Law. 》The bottom line cannot shake the foundation of \"one country, two systems\".\nThe four major chambers of commerce, including the Chinese General Chamber of Commerce of Hong Kong, the Chinese Manufacturers' Federation of Hong Kong, the Federation of Hong Kong Industries and the Chinese Import and Export Chamber of Commerce of Hong Kong, issued the strongest condemnation on the 3rd for the violent actions that attacked the Legislative Council, expressing their full support for the SAR government and the police to take action in accordance with the law as soon as possible. Restoring social order and public tranquility, and pursuing responsibilities in accordance with the law. According to a report by Radio Television Hong Kong on the evening of the 3rd, in connection with the violent attack on the Legislative Council, the police have arrested 11 men and 1 woman on suspicion of possession of offensive weapons, assaulting police officers and other crimes.", "uid": "02_06_79", "input": "", "char_offset": "0-798"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1743478244625424277&wfr=spider&for=pc", "title": "香港2019年“9·29冲突”11人暴动罪成，9人被判监禁，2人判入教导所", "stance": "neg", "content": "", "translation": "During Hong Kong's \"extradition bill storm\" in 2019, 11 people were suspected of participating in the riots surrounding the Hong Kong SAR Government Headquarters and were earlier convicted of riots by the court. Hong Kong East Network and Orange News reported that 9 of the 11 people were each sentenced to three and a half years in prison in the Hong Kong District Court today (9th). The other two people, who were 18 and 16 years old at the time of the incident, were sentenced to education. Place.​\nAccording to reports, on September 29, 2019, someone launched a demonstration and subsequently surrounded the Hong Kong SAR Government Headquarters in Admiralty. Some people threw petrol bombs and debris. The 11 men and women involved had previously denied the charges and were found guilty of rioting after trial. established.\nAccording to reports, Hong Kong District Court Judge Yiu Xunzhi said on the 9th that there were many people involved in this case and the level of violence was high. Some people threw petrol bombs and damaged the water horse of the political headquarters. At the same time, arson and criminal damage occurred, causing certain property losses, and the riot continued After a certain period of time, if the consequences were not for the police to intervene and the consequences would be more serious, the court would have to impose deterrent sentences. After consideration, 9 of them were sentenced to 3 and a half years in prison, and the remaining 2 were sentenced to a training center.", "uid": "02_06_45", "input": "", "char_offset": "0-334"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/201912/02/WS5de46560a310cf3e3557b3c6.html", "title": "Chinese people will not be intimidated by any threats", "stance": "neg", "content": "", "translation": "", "uid": "02_06_239", "input": "", "char_offset": "0-1057"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1638081771440085054&wfr=spider&for=pc", "title": "涉嫌暴力冲击香港立法会，12人已被警方拘捕！", "stance": "neg", "content": "", "translation": "\"The British side always regards itself as the 'guardian'. This is purely sentimental and wishful thinking.\" \"The so-called freedom of Hong Kong residents was won by the British side. This statement is simply shameless!\" \"Relevant British politicians blatantly glorify violent crimes. \"This is a behavior that shields and condones violent criminals and loses the basic sense of right and wrong and moral standards.\" On the 3rd, Foreign Ministry spokesperson Geng Shuang and the head of the Commissioner's Office of the Ministry of Foreign Affairs in Hong Kong denounced British Foreign Secretary Hunt's wrong remarks related to Hong Kong and warned the British government. China should stop grossly interfering in China's internal affairs. After about 300 violent demonstrators broke into and wreaked havoc, Hong Kong's Legislative Council opened to the outside world for the first time on the 3rd. Although I have seen many news pictures, when the \"Global Times\" reporter walked into the messy scene, I was still shocked, sad and angry. The Hong Kong police vowed to investigate to the end and bring the rioters to justice. The four major chambers of commerce, 130 members of the legal profession, politicians, media and other Hong Kong voices on the 3rd, while condemning the atrocities that attacked the Legislative Council, also called on Hong Kong society to return to rationality as soon as possible.", "uid": "02_06_78", "input": "", "char_offset": "0-324"}
{"language": "English", "url": "https://www.chinadaily.com.cn/hkedition/2019-07/05/content_37488400.htm", "title": "Destructive acts in HK are totally counterproductive", "stance": "neg", "content": "", "translation": "", "uid": "02_06_186", "input": "", "char_offset": "0-2614"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-10/16/c_138477191.htm", "title": "Commentary: Washington's phony concern brings real hate to Hong Kong streets", "stance": "neg", "content": "", "translation": "", "uid": "02_06_212", "input": "", "char_offset": "0-1295"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wNy8wMS9hc2lhL2hvbmcta29uZy1wcm90ZXN0cy1kaXZpZGUtaW50bC1obmsvaW5kZXguaHRtbNIBSmh0dHBzOi8vYW1wLmNubi5jb20vY25uLzIwMTkvMDcvMDEvYXNpYS9ob25nLWtvbmctcHJvdGVzdHMtZGl2aWRlLWludGwtaG5r?oc=5\n", "title": "Hong Kong is protesting a China extradition bill, but violence could open divisions | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_168", "input": "", "char_offset": "0-1464"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lmhydy5vcmcvbmV3cy8yMDIzLzA3LzA0L2hvbmcta29uZy13YXJyYW50cy1haW0tYWN0aXZpc3RzLWFicm9hZNIBAA?oc=5\n", "title": "Hong Kong: Warrants Aim at Activists Abroad | Human Rights Watch", "stance": "pos", "content": "", "translation": "", "uid": "02_00_37", "input": "", "char_offset": "0-3454"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/26/c_138339350_2.htm", "title": "Chinese in Southern California rally against violence in Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_177", "input": "", "char_offset": "0-572"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/201911/20/WS5dd49396a310cf3e35578903.html", "title": "Should Hong Kong police be blamed for protesters' violence?", "stance": "neg", "content": "", "translation": "", "uid": "02_06_151", "input": "", "char_offset": "0-2778"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1700977251647447120&wfr=spider&for=pc", "title": "乱港头目黎智英承认组织2019年非法游行 被判加刑14个月", "stance": "neg", "content": "", "translation": "Jimmy Lai, the leader of the chaos in Hong Kong and founder of \"Next Media\", was involved in organizing an illegal demonstration in October 2019. He pleaded guilty to organizing an unauthorized assembly on May 17. The case was sentenced in the Hong Kong District Court on May 28. Jimmy Lai was sentenced to 14 months in prison. Together with the 14 months previously sentenced in other illegal assembly cases, his comprehensive sentence has been adjusted to a total of 20 months in prison.\nOn the afternoon of the incident in 2019, 10 people took the lead in starting the march, and some of them even held banners. The prosecution pointed out that all the defendants' actions were part of a rally. In addition, four people, Jimmy Lai, Lee Cheuk-yan, Leung Kwok-hung and Ho Sau-lan, were sentenced to immediate jail for their involvement in the \"8.18\" and \"8.31\" illegal demonstrations in 2019. Jimmy Lai and Lee Cheuk-yan were each sentenced to 14 months in prison, while Leung Kwok-hung and Ho Sau-lan were sentenced to 18 months and eight months respectively. They are currently serving their sentences in prison.", "uid": "02_06_53", "input": "", "char_offset": "0-283"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2hvbmdrb25nZnAuY29tLzIwMjMvMDcvMDEvaG9wZS1yZWZsZWN0aW9uLWFuZC1kaXNhcHBvaW50bWVudC1hcy1wZW9wbGUtbWFyay0yNnRoLWFubml2ZXJzYXJ5LW9mLWhvbmcta29uZ3MtcmV0dXJuLXRvLWNoaW5lc2UtcnVsZS_SAQA?oc=5\n", "title": "Hope, reflection and disappointment as people mark 26th anniversary of Hong Kong's return to Chinese rule | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_115", "input": "", "char_offset": "0-1622"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmR3LmNvbS9lbi9ob25nLWtvbmctcHJvdGVzdGVycy1yZXR1cm4tdW5kZXItcmVzdHJpY3RpdmUtbWVhc3VyZXMvYS02NTEyNTA4M9IBV2h0dHBzOi8vYW1wLmR3LmNvbS9lbi9ob25nLWtvbmctcHJvdGVzdGVycy1yZXR1cm4tdW5kZXItcmVzdHJpY3RpdmUtbWVhc3VyZXMvYS02NTEyNTA4Mw?oc=5\n", "title": "Hong Kong protesters return under restrictive measures – DW – 03/26/2023", "stance": "pos", "content": "", "translation": "", "uid": "02_00_61", "input": "", "char_offset": "0-2369"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vaHViLmpodS5lZHUvMjAyMC8wNy8wNC9ob25nLWtvbmctc2VjdXJpdHktbGF3L9IBAA?oc=5\n", "title": "An end to Hong Kong as we know it? | Hub", "stance": "pos", "content": "", "translation": "", "uid": "02_00_199", "input": "", "char_offset": "0-2371"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlLzhhMjQxNjEyMTJjMTQwZWJhZjllYWMwMjA0OWE5Nzhh0gEA?oc=5\n", "title": "In Hong Kong, colonial flag still a symbol of prized values | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_208", "input": "", "char_offset": "0-1576"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDI0LTAzLTE2L3R3ZWx2ZS1zZW50ZW5jZWQtdG8tamFpbC1mb3Itc3Rvcm1pbmctaG9uZy1rb25nLWxlZ2lzbGF0dXJlLzEwMzU5NjQzMNIBKGh0dHBzOi8vYW1wLmFiYy5uZXQuYXUvYXJ0aWNsZS8xMDM1OTY0MzA?oc=5\n", "title": "Twelve sentenced to jail for storming Hong Kong legislature in 2019 - ABC News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_35", "input": "", "char_offset": "0-2831"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/201912/02/WS5de46560a310cf3e3557b3c6.html", "title": "Chinese people will not be intimidated by any threats", "stance": "neg", "content": "", "translation": "", "uid": "02_06_240", "input": "", "char_offset": "0-1453"}
{"language": "English", "url": "https://www.chinadaily.com.cn/a/201911/19/WS5dd3454aa310cf3e35578472.html", "title": "Is Hong Kong losing humanity over liberation calls?", "stance": "neg", "content": "", "translation": "", "uid": "02_06_118", "input": "", "char_offset": "0-2422"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/201908/17/WS5d578b28a310cf3e355664f1_1.html", "title": "Who is behind Hong Kong protests?", "stance": "neg", "content": "", "translation": "", "uid": "02_06_176", "input": "", "char_offset": "0-1360"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1637954752531470387&wfr=spider&for=pc", "title": "香港示威者冲击立法会大楼，外交部、中联办、港澳办都发声了", "stance": "neg", "content": "", "translation": "The reporter noticed that regarding the incident of Hong Kong demonstrators attacking the Legislative Council building, the Liaison Office of the Central People’s Government in Hong Kong and the Hong Kong and Macao Affairs Office of the State Council also spoke out today.\nThe head of the Liaison Office of the Central People's Government in the Hong Kong Special Administrative Region said in a statement that some extremists stormed the Legislative Council building in an extremely violent manner and carried out a series of lawless and vandalistic activities in the building, which was shocking, sad and angry. Their atrocities are a great provocation and trample on Hong Kong's rule of law, seriously damaging Hong Kong's social stability, and must not be tolerated. The person in charge said that the Liaison Office of the Central People's Government in Hong Kong firmly supports the SAR government in pursuing relevant violent acts in accordance with the law, resolutely safeguards the rule of law and social order in Hong Kong, and works with people from all walks of life in Hong Kong to safeguard Hong Kong's prosperity and stability.\nA spokesman for the Hong Kong and Macao Affairs Office of the State Council said that July 1 is a festive day for people from all walks of life in Hong Kong to commemorate Hong Kong's return to the motherland and the establishment of the Hong Kong Special Administrative Region. However, some extreme radicals use the pretext of opposing the amendment of relevant regulations of the SAR government to attack the legislation in extremely violent ways. the Legislative Council building and wantonly damaged the Legislative Council facilities. This serious illegal behavior tramples on Hong Kong's rule of law, undermines Hong Kong's social order, and harms Hong Kong's fundamental interests. It is a blatant challenge to the bottom line of \"one country, two systems.\" We strongly condemn this. The spokesperson said that the central government firmly supports the Hong Kong Special Administrative Region government and police in performing their duties in accordance with the law, and supports relevant agencies in the Hong Kong Special Administrative Region in pursuing the criminal responsibility of violent criminals in accordance with the law, restoring normal social order as soon as possible, ensuring the personal and property safety of citizens, and maintaining Hong Kong's security. Prosperity and stability.", "uid": "02_06_83", "input": "", "char_offset": "0-489"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2FwLXRvcC1uZXdzLWxhd3MtaW50ZXJuYXRpb25hbC1uZXdzLWFycmVzdHMtaG9uZy1rb25nLTQ4MWU0MDUxNDYyOTU0ZjZkZGMzYmIzMDc5ZjE0YWQ00gEA?oc=5\n", "title": "Hong Kong police make first arrests under new security law | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_146", "input": "", "char_offset": "0-1028"}
{"language": "English", "url": "https://www.chinadaily.com.cn/a/201906/14/WS5d02df88a3103dbf143281c6.html", "title": "Rational and calm discussion on Hong Kong extradition bill urged", "stance": "neg", "content": "", "translation": "", "uid": "02_06_157", "input": "", "char_offset": "0-1362"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1666105065670489802&wfr=spider&for=pc", "title": "香港修例风波回望：当青年被绑上暴力战车", "stance": "neg", "content": "", "translation": "After the handover, general education became a compulsory subject for Hong Kong's college entrance examination, but it has become a platform for Hong Kong's unscrupulous teachers to misguide young students.\nI flipped through some general education textbooks, and what I suddenly saw were general education textbooks written by some teachers that attacked \"one country, two systems\", beautified the illegal \"Occupy Central\", intensified conflicts between Hong Kong and the mainland, and vilified and stigmatized the mainland... It has become a de facto political propaganda and is used to incite students to participate in radical illegal actions.\nThe deficiencies and distortions in Chinese history education also have far-reaching consequences. Since 2000, Chinese history has been no longer a compulsory subject in Hong Kong schools for a long time. Many Hong Kong young people have grown up in a curriculum framework that blurs their historical roots and forgets about historical changes.\n\"Some teachers who grew up in the British Hong Kong era have never experienced patriotic education or Chinese history education, and have a superficial understanding of history and national conditions, and are even full of negative cognitions and prejudices. Their elaboration of history and guidance to students have contributed to Young people are dissatisfied with the status quo,\" said Mu Jiajun, a teacher at Pei Qiao Middle School in Hong Kong.\nHong Kong political commentator Qu Yingyan pointed out that in Hong Kong junior high school textbooks, \"the 'national hatred' part about the Nanjing Massacre only has 75 words, but the 'family hatred' part about the Great Leap Forward and the 'Cultural Revolution' takes 18 pages. So everyone You will understand why young people in Hong Kong don’t blush when they hold the British and American flags.”", "uid": "02_06_48", "input": "", "char_offset": "0-419"}
{"language": "English", "url": "http://www.81.cn/ChinaMilitary/rdxw_208665/9808065.html", "title": "HKMAO says 'political virus' destroying HK's stability", "stance": "neg", "content": "", "translation": "", "uid": "02_06_115", "input": "", "char_offset": "0-1823"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1800528655380379273&wfr=spider&for=pc", "title": "香港“35+”非法初选案45人罪成，李家超发声", "stance": "neg", "content": "", "translation": "Chief Executive of the Hong Kong Special Administrative Region Lee Ka-chiu said on the 30th that a total of 47 people were prosecuted in this case, 45 of whom were convicted, which shows the scale and seriousness of the criminal plan. The evidence in court revealed that the \"ten-step plan to attract speculation\" proposed by those involved simultaneously brought Hong Kong society to a standstill through large-scale street riots and other means, and coupled with international political and economic sanctions, in order to achieve \"speculation.\" As a result, citizens suffer.\nLee Ka-chiu pointed out that the court determined that the crime of conspiracy to subvert state power was committed in this case, aiming to undermine, destroy or overthrow the current political system and structure of the Hong Kong Special Administrative Region established by the Basic Law and the \"One Country, Two Systems\" policy.\nLi Jiachao emphasized that the SAR has the responsibility to safeguard national security and will resolutely crack down on behaviors and activities that endanger national security. In this regard, the SAR government must abide by the law and enforce the law strictly. It will make every effort to prevent, stop and punish behaviors and activities that endanger national security, and fulfill this unequivocal responsibility.\nA spokesman for the Hong Kong SAR government added in a press release that during the court trial, foreign forces blatantly and continuously smeared the judiciary, the Department of Justice and law enforcement agencies, and even used intimidating political methods and misleading remarks to create pressure and try to interfere with the fair trial of the case. This is a despicable plot that blatantly tramples on the rule of law, and the SAR government condemns it in the strongest possible terms.", "uid": "02_06_56", "input": "", "char_offset": "0-398"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wOS8yNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0LXZpb2xlbmNlLWludGwtaG5rL2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDE5LzA5LzI2L2FzaWEvaG9uZy1rb25nLXByb3Rlc3QtdmlvbGVuY2UtaW50bC1obms?oc=5\n", "title": "How a summer of protest pushed young Hong Kongers to the edge | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_161", "input": "", "char_offset": "0-2405"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZm9yZWlnbnBvbGljeS5jb20vMjAxOS8xMi8yMC9ob25nLWtvbmctcHJvdGVzdHMtMjAxOS_SAQA?oc=5\n", "title": "Hong Kong’s Protest Year", "stance": "pos", "content": "", "translation": "", "uid": "02_00_179", "input": "", "char_offset": "0-2109"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1714688125201271570&wfr=spider&for=pc", "title": "乱港头目认罪，反华机构要撤出香港∣香港一日", "stance": "neg", "content": "", "translation": "Amnesty International, which has repeatedly smeared China, decided to withdraw from Hong Kong\nAmnesty International, which often interferes in the internal affairs of other countries in the name of \"human rights,\" claims that it will be impossible for human rights organizations to operate freely in Hong Kong after the implementation of Hong Kong's national security law, and it will close its two offices in Hong Kong before the end of this year. Chief Executive Carrie Lam Cheng Yuet-ngor said when meeting reporters before attending the Executive Council today (26th) that different organizations and people have left Hong Kong on the grounds that Hong Kong has implemented the Hong Kong National Security Law, but no one can prove that this is the real reason.\nLam Cheng Yuet-ngor said that citizens’ freedom of speech and assembly are protected by the Basic Law, and Hong Kong’s National Security Law also has provisions to protect human rights. Unless any organization uses Hong Kong to engage in activities that endanger national security, there is no need to worry if it operates legitimately and legally.\nCarrie Lam also listed actual data to refute the organization's fallacies. She said that the number of mainland and overseas companies setting up offices in Hong Kong rose instead of falling, breaking a record to more than 9,000. In addition, some international and regional legal institutions have also set up offices in Hong Kong, reflecting that Hong Kong’s national security law does not deter people from engaging in legitimate activities.", "uid": "02_06_33", "input": "", "char_offset": "0-336"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_17", "input": "", "char_offset": "0-247"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmNubi5jb20vYXNpYS9saXZlLW5ld3MvaG9uZy1rb25nLWp1bHktMS1wcm90ZXN0cy1pbnRsLWhuay9pbmRleC5odG1s0gFUaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vYXNpYS9saXZlLW5ld3MvaG9uZy1rb25nLWp1bHktMS1wcm90ZXN0cy1pbnRsLWhuay9pbmRleC5odG1s?oc=5\n", "title": "Hong Kong protesters storm government building over China extradition bill - live updates", "stance": "pos", "content": "", "translation": "", "uid": "02_00_54", "input": "", "char_offset": "0-825"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAyMS8wNi8yOS9hc2lhL2hvbmcta29uZy1uc2wtb25lLXllYXItaW50bC1obmstZHN0L2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDIxLzA2LzI5L2FzaWEvaG9uZy1rb25nLW5zbC1vbmUteWVhci1pbnRsLWhuay1kc3Q?oc=5\n", "title": "Hong Kong: One year after China passed the national security law, residents feel Beijing’s tightening grip | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_154", "input": "", "char_offset": "0-1341"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2hvbmdrb25nZnAuY29tLzIwMjMvMDcvMDEvaG9wZS1yZWZsZWN0aW9uLWFuZC1kaXNhcHBvaW50bWVudC1hcy1wZW9wbGUtbWFyay0yNnRoLWFubml2ZXJzYXJ5LW9mLWhvbmcta29uZ3MtcmV0dXJuLXRvLWNoaW5lc2UtcnVsZS_SAQA?oc=5\n", "title": "Hope, reflection and disappointment as people mark 26th anniversary of Hong Kong's return to Chinese rule | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_114", "input": "", "char_offset": "0-2952"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2hvbmdrb25nZnAuY29tLzIwMjMvMDcvMDIvaGtmcC1sZW5zLXBvbXAtY2VyZW1vbnktYW5kLXBhdHJpb3Rpc20tZm9yLWhhbmRvdmVyLWFubml2ZXJzYXJ5LWFzLXBvbGljZS1kZXBsb3ktYWNyb3NzLWhvbmcta29uZy_SAQA?oc=5\n", "title": "HKFP Lens: Pomp, ceremony and patriotism for Handover anniversary, as police deploy across Hong Kong | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_141", "input": "", "char_offset": "0-601"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1714688125201271570&wfr=spider&for=pc", "title": "香港之乱丨侮辱国旗、冲击立法会……暴力示威让东方之珠蒙尘", "stance": "neg", "content": "", "translation": "On July 21, 2019, radicals surrounded and attacked the Liaison Office of the Central People’s Government in Hong Kong. They threw eggs and black paint bombs at the national emblem, and wrote words that insulted the dignity of the country and nation.\n\nOn August 3, 2019, at the Star Ferry Pier in Tsim Sha Tsui, several masked black-clad extreme radicals tore down the national flag from the flagpole and threw it into the sea. At the same time, a flag with the slogan \"Hong Kong Independence\" was raised.\n\nOn August 5, 2019, in Tsim Sha Tsui, the national flag was once again torn down and trampled on.\n\nHong Kong citizens: It’s like the Eight-Nation Allied Forces have entered, and our national flag looks like it’s been trampled by horses. If you don't respect me, don't insult me. You are insulting the entire nation, so (I) am angry.\nBritish expert Adam Gary: You can imagine what it would be like if a mob broke into the U.S. Congress, insulted the U.S. national emblem, and raised the flag of another country. This illegal behavior is very wrong.\n\nThe flag that insults one's own country is actually the flag of colonial Hong Kong, or even the flag of the British and American countries.\n\nPolish media person Rafael Tomanski: To be honest, I don’t understand why these people are waving the British flag, or the British colonial flag. The British colonists would not tolerate demonstrations. The police at that time would use tear gas and other methods to end the demonstrations as quickly as possible.\n\nFamous British scholar Martin Jacques: Do they really want to go back to the 156 years when the British colonized Hong Kong? Are they praising democracy? Sorry, in the 156 years since the British colonized Hong Kong, they have never implemented any form of universal suffrage in Hong Kong, not even a shadow of it.\n\nHong Kong citizens: You are Chinese, you are Hong Kongers, you must protect this place, and you cannot make this place such a mess.", "uid": "02_06_37", "input": "", "char_offset": "0-544"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vdGltZS5jb20vNTg3NDkwMS9ob25nLWtvbmctbmF0aW9uYWwtc2VjdXJpdHktbGF3LXRpbWVsaW5lL9IBAA?oc=5\n", "title": "Hong Kong's First Month Under the National Security Law | TIME", "stance": "pos", "content": "", "translation": "", "uid": "02_00_185", "input": "", "char_offset": "0-1618"}
{"language": "Chinese", "url": "https://www.thepaper.cn/newsDetail_forward_3852661", "title": "香港警方拘捕16男2女 涉冲击立法会等多项暴力事件", "stance": "neg", "content": "", "translation": "In the recorded conversation provided by the reporter, the suspected middleman answered the amount of \"remuneration\" for \"asking a brother to do something\", confirming that there was someone behind the instigation and control of the recent mob actions.\nThe intermediary revealed that those who stood on the front lines of attacking the police defense line, besieging the Police Headquarters, and breaking into the Legislative Council, and throwing bricks and eggs at the police and buildings could get 3,000 yuan, while those who dug bricks in the back office could get 500 yuan. Working hours for 24 hours.\n\nThe reporter also mentioned that those on the front lines will be fully armed for identification, including yellow helmets, goggles and masks. \"Reporters\" will film the entire process. After the incident is completed, the \"yellow head\" will charge 3,000 yuan, while others are cheaper.", "uid": "02_06_68", "input": "", "char_offset": "0-203"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_18", "input": "", "char_offset": "0-330"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiqAFodHRwczovL3d3dy53YXNoaW5ndG9ucG9zdC5jb20vd29ybGQvaG9uZy1rb25nLXBvbGljZS1jbGFzaC13aXRoLXByb3Rlc3RlcnMtb24tYW5uaXZlcnNhcnktb2YtcmV0dXJuLXRvLWNoaW5hLzIwMTkvMDYvMzAvN2YwYTA1YWUtOWIzYy0xMWU5LTgzZTMtNDVmZGVkOGU4ZDJlX3N0b3J5Lmh0bWzSAQA?oc=5\n", "title": "Hong Kong protests live updates: Protesters storm parliament on anniversary of return to China  - The Washington Post", "stance": "pos", "content": "", "translation": "", "uid": "02_00_176", "input": "", "char_offset": "0-2138"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDE5LzcvMy9ob25nLWtvbmctcHJvdGVzdHMtYWxsLXRoZS1sYXRlc3QtdXBkYXRlc9IBVWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAxOS83LzMvaG9uZy1rb25nLXByb3Rlc3RzLWFsbC10aGUtbGF0ZXN0LXVwZGF0ZXM?oc=5\n", "title": "Hong Kong protests: All the latest updates | Hong Kong Protests News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_133", "input": "", "char_offset": "0-2184"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/201911/28/WS5ddf3bc8a310cf3e3557aa42.html", "title": "Perspective: Distinguishing between protests and riots in Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_140", "input": "", "char_offset": "0-1879"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL2hvbmdrb25nZnAuY29tLzIwMjMvMDcvMDEvaG9uZy1rb25ncy1qb2huLWxlZS13YXJucy1hZ2FpbnN0LXNvZnQtcmVzaXN0YW5jZS1hcy1wb21wLXBhdHJpb3Rpc20tcmVwbGFjZS1wcm90ZXN0cy1vbi1oYW5kb3Zlci1hbm5pdmVyc2FyeS_SAQA?oc=5\n", "title": "Hong Kong's John Lee warns against 'soft resistance' as pomp, patriotism replace protests on Handover anniversary | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_60", "input": "", "char_offset": "0-3508"}
{"language": "English", "url": "http://www.chinadaily.com.cn/kindle/2019-11/23/content_37524955.htm", "title": "HK protests expose Western media bias", "stance": "neg", "content": "", "translation": "", "uid": "02_06_126", "input": "", "char_offset": "0-981"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDE5LzA3LzAxL3doeS1ob25nLWtvbmctaGFzLWJlY29tZS1jaXR5LXByb3Rlc3RzL9IBAA?oc=5\n", "title": "Why are people in Hong Kong protesting? - The Washington Post", "stance": "neutral", "content": "", "translation": "", "uid": "02_00_212", "input": "", "char_offset": "0-2684"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LnZveC5jb20vd29ybGQvMjAxOS84LzI4LzIwODM1NDYyL2hvbmcta29uZy1wcm90ZXN0cy0yMDE5LW5ld3MtdXBkYXRlc9IBAA?oc=5\n", "title": "Hong Kong protests 2019: news and updates - Vox", "stance": "pos", "content": "", "translation": "", "uid": "02_00_95", "input": "", "char_offset": "0-3088"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMTkvMDcvMDEvZnJlc2gtaG9uZy1rb25nLXByb3Rlc3RzLXRvLW1hcmstMjIteWVhcnMtc2luY2UtaGFuZG92ZXItdG8tY2hpbmEuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDE5LzA3LzAxL2ZyZXNoLWhvbmcta29uZy1wcm90ZXN0cy10by1tYXJrLTIyLXllYXJzLXNpbmNlLWhhbmRvdmVyLXRvLWNoaW5hLmh0bWw?oc=5\n", "title": "Hong Kong protesters smash windows and storm the legislature", "stance": "pos", "content": "", "translation": "", "uid": "02_00_83", "input": "", "char_offset": "0-2313"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/201911/21/WS5dd5eaeca310cf3e35578e1e_10.html", "title": "How much economic pain has violence inflicted upon Hong Kong?", "stance": "neg", "content": "", "translation": "", "uid": "02_06_194", "input": "", "char_offset": "0-1013"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiqQFodHRwczovL3d3dy53YXNoaW5ndG9ucG9zdC5jb20vd29ybGQvYXNpYV9wYWNpZmljL3doeS1ob25nLWtvbmctcHJvdGVzdGVycy1yYWdlLW9uLWV2ZW4tdGhvdWdoLXRoZXktY2Fubm90LXdpbi8yMDE5LzA3LzAzLzBjNzM4ODUwLTljZDktMTFlOS04M2UzLTQ1ZmRlZDhlOGQyZV9zdG9yeS5odG1s0gEA?oc=5\n", "title": "Why Hong Kong protesters rage on, even though they cannot win - The Washington Post", "stance": "pos", "content": "", "translation": "", "uid": "02_00_187", "input": "", "char_offset": "0-2223"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2hvbmdrb25nZnAuY29tLzIwMjMvMDcvMDEvaG9wZS1yZWZsZWN0aW9uLWFuZC1kaXNhcHBvaW50bWVudC1hcy1wZW9wbGUtbWFyay0yNnRoLWFubml2ZXJzYXJ5LW9mLWhvbmcta29uZ3MtcmV0dXJuLXRvLWNoaW5lc2UtcnVsZS_SAQA?oc=5\n", "title": "Hope, reflection and disappointment as people mark 26th anniversary of Hong Kong's return to Chinese rule | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_116", "input": "", "char_offset": "0-1373"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnBicy5vcmcvbmV3c2hvdXIvd29ybGQvY2hpbmFzLXhpLWppbnBpbmctY291bnRlcnMtY3JpdGljaXNtcy1vbi0yNXRoLWFubml2ZXJzYXJ5LW9mLWhvbmcta29uZ3MtcmV0dXJu0gF1aHR0cHM6Ly93d3cucGJzLm9yZy9uZXdzaG91ci9hbXAvd29ybGQvY2hpbmFzLXhpLWppbnBpbmctY291bnRlcnMtY3JpdGljaXNtcy1vbi0yNXRoLWFubml2ZXJzYXJ5LW9mLWhvbmcta29uZ3MtcmV0dXJu?oc=5\n", "title": "China’s Xi Jinping counters criticisms on 25th anniversary of Hong Kong’s return | PBS NewsHour", "stance": "pos", "content": "", "translation": "", "uid": "02_00_194", "input": "", "char_offset": "0-2301"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/202011/30/WS5fc444c2a31024ad0ba983aa.html", "title": "Violence doesn't advance political agenda as verified by Hong Kong experience", "stance": "neg", "content": "", "translation": "", "uid": "02_06_237", "input": "", "char_offset": "0-1663"}
{"language": "English", "url": "https://www.chinadaily.com.cn/hkedition/2019-10/15/content_37515511.htm", "title": "US has 'hidden agenda' with Act", "stance": "neg", "content": "", "translation": "", "uid": "02_06_187", "input": "", "char_offset": "0-1080"}
{"language": "Chinese", "url": "https://www.thepaper.cn/newsDetail_forward_3852661", "title": "香港警方拘捕16男2女 涉冲击立法会等多项暴力事件", "stance": "neg", "content": "", "translation": "On the evening of July 1, demonstrators illegally and violently broke into the Legislative Council. Inside the Legislative Council, the SAR emblem, the rostrum, and the desks of members were covered with graffiti, and the portrait of the Chairman of the Legislative Council was destroyed.\n\nMost of the people who participated in the violent attack on the Legislative Council were young people. The reporter explained that this is because the forces behind the attack only accept young people aged 22 to 24, and it is best to have student status.\n\nAccording to Hong Kong Wen Wei Po, the Legislative Council building was attacked and vandalized by a large number of rioters on July 1. The damage was serious. The Legislative Council meeting has not been scheduled. The Finance Committee's backlog of more than 40 agenda items related to people's livelihood infrastructure may be postponed to the next Legislative Council year. deal with. Behind the violent impact, citizens of different classes bear the brunt of the impact.\n\nAccording to Hong Kong media reports on July 3, the Legislative Council Administrative Committee will hold a special meeting at the Admiralty Government Offices on the 4th to discuss follow-up arrangements for serious damage to the building.", "uid": "02_06_69", "input": "", "char_offset": "0-266"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/06/c_138286032.htm", "title": "Xinhua Headlines: Protesters cause mayhem as HKSAR chief executive warns of \"very dangerous situation\"", "stance": "neg", "content": "", "translation": "", "uid": "02_06_167", "input": "", "char_offset": "0-1295"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5uZXd5b3JrZXIuY29tL25ld3MvZGFpbHktY29tbWVudC90aGUtZGlzaWxsdXNpb24tYW5kLWZydXN0cmF0aW9uLW9mLWEtbmV3LWdlbmVyYXRpb24taXMtZnVlbGxpbmctaG9uZy1rb25ncy1wcm90ZXN0c9IBAA?oc=5\n", "title": "The Disillusion and Frustration of a New Generation is Fuelling Hong Kong’s Protests | The New Yorker", "stance": "pos", "content": "", "translation": "", "uid": "02_00_110", "input": "", "char_offset": "0-1680"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1701437536366264007&wfr=spider&for=pc", "title": "最新铁证！美国在香港搞“政治731”实验，上千大学生成“小白鼠”", "stance": "neg", "content": "", "translation": "Zhi Zhenfeng, a researcher at the Chinese Academy of Social Sciences, told reporters that this paper provides a very authoritative confirmation. Because an academic paper has strict requirements on method and data sources and must undergo anonymous review, the accuracy of the facts disclosed in this academic paper is no less accurate than a news report, or even more accurate than a news report.\nFrom this, we can see how the West is deeply involved in social movements in other countries and regions and provokes social unrest in other countries. In the form of an academic paper, the author describes the United States' instigation, instigation, and participation in organizing social movements in other countries and regions. A more accurate description. Three points can be seen:\nFirst, the violent social movements in Hong Kong and many other places have foreign masterminds.\nSecond, the United States and the West are organized, premeditated, methodological, funded, and involved in inciting color revolution social violence in other places.\nThird, we can see that the distorted values ​​and morals of the United States and the West actually regard inciting riots in other countries as a glorious mission, and do so openly and openly, to the point of cognitive confusion, obsession, and pride instead of shame.\nLu Xiang, a researcher at the Institute of American Studies of the Academy of Social Sciences, told reporters that similar papers would not be allowed to be published if they were used for domestic political research in the United States. Because this article involves some data on society as a whole, it falls under the category of national security and should be subject to strict laws and regulations.\nObviously, there will be various dissatisfactions in any society, but no country will allow such dissatisfaction to turn into political riots. Such a paper, to put it bluntly, provides a social psychological basis for organizing political protests in disguise.\nThe publication of such articles shows that the United States only cares about its own stability, completely ignores the stability of other countries and regions, and even hopes that some target countries will be unstable. The United States has a long tradition of engaging in \"color revolutions\" abroad, and has a complete set of methods to guide them. Under the guidance of this method, various sporadic dissatisfactions in society can easily aggregate into political and thematic dissatisfaction. Lu Xiang calls it \"horizontal\" mobilization, which gathers dissatisfaction from all corners under one banner.\nOn the other hand, this paper also reflects that before the introduction of the Hong Kong National Security Law, Hong Kong society had a serious lack of security for a long period of time. However, now is not the time to talk about accountability, but to quickly close the loopholes one by one.", "uid": "02_06_30", "input": "", "char_offset": "0-738"}
{"language": "English", "url": "http://www.xinhuanet.com//english/2019-08/07/c_138289926.htm?src=ilaw", "title": "Hong Kong gov't officials denounce violence after protesters cause mayhem", "stance": "neg", "content": "", "translation": "", "uid": "02_06_108", "input": "", "char_offset": "0-1425"}
{"language": "English", "url": "https://www.chinadaily.com.cn/global/2019-08/22/content_37504425.htm", "title": "Peer influence among factors blamed in HK", "stance": "neg", "content": "", "translation": "", "uid": "02_06_244", "input": "", "char_offset": "0-2207"}
{"language": "English", "url": "https://www.chinadaily.com.cn/hkedition/2019-07/03/content_37487367.htm", "title": "July 1, 2019 will be remembered as a day of shame for Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_111", "input": "", "char_offset": "0-2780"}
{"language": "English", "url": "https://www.chinadaily.com.cn/kindle/2019-08/25/content_37505382.htm", "title": "Protests disrupt city's stability and operations", "stance": "neg", "content": "", "translation": "", "uid": "02_06_135", "input": "", "char_offset": "0-2362"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LnZvYW5ld3MuY29tL2EvZWFzdC1hc2lhLXBhY2lmaWNfY2hpbmVzZS1zdGF0ZS1tZWRpYS10YWtlLWhhcmQtbGluZS1ob25nLWtvbmctcHJvdGVzdHMvNjE3MDk1Ny5odG1s0gFwaHR0cHM6Ly93d3cudm9hbmV3cy5jb20vYW1wL2Vhc3QtYXNpYS1wYWNpZmljX2NoaW5lc2Utc3RhdGUtbWVkaWEtdGFrZS1oYXJkLWxpbmUtaG9uZy1rb25nLXByb3Rlc3RzLzYxNzA5NTcuaHRtbA?oc=5\n", "title": "Chinese State Media Take Hard Line on Hong Kong Protests", "stance": "pos", "content": "", "translation": "", "uid": "02_00_119", "input": "", "char_offset": "0-3496"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vaG9uZ2tvbmdmcC5jb20vMjAyMi8wNy8wMi90aW1lbGluZS1ob25nLWtvbmdzLWp1bHktMS1jYXJuaXZhbC1vZi1kaXNzZW50LWhvdy0xNy15ZWFycy1vZi1wcm90ZXN0LWRlbWFuZHMtZmVsbC1zaWxlbnQv0gEA?oc=5\n", "title": "Timeline: Hong Kong's July 1 carnival of dissent - how 17 years of protest demands fell silent | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_47", "input": "", "char_offset": "0-2321"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2FwbmV3cy5jb20vYXJ0aWNsZS94aS1qaW5waW5nLWhvbmcta29uZy1jYXJyaWUtbGFtLWdvdmVybm1lbnQtYW5kLXBvbGl0aWNzLWRvbmFsZC10c2FuZy0yZWVjMzA1MmY2NTdlNjRmMjg2YmIwY2Q4NjIzMWFiZtIBAA?oc=5\n", "title": "Xi defends vision of Hong Kong on 25th anniversary of return | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_172", "input": "", "char_offset": "0-1958"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL3dvcmxkL2hvbmcta29uZy1wcm90ZXN0ZXJzLTEuNzEwMTM2MdIBIGh0dHBzOi8vd3d3LmNiYy5jYS9hbXAvMS43MTAxMzYx?oc=5\n", "title": "Hong Kong court convicts 4 people of rioting over storming of legislature in 2019 protests | CBC News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_12", "input": "", "char_offset": "0-3409"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1685474234536848592&wfr=spider&for=pc", "title": "港媒：香港警方拘捕“民阵”召集人等8人，涉七一非法集会", "stance": "neg", "content": "", "translation": "Hong Kong media pointed out that on July 1, Chen Haohuan, Xu Zijian, Wu Zhiwei, Zhu Kaidi, Liang Guoxiong and Tang Shili organized and led a parade in the area from To Lao Chi Road to Hennessy Road in Wan Chai to conduct an unauthorized assembly. After in-depth investigation and consultation with the Department of Justice for legal advice, the Criminal Division of the Hong Kong Island Region decided to take arrest action this morning and arrested 8 men ranging in age from 24 to 64 years old in multiple districts across Hong Kong.\nIt is reported that among the eight people involved in the case, Chen Haohuan and Hu Zhiwei were charged with three counts of inciting others, holding or organizing, and participating in unauthorized assemblies; Liang Guoxiong, Zhu Kaidi, and Deng Shili were charged with holding or organizing, and participating in unauthorized assemblies. Two counts of approving an assembly; Zeng Jiancheng, Chen Rongtai and Xu Zijian were charged with inciting others to participate in an unauthorized assembly.\nThe report pointed out that this year, on the first July 1st Handover Day after the implementation of the National Security Law in Hong Kong, the opposition organization \"Democratic Front\" and other groups launched a march on Hong Kong Island on that day. Although the police refused to issue a \"notice of no objection\", there were still people in Causeway Bay and Hong Kong that day. A large number of violent demonstrators appeared in Wan Chai area, blocking roads with debris, setting fires and damaging shops. Some people waved \"Hong Kong independence\" flags and American and British flags on the streets, and shouted slogans opposing Hong Kong's national security law and \"Hong Kong independence\". The police sprayed pepper spray, fired tear gas and fired water cannons to disperse the demonstrators, and arrested 370 people.", "uid": "02_06_11", "input": "", "char_offset": "0-411"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnBicy5vcmcvbmV3c2hvdXIvd29ybGQvY2hpbmFzLXhpLWppbnBpbmctY291bnRlcnMtY3JpdGljaXNtcy1vbi0yNXRoLWFubml2ZXJzYXJ5LW9mLWhvbmcta29uZ3MtcmV0dXJu0gF1aHR0cHM6Ly93d3cucGJzLm9yZy9uZXdzaG91ci9hbXAvd29ybGQvY2hpbmFzLXhpLWppbnBpbmctY291bnRlcnMtY3JpdGljaXNtcy1vbi0yNXRoLWFubml2ZXJzYXJ5LW9mLWhvbmcta29uZ3MtcmV0dXJu?oc=5\n", "title": "China’s Xi Jinping counters criticisms on 25th anniversary of Hong Kong’s return | PBS NewsHour", "stance": "pos", "content": "", "translation": "", "uid": "02_00_191", "input": "", "char_offset": "0-1296"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vdGltZS5jb20vNTg3NDkwMS9ob25nLWtvbmctbmF0aW9uYWwtc2VjdXJpdHktbGF3LXRpbWVsaW5lL9IBAA?oc=5\n", "title": "Hong Kong's First Month Under the National Security Law | TIME", "stance": "pos", "content": "", "translation": "", "uid": "02_00_183", "input": "", "char_offset": "0-2985"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_21", "input": "", "char_offset": "0-312"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_33", "input": "", "char_offset": "0-307"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vZnJvbnRsaW5lLnRoZWhpbmR1LmNvbS93b3JsZC1hZmZhaXJzLzI2LXllYXJzLW9mLXVuY2VydGFpbnR5LWhvbmcta29uZy1qb3VybmV5LXNpbmNlLXRoZS1oYW5kb3Zlci9hcnRpY2xlNjcwMzc3NzYuZWNl0gEA?oc=5\n", "title": "\n\t26 years of uncertainty: Hong Kong’s journey since the handover - Frontline\n", "stance": "pos", "content": "", "translation": "", "uid": "02_00_105", "input": "", "char_offset": "0-1994"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vaG9uZy1rb25nLXByb3Rlc3RlcnMtc3Rvcm1lZC1zdHJlZXRzLWdyYWZmaXRpZWQtbGVnaXNsYXRpdmUtYnVpbGRpbmctdGFrZW92ZXItMjAxOS030gF4aHR0cHM6Ly93d3cuYnVzaW5lc3NpbnNpZGVyLmNvbS9ob25nLWtvbmctcHJvdGVzdGVycy1zdG9ybWVkLXN0cmVldHMtZ3JhZmZpdGllZC1sZWdpc2xhdGl2ZS1idWlsZGluZy10YWtlb3Zlci0yMDE5LTc_YW1w?oc=5\n", "title": "Images of Hong Kong Protesters Storming the Streets and Taking Over Buildings - Business Insider", "stance": "pos", "content": "", "translation": "", "uid": "02_00_211", "input": "", "char_offset": "0-2291"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAyMS8wNi8yOS9hc2lhL2hvbmcta29uZy1uc2wtb25lLXllYXItaW50bC1obmstZHN0L2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDIxLzA2LzI5L2FzaWEvaG9uZy1rb25nLW5zbC1vbmUteWVhci1pbnRsLWhuay1kc3Q?oc=5\n", "title": "Hong Kong: One year after China passed the national security law, residents feel Beijing’s tightening grip | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_153", "input": "", "char_offset": "0-1466"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vaHViLmpodS5lZHUvMjAyMC8wNy8wNC9ob25nLWtvbmctc2VjdXJpdHktbGF3L9IBAA?oc=5\n", "title": "An end to Hong Kong as we know it? | Hub", "stance": "pos", "content": "", "translation": "", "uid": "02_00_202", "input": "", "char_offset": "0-3828"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnBicy5vcmcvbmV3c2hvdXIvd29ybGQvcGhvdG9zLWhvbmcta29uZy1wcm90ZXN0b3JzLWJyZWFrLWludG8tbGVnaXNsYXRpdmUtYnVpbGRpbmfSAWJodHRwczovL3d3dy5wYnMub3JnL25ld3Nob3VyL2FtcC93b3JsZC9waG90b3MtaG9uZy1rb25nLXByb3Rlc3RvcnMtYnJlYWstaW50by1sZWdpc2xhdGl2ZS1idWlsZGluZw?oc=5\n", "title": "PHOTOS: Hong Kong protestors break into legislative building | PBS NewsHour", "stance": "pos", "content": "", "translation": "", "uid": "02_00_78", "input": "", "char_offset": "0-2459"}
{"language": "Chinese", "url": "https://www.thepaper.cn/newsDetail_forward_3852661", "title": "香港警方拘捕16男2女 涉冲击立法会等多项暴力事件", "stance": "neg", "content": "", "translation": "Hong Kong has been vandalized many times by rioters in the past month, including occupying and blocking important arterial roads, attacking police lines, and besieging the police headquarters twice. On July 1, a large number of rioters stormed the Legislative Council building and destroyed it. The damage was serious, and the Legislative Council was in session. There is no deadline, and the Finance Committee's backlog of more than 40 agenda items related to people's livelihood infrastructure may be postponed to the next Legislative Council year. Behind the violent impact, citizens of different classes bear the brunt of the impact.\n\nAccording to a report by Hong Kong Ta Kung Pao on July 4, a large number of videos and photos showed that the rioters carried out attacks in an organized and premeditated manner, rather than in a scattered mess. A recorded conversation provided by a reader showed that there were organized instigators behind the attack on the Legislative Council. At the same time, there were financial sponsors who provided money to induce \"hot-blooded\" young people to engage in aggressive behaviors, including digging bricks, throwing eggs, and acting as strikers. Each person can Receive \"remuneration\" ranging from 500 to 5,000 yuan. At the same time, the middleman can also \"draw money and water\" from it.", "uid": "02_06_67", "input": "", "char_offset": "0-287"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy53YXNoaW5ndG9ucG9zdC5jb20vd29ybGQvYXNpYV9wYWNpZmljL2hvbmcta29uZy1wcm90ZXN0cy1wb2xpY2UtY2hpbmEvMjAyMC8xMC8wMS8zMzFjMmVmZS0wMTQ1LTExZWItYjkyZS0wMjk2NzZmOWViZWNfc3RvcnkuaHRtbNIBAA?oc=5\n", "title": "Hong Kong police thwart protests set for China's national day - The Washington Post", "stance": "pos", "content": "", "translation": "", "uid": "02_00_93", "input": "", "char_offset": "0-3811"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1676704483100420412&wfr=spider&for=pc", "title": "冲击立法会罪名成立，“港独”分子梁颂恒上诉被驳即时入狱", "stance": "neg", "content": "", "translation": "In 2016, \"Hong Kong independence\" activist Leung Chung-hang was dissatisfied with his disqualification as a member. He stormed the Legislative Council with Yau Wai-chen and three other people. He was charged with participating in illegal assembly and was sentenced to four weeks in prison in 2018. He was later released on bail pending appeal.\nAccording to Hong Kong's \"Eastern Net\" news, today (September 2), the Hong Kong High Court rejected Liang Songheng's appeal, and he must be imprisoned immediately to serve his sentence. The judge believed that the conviction was not unsafe and the sentence was not obviously excessive, so he dismissed his appeal application.\nIn 2016, then-Legislative Council members Leung Chung-hang and Yau Wai-chen displayed \"Hong Kong Independence\" slogans and altered their oaths while taking the oath, and were ruled to have lost their qualifications as members. The two are both members of the \"Youth New Deal\", a \"Hong Kong independence\" organization.\nOn November 2 of the same year, he, together with You Huizhen and three assistants, forced their way into the Legislative Council conference room. Leung Chung-hang and Yau Wai-ching were charged with using \"extreme force\" to enter the Legislative Council conference room on the day of the incident, and were involved in the crime of participating in an illegal assembly.\nIn May 2018, Hong Kong's Kowloon City Magistrates' Court convicted Leung Chung-hang and sentenced him to four weeks in prison. Subsequently, Liang Songheng was granted bail and appealed to the Hong Kong High Court, requesting to overturn the conviction and apply for a commutation of sentence. In June this year, the Court of First Instance of the Hong Kong High Court opened a hearing on the case.\nOn September 2, the court officially rejected Liang Songheng’s appeal application, and he was therefore required to serve his sentence in prison immediately. Judge Chan Ka-Shing of the Court of First Instance believed that the conviction by the Kowloon City Magistrates' Court was not unsafe and the sentence was not obviously excessive, so he dismissed his appeal application.\nBarrister Kenneth Kwok, who represents Leung Chung-heng, said he plans to appeal to the Court of Final Appeal.\nIt is worth mentioning that when Leung Chung-hang and Yau Wai-chen were ruled to have lost their membership qualifications in 2016, they had only been in office for 12 days, but they had already received one month's parliamentary salary of about HK$90,000 each, and more than HK$830,000 in advance operating funds.\nThe Administrative Committee of the Hong Kong Legislative Council (AC) filed with the District Court in 2017 and 2018 to recover the above-mentioned amounts from the two people. In May 2020, the Hong Kong court ruled that the two must return a total of approximately NT$1.86 million in salary and advances to the ACAC, and pay the ACAC’s legal fees.\nYou Huizhen's proposal to repay in installments was accepted. She will repay HK$25,000 per month in 48 installments. Liang Songheng still ignored it. On August 18, the Administration Commission filed a petition with the Hong Kong High Court to make Leung Chung Hang bankrupt. \"Eastern Net\" quoted the Legislative Council Secretariat as saying that this is the first time that the ACCM has submitted a bankruptcy petition to an individual.", "uid": "02_06_62", "input": "", "char_offset": "0-768"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wOS8yNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0LXZpb2xlbmNlLWludGwtaG5rL2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDE5LzA5LzI2L2FzaWEvaG9uZy1rb25nLXByb3Rlc3QtdmlvbGVuY2UtaW50bC1obms?oc=5\n", "title": "How a summer of protest pushed young Hong Kongers to the edge | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_165", "input": "", "char_offset": "0-3715"}
{"language": "English", "url": "https://www.chinadaily.com.cn/a/201908/14/WS5d52f04fa310cf3e355658dc.html", "title": "Protesters paralyze airport as HKSAR chief executive appeals for end to violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_154", "input": "", "char_offset": "0-1583"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wOS8yNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0LXZpb2xlbmNlLWludGwtaG5rL2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDE5LzA5LzI2L2FzaWEvaG9uZy1rb25nLXByb3Rlc3QtdmlvbGVuY2UtaW50bC1obms?oc=5\n", "title": "How a summer of protest pushed young Hong Kongers to the edge | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_164", "input": "", "char_offset": "0-1499"}
{"language": "English", "url": "https://www.chinadaily.com.cn/kindle/2019-08/25/content_37505382.htm", "title": "Protests disrupt city's stability and operations", "stance": "neg", "content": "", "translation": "", "uid": "02_06_131", "input": "", "char_offset": "0-2013"}
{"language": "English", "url": "https://www.chinadaily.com.cn/hkedition/2019-08/07/content_37499348.htm", "title": "Non-cooperation campaigns only deepen social divisions", "stance": "neg", "content": "", "translation": "", "uid": "02_06_234", "input": "", "char_offset": "0-2264"}
{"language": "English", "url": "https://www.chinadaily.com.cn/global/2019-08/01/content_37497652.htm", "title": "Preserving HK's bridging role in everyone's interest", "stance": "neg", "content": "", "translation": "", "uid": "02_06_217", "input": "", "char_offset": "0-2077"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/26/c_138337631.htm", "title": "Hong Kong protests turn violent, several policemen injured", "stance": "neg", "content": "", "translation": "", "uid": "02_06_105", "input": "", "char_offset": "0-1914"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm55dGltZXMuY29tL2ludGVyYWN0aXZlLzIwMTkvd29ybGQvYXNpYS9ob25nLWtvbmctcHJvdGVzdHMtYXJjLmh0bWzSAQA?oc=5\n", "title": "Six Months of Hong Kong Protests. How Did We Get Here? - The New York Times", "stance": "pos", "content": "", "translation": "", "uid": "02_00_103", "input": "", "char_offset": "0-1630"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2NoaW5hLWJlaWppbmctaG9uZy1rb25nLWRiNWNiMjdhZjZmYmE2ZWRmNzA2NGU1ZGY4NzRhODg50gEA?oc=5\n", "title": "Timeline: Hong Kong under 25 years of Chinese rule | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_189", "input": "", "char_offset": "0-1797"}
{"language": "Chinese", "url": "https://www.thepaper.cn/newsDetail_forward_1253904", "title": "香港七一游行500余名被捕者悉数获释，有人身藏攻击性武器", "stance": "neg", "content": "", "translation": "The numbers are false and there is a black hand behind it.\n\nThe People's Daily stated that the \"Democratic Front\", which launched the \"July 1\" march in Hong Kong, claimed that the number of people marching this year was more than five times that announced by the police. This shows that the \"Democratic Front\" is crazy about counting (big numbers). The newspaper cited an article by Wen Pingli published by Hong Kong's Wen Wei Po and pointed out that in fact, the police used a scientific and rigorous statistical method to count the number of people in the march, which was well-founded. The opposition insists that this is nothing more than a \"self-fulfilling lie\", telling and directing its own lies. Who else would believe such numbers?\n\nFollow-up: More than 500 demonstrators in Hong Kong have been released\n\nAccording to the People's Daily, the Hong Kong police have released more than 500 arrested demonstrators. The police issued warning notices to 486 people who participated in the \"July 1 Parade\", and 25 others were granted bail pending investigation and reported to the police from late July to early August. The police said that three arrested men aged 18 to 68 were found with screwdrivers, knives or folding knives on their bodies and were arrested on suspicion of \"possession of offensive weapons\", while another 21-year-old woman was arrested on suspicion of \"assaulting a police officer\" .", "uid": "02_06_2", "input": "", "char_offset": "0-340"}
{"language": "English", "url": "http://www.chinadaily.com.cn/global/2019-10/30/content_37519413.htm", "title": "HK protest effects inescapable", "stance": "neg", "content": "", "translation": "", "uid": "02_06_146", "input": "", "char_offset": "0-1384"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2020-06/07/c_139119585.htm", "title": "Hong Kong facing trend of more young people committing crimes since social unrest: commissioner of police", "stance": "neg", "content": "", "translation": "", "uid": "02_06_169", "input": "", "char_offset": "0-1471"}
{"language": "Chinese", "url": "https://www.guancha.cn/local/2014_11_21_301216.shtml", "title": "香港警方再拘4人 冲击立法会暴力分子大起底", "stance": "neg", "content": "", "translation": "The evil consequences caused by the connivance of the pan-people\n\nHong Kong public opinion analysis believes that although the Federation of Students and others severely condemned the \"hot-blooded citizens\" and caused the \"Occupy Movement\" to split, the reason was that they believed that the \"hot-blooded citizens\" were causing chaos and ruining the opposition's major events. According to the opposition's wishful thinking, it was originally planned to arrange for extreme radical groups such as \"Hot-Blooded Citizens\" to establish themselves in Mong Kok and prepare to use violent means to clear the area. The \"occupied area\" in Admiralty needs to maintain the so-called \"peaceful and non-violent\" image in order to encourage the people and students to \"occupy\" it for a long time. The actions of the \"passionate citizens\" essentially tore off the opposition's veil. \"Oriental Daily\" stated that the so-called \"Peaceful Occupy Central\" slogan has gone bankrupt. \"Ta Kung Pao\" stated that although some in the opposition play bad-face and some play white-face, no matter how it is covered up and no matter what cuts are made in response to the backlash of public opinion, \"violence is violence and cannot be separated from it.\"\n\nThe \"Sing Tao Daily\" editorial stated that the increasingly violent actions of radicals were due to the early connivance of the pan-democrats. At the same time, the \"Occupy Operation\" created an environment that facilitated radical actions. Pan-democrats and student organizations simply cannot control this group of people. As long as the \"occupation\" continues, they will be provided with opportunities to cause trouble.", "uid": "02_06_99", "input": "", "char_offset": "0-378"}
{"language": "English", "url": "http://www.chinadaily.com.cn/hkedition/2019-07/08/content_37489027.htm", "title": "The rule of law must prevail in HKSAR", "stance": "neg", "content": "", "translation": "", "uid": "02_06_190", "input": "", "char_offset": "0-710"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiqQFodHRwczovL3d3dy53YXNoaW5ndG9ucG9zdC5jb20vd29ybGQvYXNpYV9wYWNpZmljL3doeS1ob25nLWtvbmctcHJvdGVzdGVycy1yYWdlLW9uLWV2ZW4tdGhvdWdoLXRoZXktY2Fubm90LXdpbi8yMDE5LzA3LzAzLzBjNzM4ODUwLTljZDktMTFlOS04M2UzLTQ1ZmRlZDhlOGQyZV9zdG9yeS5odG1s0gEA?oc=5\n", "title": "Why Hong Kong protesters rage on, even though they cannot win - The Washington Post", "stance": "pos", "content": "", "translation": "", "uid": "02_00_188", "input": "", "char_offset": "0-2212"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1800528655380379273&wfr=spider&for=pc", "title": "香港“35+”非法初选案45人罪成，李家超发声", "stance": "neg", "content": "", "translation": "According to reports from Hong Kong media such as Dakong Wenhui.com and Sing Tao Daily, 47 people were charged with \"conspiracy to subvert state power\" for allegedly organizing and participating in the \"35+ illegal primary elections\" in Hong Kong, and a total of 45 people were convicted. Thirty-one of the defendants pleaded guilty before trial and were awaiting sentencing. On May 30, 14 of the remaining 16 people who did not plead guilty were found guilty.\nAccording to reports, 47 defendants suspected of organizing and participating in the \"35+ illegal primary election case\" conspired to conspire in the 2020 Legislative Council election. After gaining more than half of the seats in the Legislative Council, they planned to veto the financial plan proposed by the SAR government indiscriminately, forcing Hong Kong to The chief executive dissolved the Legislative Council and resigned, and was jointly charged with \"conspiracy to subvert state power.\" Among them, 31 people, including the Hong Kong chaos leader Benny Tai, pleaded guilty before trial and awaited sentencing. The remaining 16 people who did not plead guilty were tried for 118 days.\nOn May 30, the West Kowloon Magistrates' Court ruled that Wu Zhengheng, Zheng Dahong, Yang Xueying, Peng Zhuoqi, He Qiming, Huang Biyun, Shi Delai, He Guilan, Chen Zhiquan, Zou Jiacheng, Lam Zhuoting, Leung Kwok-hung, Ke Yiolin and Yu Huiming were found guilty. Due to insufficient evidence, Liu Weicong and Li Yuxin were found not guilty. The Hong Kong Department of Justice immediately appealed against the two men's acquittal.\nAccording to Article 22 of the Hong Kong National Security Law, once the defendant is convicted, if he is a ringleader or if the crime is serious, he shall be sentenced to life imprisonment or a fixed-term imprisonment of not less than 10 years; active participants shall be sentenced to a fixed-term imprisonment of not less than 3 years but not more than 10 years; other participants shall be sentenced to a fixed-term imprisonment of not less than 3 years but not more than 10 years. Fixed-term imprisonment of not more than 3 years, criminal detention or public surveillance.", "uid": "02_06_55", "input": "", "char_offset": "0-466"}
{"language": "English", "url": "http://www.chinadaily.com.cn/kindle/2019-11/23/content_37524955.htm", "title": "HK protests expose Western media bias", "stance": "neg", "content": "", "translation": "", "uid": "02_06_122", "input": "", "char_offset": "0-1252"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/26/c_138339350_2.htm", "title": "Chinese in Southern California rally against violence in Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_178", "input": "", "char_offset": "0-2778"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-10/03/c_138444842.htm", "title": "Hong Kong society choruses against violence escalation on National Day", "stance": "neg", "content": "", "translation": "", "uid": "02_06_179", "input": "", "char_offset": "0-1561"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDIxLzEwLzE2L3NldmVuLWhvbmcta29uZy1hY3RpdmlzdHMtamFpbGVkLW92ZXItdW5hdXRob3Jpc2VkLXByb3Rlc3QtaW4tMjAyMNIBcGh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAyMS8xMC8xNi9zZXZlbi1ob25nLWtvbmctYWN0aXZpc3RzLWphaWxlZC1vdmVyLXVuYXV0aG9yaXNlZC1wcm90ZXN0LWluLTIwMjA?oc=5\n", "title": "Hong Kong activists jailed for unauthorised protest in 2020 | Hong Kong Protests News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_197", "input": "", "char_offset": "0-2643"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnBicy5vcmcvbmV3c2hvdXIvd29ybGQvcGhvdG9zLWhvbmcta29uZy1wcm90ZXN0b3JzLWJyZWFrLWludG8tbGVnaXNsYXRpdmUtYnVpbGRpbmfSAWJodHRwczovL3d3dy5wYnMub3JnL25ld3Nob3VyL2FtcC93b3JsZC9waG90b3MtaG9uZy1rb25nLXByb3Rlc3RvcnMtYnJlYWstaW50by1sZWdpc2xhdGl2ZS1idWlsZGluZw?oc=5\n", "title": "PHOTOS: Hong Kong protestors break into legislative building | PBS NewsHour", "stance": "pos", "content": "", "translation": "", "uid": "02_00_77", "input": "", "char_offset": "0-3083"}
{"language": "Chinese", "url": "https://www.guancha.cn/local/2017_08_15_422956.shtml", "title": "香港13人冲击立法会一案改判 即时监禁8到13个月", "stance": "neg", "content": "", "translation": "Wan Dehao pointed out that the impact incident in this case damaged the Legislative Council's property, and the maintenance cost amounted to NT$420,000. A security guard was injured when he stopped the demonstrators from moving the iron horses, and suffered a broken toe. The environment was dangerous and it was just \"good luck\" that no one died or that few people were injured. He emphasized that the defendants in this case showed no sincere remorse. After being convicted in the original trial, they admitted to the magistrate that they would not regret what they had done. Some of the defendants even appealed against their convictions. The Department of Justice believes that immediate imprisonment is the only appropriate sentence for each defendant, and the maximum sentence for illegal assembly under summary procedure is three years. He believed the court should consider the sentence at the \"upper middle end\" of the maximum possible sentence.\n\nThe case continued this morning. After both sides made their arguments, the judge finally ruled: Based on the degree of violence in the case and everyone's attitude, the social service order was obviously too light. Starting from 15 months' imprisonment, each defendant was sentenced to 8 to 13 months in prison. moon. The 13 defendants in this case are Liang Xiaoyang, Huang Haoming, Liu Guoliang, Liang Yingli, Lin Langyan, Zhu Weicong, He Jiehong, Zhou Huoran, Yan Minhua, Zhao Xiancong, Guo Yaochang, Huang Yuanyuan and Chen Baishan. Except Huang Yuan Yuan, who pleaded guilty, was sentenced to 8 months, the others were sentenced to 13 months. The court also issued an arrest warrant for the absent defendant Zhao Xiancong.\nDuring this morning's court hearing, Zhu Weicong, Zhou Huoran and Chen Baishan did not hire lawyers to represent them. In their speeches, Zhu and Tuesday expressed regret for the excessive behavior and the injured security personnel that day. But at the same time, Zhu Weicong said that he \"will not regret it\", while Zhou Huoran said that \"I did nothing wrong.\"\n\nToday, Dagong.com also published a comment titled \"'Social Service' Is Unreasonable and Reviews the Legal Principles\". The article pointed out that this case has set an unprecedented precedent in Hong Kong in terms of violent demonstrations and protests and attacks on public security. Its serious nature and impact are unprecedented. Social service orders are “unprecedented.” Violent attacks can be \"socialized\", which is unjust; if the Department of Justice's review fails, it is unreasonable.", "uid": "02_06_92", "input": "", "char_offset": "0-613"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/26/c_138340056.htm", "title": "Commentary: Call Hong Kong police who they are: heroes of Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_145", "input": "", "char_offset": "0-2002"}
{"language": "Chinese", "url": "https://finance.ifeng.com/a/20160704/14557056_0.shtml", "title": "香港激进反对派“七一游行”后内讧 成员挑衅互殴", "stance": "neg", "content": "", "translation": "According to reports from Sing Tao Daily and Ta Kung Pao, more than a hundred people including the \"Social Democratic League\" marched to Government House without applying for a no-objection notice and clashed with the police. The police once fired pepper spray to disperse the demonstrators. The demonstrators dispersed one after another, and some of them walked to the Court of Final Appeal, but violent clashes broke out with the CUHK Student Union.\n\nThe \"Social Democratic League\" decided to end the march at that time, but some members of the CUHK Student Union came forward to question why they did not block the road. The chairman of the \"Social Democratic League\" Wu Wenyuan said at the time that they would not stop the other party from blocking the road. Afterwards, Zhou Shufeng suddenly shouted: \"You just What are you doing with your feet? You kicked me head first!\" Community citizen Lian Chen Dezhang immediately yelled, \"You are eating shit! You are so angry, Zhou Shufeng!\" Later, members of the CUHK Student Union left the scene.", "uid": "02_06_15", "input": "", "char_offset": "0-243"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1714688125201271570&wfr=spider&for=pc", "title": "乱港头目认罪，反华机构要撤出香港∣香港一日", "stance": "neg", "content": "", "translation": "Former \"Democratic Front\" convener pleads guilty to participating in illegal demonstrations\nChen Haohuan, a Hong Kong rioter and former convenor of the Hong Kong chaos organization \"Democratic Front\", was previously accused by the police of participating in an illegal demonstration on Hong Kong Island on September 15, 2019. He was charged with \"knowingly participating in an unauthorized assembly\". Today (26th) ) pleaded guilty at the Eastern Magistrates' Court.\nAccording to the case, the Hong Kong pro-democracy organization \"Democratic Front\", which announced its disbandment on August 13 this year, applied to hold a parade in Causeway Bay at 3 pm on September 15 of that year near the Chater Road pedestrian area in Central, but the police opposed it. Chen Haohuan later stated through social networking sites that he would go to Causeway Bay to participate in the rally in his personal capacity, and incited the crowd: \"Let's all gather at East Point Road at 2:30 and march to the finish line together,\" claiming \"I have the right to demonstrate\" and \"No police approval is required.\" , and said he was ready to be arrested and was not afraid of going to jail. It is worth noting that this does not allow Chen Haohuan to deny it. In several videos played by the prosecution in court, Chen Haohuan, who was wearing a T-shirt with the word \"Hong Kong Independence\", said exactly this when being interviewed.\nPreviously, Chen Haohuan, former Democratic Party chairmen Wu Chi-wai and Leung Kwok-hung were accused of holding a press conference outside the Court of Final Appeal last year after the police opposed the \"July 1\" march application, calling on the public to participate in the march, and were accused of inciting the organization and participation. Chen pleaded guilty in the District Court on October 7 to three charges including unauthorized assembly and was sentenced to 12 months in prison.\nLooking back on what Chen Haohuan said back then, and now that he is finally in jail, is it considered that he got what he wanted?", "uid": "02_06_31", "input": "", "char_offset": "0-473"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/201911/13/WS5dcba402a310cf3e355771bf.html", "title": "More traffic disruptions after chaotic night in Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_143", "input": "", "char_offset": "0-2412"}
{"language": "English", "url": "https://www.chinadaily.com.cn/a/201908/22/WS5d5dc96aa310cf3e35567288.html", "title": "Peer influence among factors blamed in HK", "stance": "neg", "content": "", "translation": "", "uid": "02_06_209", "input": "", "char_offset": "0-1638"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMTkvMDcvMDEvZnJlc2gtaG9uZy1rb25nLXByb3Rlc3RzLXRvLW1hcmstMjIteWVhcnMtc2luY2UtaGFuZG92ZXItdG8tY2hpbmEuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDE5LzA3LzAxL2ZyZXNoLWhvbmcta29uZy1wcm90ZXN0cy10by1tYXJrLTIyLXllYXJzLXNpbmNlLWhhbmRvdmVyLXRvLWNoaW5hLmh0bWw?oc=5\n", "title": "Hong Kong protesters smash windows and storm the legislature", "stance": "pos", "content": "", "translation": "", "uid": "02_00_81", "input": "", "char_offset": "0-2149"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDE5LzcvMy9ob25nLWtvbmctcHJvdGVzdHMtYWxsLXRoZS1sYXRlc3QtdXBkYXRlc9IBVWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAxOS83LzMvaG9uZy1rb25nLXByb3Rlc3RzLWFsbC10aGUtbGF0ZXN0LXVwZGF0ZXM?oc=5\n", "title": "Hong Kong protests: All the latest updates | Hong Kong Protests News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_124", "input": "", "char_offset": "0-1435"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1789663722365847446&wfr=spider&for=pc", "title": "乱港艺人王宗尧暴动罪成 涉嫌冲击香港立法会大楼", "stance": "neg", "content": "", "translation": "According to Hong Kong Sing Tao Network, on July 1, 2019, demonstrators continued to attack the Hong Kong Legislative Council building and then broke into the conference hall. The people involved included Hong Kong artist Wang Zongyao and other 6 people. After a trial, Deputy Judge Li Zhihao of the Hong Kong District Court today (1st) ruled that Wang Zongyao was guilty of rioting. He also admitted earlier that he entered the conference hall and would plead for mercy later.\nThe six defendants were charged with participating in riots with others in and around the Legislative Council Complex on or about July 1, 2019; Wang Zongyao and Wu Zhiyong had earlier pleaded guilty to one count each of \"entering or remaining in the conference hall area\" .", "uid": "02_06_60", "input": "", "char_offset": "0-186"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vaG9uZ2tvbmdmcC5jb20vMjAyMi8wNy8wMi90aW1lbGluZS1ob25nLWtvbmdzLWp1bHktMS1jYXJuaXZhbC1vZi1kaXNzZW50LWhvdy0xNy15ZWFycy1vZi1wcm90ZXN0LWRlbWFuZHMtZmVsbC1zaWxlbnQv0gEA?oc=5\n", "title": "Timeline: Hong Kong's July 1 carnival of dissent - how 17 years of protest demands fell silent | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_51", "input": "", "char_offset": "0-2055"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wOS8yNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0LXZpb2xlbmNlLWludGwtaG5rL2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDE5LzA5LzI2L2FzaWEvaG9uZy1rb25nLXByb3Rlc3QtdmlvbGVuY2UtaW50bC1obms?oc=5\n", "title": "How a summer of protest pushed young Hong Kongers to the edge | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_159", "input": "", "char_offset": "0-1781"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lmhydy5vcmcvbmV3cy8yMDIwLzA3LzI5L2NoaW5hLW5ldy1ob25nLWtvbmctbGF3LXJvYWRtYXAtcmVwcmVzc2lvbtIBAA?oc=5\n", "title": "China: New Hong Kong Law a Roadmap for Repression | Human Rights Watch", "stance": "pos", "content": "", "translation": "", "uid": "02_00_66", "input": "", "char_offset": "0-2163"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1638134619942537283&wfr=spider&for=pc", "title": "港媒接到录音曝料，“冲击立法会”给5000港元", "stance": "neg", "content": "", "translation": "Suspected \"Hong Kong independence\" instigated violent individuals to steal voter information\n\"Ta Kung Pao\" also revealed that at the scene of the violent incident in the Hong Kong Legislative Council Building on July 1, a person who took off his mask and \"swore an oath\" was caught on camera. He was suspected to be \"Hong Kong independence activist\" Liang Jiping. In 2015, he was named by the then Chief Executive of the SAR, Leung Chun-ying, to call on society to be wary of \"Hong Kong independence\".\nEarlier, \"Wen Wei Po\" reported that among the 13 people arrested by the Hong Kong police in connection with the \"attack on the Legislative Council\" on July 1, there was another \"Hong Kong independence activist\" Pan Yuntang who had participated in the \"Occupy Central\" movement.\nThere is also Yang Yilang, who participated in the \"Occupy Central\" movement and is suspected to be at the Legislative Council on July 1. \"Ta Kung Pao\" quoted another recording circulated on the Internet, saying that the voice of a man calling himself \"Yang Yilang\" in the recording was similar to Yang Yilang himself.\nIt is worth mentioning that Yang Langyi was sentenced to 2 years in prison for setting fire outside the Hong Kong Legislative Council building in 2015.\nThe man in the recording shouted on the spot and instigated violent demonstrators to rush into the office of a member of the Democratic Alliance for the Betterment of Hong Kong (DAB) on the sixth floor of the Legislative Council, trying to steal the DAB's \"voter registration information\" and threatening to \" I take all responsibility.”\nChairman of the Democratic Alliance for the Betterment of Hong Kong (DAB) Lee Wai-king has publicly expressed her support for amending the Fugitive Offenders Ordinance on many occasions, and went to the U.S. Consulate General in Hong Kong to petition on the afternoon of June 12, strongly opposing U.S. interference in China’s internal affairs. The Democratic Alliance for the Betterment of Hong Kong (DAB) stated that this amendment is a matter of the Hong Kong Special Administrative Region and does not allow any external forces to interfere in the internal affairs of the Hong Kong Special Administrative Region.\n\"Dagong.com\" revealed that on July 1, only the lobby, first-floor conference hall and second-floor conference room of the Legislative Council building were damaged, while the offices of members on the sixth floor were not affected. DAB Chairman Li Huiqiong said that the Legislative Council Secretariat is currently handling the matter.", "uid": "02_06_65", "input": "", "char_offset": "0-551"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vaG9uZ2tvbmdmcC5jb20vMjAyMi8wNy8wMi90aW1lbGluZS1ob25nLWtvbmdzLWp1bHktMS1jYXJuaXZhbC1vZi1kaXNzZW50LWhvdy0xNy15ZWFycy1vZi1wcm90ZXN0LWRlbWFuZHMtZmVsbC1zaWxlbnQv0gEA?oc=5\n", "title": "Timeline: Hong Kong's July 1 carnival of dissent - how 17 years of protest demands fell silent | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_52", "input": "", "char_offset": "0-1754"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy93b3JsZC1hc2lhLWNoaW5hLTUyNzY1ODM40gE2aHR0cHM6Ly93d3cuYmJjLmNvbS9uZXdzL3dvcmxkLWFzaWEtY2hpbmEtNTI3NjU4MzguYW1w?oc=5\n", "title": "Hong Kong national security law: What is it and is it worrying?", "stance": "pos", "content": "", "translation": "", "uid": "02_00_2", "input": "", "char_offset": "0-1581"}
{"language": "Chinese", "url": "https://finance.ifeng.com/a/20160704/14557056_0.shtml", "title": "香港激进反对派“七一游行”后内讧 成员挑衅互殴", "stance": "neg", "content": "", "translation": "The CUHK Student Union and Zhou Shufeng later issued a statement on social networking sites condemning the \"Social Democratic League\", saying that Zhou was surrounded and abused by many people from the Social Democratic League. Related people from the \"Social Democratic League\" even kicked Zhou Shufeng, and also accused Zhou of being He was chased, punched and kicked, and his backpack was torn. It was also said that someone tried to push the student union officer into the pool. The \"Social Democratic League\" issued a statement on social networking sites to counterattack, saying that the accusations were seriously untrue and that they would not tolerate the provocative and slanderous behavior of the troublemakers. The \"Social Democratic League\" also questioned that the CUHK Student Union originally called on the masses to attend the \"Black Bloc\" operation of the Liaison Office of the Central Committee of the Communist Party of China initiated by the local faction. \"Why did Zhou Shufeng suddenly show up at the peaceful demonstration in Central and actively provoke the police who had just been pepper-sprayed?\" The protesters and members of the Social Democratic Union who attacked?”\n\nThe \"Black Bloc\" operation of the Liaison Office of the Central People's Government was initiated by the \"Youth New Deal\", \"Indigenous Democracy Front\" and others, but ultimately failed to hold a successful rally. Some analysts said that the Hong Kong opposition is already full of internal conflicts, and it is not surprising that the siege occurred.", "uid": "02_06_16", "input": "", "char_offset": "0-314"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1604946945039276909&wfr=spider&for=pc", "title": "今年“七一”香港发生重大变化，令西方媒体哀嚎不已", "stance": "neg", "content": "", "translation": "In the past two days, many Western media have reported on the participation of Hong Kong independence elements in the \"July 1\" parade organized by the Hong Kong opposition and anti-mainland forces.\nHowever, a change in this year's parade made these Western media feel very \"depressed\"...\n\"Hong Kong's annual march has hit a record low in participation this year,\" British Reuters wrote in its report.\nThe British media also said that although the organizers of the event said that there were 50,000 people marching this year, the police said that the number was 9,800. Both parties also stated that the participants in this march were the largest in the history of this march that began in 2003. The lowest time.\nThe British BBC also reported this situation with the title \"Hong Kong Parade Hits New Low\". However, this British media, which loves BB Hong Kong the most, attributed the reason to the fact that \"a number of well-known democrats have been imprisoned by the government in the past year.\"\nHowever, data from the Hong Kong police and third parties show that the number of people participating in Hong Kong's \"July 1\" demonstrations has been declining over the past four years. Among them, the number of participants in 2015 had already reached a record low at that time - at that time, those \"democrats\" who disrupted the rule of law in Hong Kong, incited confrontation between Hong Kong and the mainland, and even incited Hong Kong independence had not yet been punished by law.\nAnd every year after 2015, the number of participants in the parade has continued to set new \"historically low\" records.\nTherefore, from the data point of view, the continuous decrease in the number of people in Hong Kong's \"July 1\" demonstrations is more indicative that in addition to the anti-mainland and even anti-China forces in Hong Kong and foreign countries, the Hong Kong people are losing interest in this demonstration that is becoming increasingly paranoid and constantly creating social confrontation and hatred. interest.", "uid": "02_06_8", "input": "", "char_offset": "0-519"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1666105065670489802&wfr=spider&for=pc", "title": "香港修例风波回望：当青年被绑上暴力战车", "stance": "neg", "content": "", "translation": "On September 22, 2019, parents participated in the \"Anti-Violence, Protect Schools\" rally in Chater Garden, Hong Kong.\n\"Actually, where is there any 'illegal means' in Hong Kong today? For those politicians who are packaged and supported by external forces, the real meaning of this word is 'illegal means'.\" A political commentator said explain.\nThe manipulators and \"political stars\" behind the scenes are protected by unscrupulous lawyers, who help them avoid legal restrictions in every possible way, and are also provided with various political benefits and financial gifts from foreign forces. But those young people who are not deeply involved in the world are getting behind bars, tears, and their futures are ruined. The psychological torture may stay with many people for their entire lives.\nThe Commissioner of Police of the SAR Government, Tang Bingqiang, pointed out that some violent incidents during the anti-amendment demonstrations essentially contained behavioral elements of \"domestic terrorism\". However, instead of condemning it, some people in society \"heroicize\" and \"romanticize\" violent acts, pushing others to commit crimes while enjoying political dividends themselves.\nLeung Chun-ying, Vice Chairman of the National Committee of the Chinese People's Political Consultative Conference and former Chief Executive of the Hong Kong Special Administrative Region, pointedly pointed out that young people are misled by the \"big platform\" (organizations and manipulators), and only after being arrested do they know that they have become \"cannon fodder\", while \"violating the law and upholding justice\" has always been just a political scam. .", "uid": "02_06_52", "input": "", "char_offset": "0-392"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lmhydy5vcmcvbmV3cy8yMDIwLzA3LzI5L2NoaW5hLW5ldy1ob25nLWtvbmctbGF3LXJvYWRtYXAtcmVwcmVzc2lvbtIBAA?oc=5\n", "title": "China: New Hong Kong Law a Roadmap for Repression | Human Rights Watch", "stance": "pos", "content": "", "translation": "", "uid": "02_00_65", "input": "", "char_offset": "0-2153"}
{"language": "English", "url": "https://www.chinadaily.com.cn/a/201908/14/WS5d52f04fa310cf3e355658dc.html", "title": "Protesters paralyze airport as HKSAR chief executive appeals for end to violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_155", "input": "", "char_offset": "0-1451"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDE5LzA3LzAxL3doeS1ob25nLWtvbmctaGFzLWJlY29tZS1jaXR5LXByb3Rlc3RzL9IBAA?oc=5\n", "title": "Why are people in Hong Kong protesting? - The Washington Post", "stance": "pos", "content": "", "translation": "", "uid": "02_00_213", "input": "", "char_offset": "0-3316"}
{"language": "English", "url": "http://www.chinadaily.com.cn/hkedition/2019-07/08/content_37489027.htm", "title": "The rule of law must prevail in HKSAR", "stance": "neg", "content": "", "translation": "", "uid": "02_06_191", "input": "", "char_offset": "0-1266"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/11/c_138299437.htm", "title": "Xinhua Headlines: Hong Kong people express support for police, calling for end to violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_200", "input": "", "char_offset": "0-1047"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1638089933687566947&wfr=spider&for=pc", "title": "香港各界痛批冲击立法会暴行：打着民主旗号破坏法治", "stance": "neg", "content": "", "translation": "In addition, according to a report by Hong Kong's \"Oriental Daily\" on July 3, the Legislative Council building was damaged by demonstrators. All walks of life severely condemned the incident and called on Hong Kong people to resist any violation of law and order.\nThe Hong Kong Federation of Guangdong Associations issued a position statement, saying it was shocked by the protesters' attack and destruction of the Legislative Council building. Deng Qinghe, the association's first executive chairman, described the incident as the most serious violent incident since the handover, undermining the rule of law on which Hong Kong relies for stability. We strongly demand that the police investigate violent acts committed by demonstrators in accordance with the law, and firmly support the government and the police in enforcing the law.\nGong Junlong, chairman of the association, said that Western countries, led by the United States, have been supporting the demonstrators financially and politically, and reiterated that this was definitely a violent incident.\nThe Hong Kong General Chamber of Commerce pointed out that citizens have the right to express their personal opinions, but under any circumstances, violence will never be tolerated and the rule of law must be respected and upheld. The Chinese Manufacturers' Association of Hong Kong also issued a statement strongly condemning the demonstrators' violent attack on the Legislative Council.\nAccording to a report by Hong Kong's Sing Tao Daily on July 3, four police staff representatives met with the media on the 2nd regarding the destruction of the Legislative Council building by demonstrators. Lam Chi-wai, chairman of the Hong Kong Police Junior Officers Association, criticized some people who undermined the rule of law in the name of democracy.\nAccording to reports, the Superintendents’ Association, the Police Inspectors’ Association, the Overseas Inspectors’ Association and the Police Junior Officers’ Association also issued a joint statement condemning the demonstrators who broke into and damaged the Legislative Council building the day before yesterday. Representatives of four police staff also met with the media. Lin Zhiwei said that the association urged the management to \"do all they can to arrest the rioters and bring them to justice.\"\nThe report pointed out that Chen Mingde, chairman of the Police Superintendents Association, stressed that measures would be taken to deal with relevant behaviors. Ng Wai-kee, chairman of the Local Inspectorate, emphasized that the demonstrators would pay a heavy price. He condemned the demonstrators in the strongest terms for openly challenging the rule of law. He denounced some people who undermined the rule of law in the name of democracy. \"Hong Kong history will evaluate their actions.\"", "uid": "02_06_72", "input": "", "char_offset": "0-575"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy93b3JsZC1hc2lhLWNoaW5hLTUzOTQyMjk10gE2aHR0cHM6Ly93d3cuYmJjLmNvbS9uZXdzL3dvcmxkLWFzaWEtY2hpbmEtNTM5NDIyOTUuYW1w?oc=5\n", "title": "Hong Kong protests: The flashpoints in a year of anger", "stance": "pos", "content": "", "translation": "", "uid": "02_00_85", "input": "", "char_offset": "0-1552"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wNy8wMS9hc2lhL2hvbmcta29uZy1qdWx5LTEtcHJvdGVzdC1leHRyYWRpdGlvbi1pbnRsLWhuay9pbmRleC5odG1s0gFVaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAxOS8wNy8wMS9hc2lhL2hvbmcta29uZy1qdWx5LTEtcHJvdGVzdC1leHRyYWRpdGlvbi1pbnRsLWhuaw?oc=5\n", "title": "Hong Kong protests: Carrie Lam responds to protestor takeover | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_57", "input": "", "char_offset": "0-2845"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vaHViLmpodS5lZHUvMjAyMC8wNy8wNC9ob25nLWtvbmctc2VjdXJpdHktbGF3L9IBAA?oc=5\n", "title": "An end to Hong Kong as we know it? | Hub", "stance": "pos", "content": "", "translation": "", "uid": "02_00_203", "input": "", "char_offset": "0-2526"}
{"language": "Chinese", "url": "https://www.chinanews.com/ga/2014/11-21/6801515.shtml", "title": "暴徒冲击香港立法会大楼：11人被拘捕6人法院提堂", "stance": "neg", "content": "", "translation": "Hong Kong's illegal \"Occupy Central\" movement lasted for 53 days. In the early morning of November 19, a group of radical demonstrators launched a violent attack and smashed the glass of the SAR Legislative Council building with iron fences and cement bricks. The picture shows demonstrators blocking the police.\nChina News Service, Hong Kong, November 21 (Xinhua) After thugs stormed the Legislative Council building of the Hong Kong Special Administrative Region, another person was arrested on the 21st, bringing the number of arrests to 11 so far. Among them, six people were charged and appeared in court at the Eastern District Magistrates' Court on the 21st.\n\nIn the early morning of the 19th, radical demonstrators wearing helmets, goggles, masks, and masks violently attacked the Legislative Council building multiple times with iron fences, bricks, drain covers, trash cans, etc. The building was damaged in many places, with glass broken and brick walls broken. The rioters also tried to prevent the police from enforcing the law and provoked the police officers. Three police officers were injured. The Hong Kong SAR government, members of the Legislative Council, and various political groups have condemned the rioters' actions. The police launched a comprehensive investigation and people were arrested one after another.\n\nInformation provided by the police shows that the 11 people arrested so far, ranging in age from 17 to 54, were suspected of \"criminal damage\", \"assaulting a police officer\", \"accessing computers with criminal or dishonest intent\", and \"illegal assembly\" \". Six of them were escorted by police vehicles to the Eastern District Magistrates' Court on the 21st and were charged with \"criminal damage\" and \"assaulting a police officer\" respectively.\n\nWhile the police continue to investigate the case of rioters attacking the Legislative Council building, Hong Kong's illegal \"Occupy Central\" has lasted for 55 days. Demonstrators who held illegal gatherings in Admiralty and Mong Kok continued to occupy traffic arteries. In the early morning of the 19th, demonstrators even blocked the police from going to the Legislative Council building to stop the mob from attacking.\n\nMost members of the Hong Kong SAR Legislative Council believe that the so-called \"peaceful Occupy Central\" movement has completely gone bankrupt. The reason for this situation is that the occupiers continued to occupy the road against public opinion and were unwilling to end the occupation. In addition, the organizers of the action and some politicians who supported the action distorted the concept of the rule of law and spread the fallacy that there is no need to abide by the law. Occupy actions are exactly the same as violent attacks on the Legislative Council, which undermine the essence of the rule of law.", "uid": "02_06_95", "input": "", "char_offset": "0-628"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNubi5jb20vMjAyMS8wNi8yOS9hc2lhL2hvbmcta29uZy1uc2wtb25lLXllYXItaW50bC1obmstZHN0L2luZGV4Lmh0bWzSAUtodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDIxLzA2LzI5L2FzaWEvaG9uZy1rb25nLW5zbC1vbmUteWVhci1pbnRsLWhuay1kc3Q?oc=5\n", "title": "Hong Kong: One year after China passed the national security law, residents feel Beijing’s tightening grip | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_157", "input": "", "char_offset": "0-2029"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/28/c_138344686.htm", "title": "Interview: Radical protesters responsible for violence in Hong Kong, expert says", "stance": "neg", "content": "", "translation": "", "uid": "02_06_162", "input": "", "char_offset": "0-1119"}
{"language": "Chinese", "url": "https://www.guancha.cn/local/2014_11_21_301216.shtml", "title": "香港警方再拘4人 冲击立法会暴力分子大起底", "stance": "neg", "content": "", "translation": "The 4 arrested were from “passionate citizens”\n\nAccording to a report by Hong Kong's \"Wen Wei Po\" on the 20th, the police arrested 6 demonstrators who participated in the smash-up on the 19th. Although 4 of them did not admit which group they belonged to, various investigations showed that they often participated in activities organized by \"Hot-Blooded Citizens\" and should is its member. Among them, the person wearing red clothes and taking the lead in smashing the glass door of the Legislative Council with an iron horse was the host of the \"Hot Blood Times\" who participated in the Mong Kok street forum earlier and was nicknamed \"The French Guy\". According to the report, as early as the beginning of this month, the \"passionate citizens\" were actively planning to \"do a major event that would attract the attention of the whole Hong Kong.\" They stormed the Legislative Council this time because they were unwilling to accept that Mong Kok was about to be cleared, so they went to Admiralty to cause trouble and will The escalation of actions is to arouse public attention on the one hand; on the other hand, it is reaching out to the \"occupied area\" of Admiralty in an attempt to expand its territory. \"Oriental Daily\" stated that members of the \"Hot-Blooded Citizen\" are known as the \"Mask Party\" because they often wear masks in action. The six people arrested were between the ages of 18 and 24. Five of them were cynical young people with low education and addicted to the Internet. One of them had a criminal record for having sex with an underage girl, and the others had no criminal record.\n\n\"Hot-Blooded Citizens\" is an extremely radical group of the Hong Kong opposition. Its founders are pan-democratic Legislative Council member Huang Yu-min (observer website note: has caused incidents such as \"throwing a cup at the Chief Executive\"), Huang Yangda and his wife Chen Xiuhui, etc. They operate the \"Hot Blood Times\" website, online channels and publications, and at the same time host and co-organize a number of \"social activities\" throughout Hong Kong, attracting many \"double losers\" and unemployed people to join. Instigated by Huang Yumin and Huang Yangda, although there are not many of them, it is said that more than 300 people have participated in the \"occupation\" operations in various districts, but they have always played a role in directly confronting the police and instigating violent incidents. Dozens of them are \"death squads\" and \"Stormtrooper\" members generally prepare helmets, goggles, masks, pointed umbrellas, gloves and other equipment. When the \"Occupy Central\" movement broke out on September 28, Huang Yangda stood on a ladder and encouraged demonstrators to continuously attack the police defense line, becoming one of the most active troublemakers at the scene. Although Huang Yangta claimed that he acted independently and had no contact with the Federation of Students, Scholar Thought and the \"Three Ugly Occupy Central\" groups, they coordinated in early October, and the \"passionate citizens\" were mainly responsible for Mong Kok. After the police successfully cleared some roadblocks on Nathan Road in the early morning of October 17, \"hot-blooded citizens\" formed a \"frontline stormtrooper team\" and attacked the police that night and at midnight on the 18th. Afterwards, they instigated many violent incidents, making Mong Kok a The most dangerous place in Hong Kong.", "uid": "02_06_97", "input": "", "char_offset": "0-791"}
{"language": "Chinese", "url": "https://www.thepaper.cn/newsDetail_forward_1253787", "title": "香港“七一游行”凌晨清场，警方共拘捕511名滋事者", "stance": "neg", "content": "", "translation": "The police said the force used in the clearance was appropriate and necessary\n\n        As for some of the arrested persons, Chief Superintendent of the Public Relations Division of the Hong Kong Police, Hui Chun-tak, said that the police may not necessarily prosecute immediately, but will handle them according to established procedures, depending on the nature of the case and the evidence available to the police. He said that the force used by the police during the clearance operation was appropriate and necessary.\n\n        He said that the police had repeatedly advised and warned the protesters, but the demonstrators still refused to leave. The police officers at the scene had no choice but to use appropriate and necessary force. The police expressed regret for their uncooperative attitude and illegal behavior.\n\n        Some demonstrators were taken to Wong Chuk Hang Police College. After registering their personal information, they were taken to Welfare Road in Wong Chuk Hang by tour buses in batches, and then left on their own.\n\n        The demonstrator who was allowed to leave said that the police did not record a statement and did not need to pay bail. He said that he only received a \"warning notice\" issued by the police, stating that they were arrested for participating in unauthorized assemblies and causing obstruction to public places. He was temporarily released with the possibility of future prosecution.", "uid": "02_06_4", "input": "", "char_offset": "0-344"}
{"language": "English", "url": "https://www.dw.com/en/hong-kong-12-sentenced-for-storming-legislature-in-2019/a-68589722?utm_source=ground.news&utm_medium=referral", "title": "Hong Kong: 12 sentenced for storming legislature in 2019", "stance": "neutral", "content": "", "translation": "", "uid": "02_09_1", "input": "", "char_offset": "0-1871"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/21/c_138324268.htm", "title": "Xinhua Headlines: How external forces have inflamed tensions in Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_221", "input": "", "char_offset": "0-1290"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/14/c_138309095.htm", "title": "Feature: Hong Kong residents visit injured reporter, call for end of violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_152", "input": "", "char_offset": "0-2199"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wNy8wMi9hc2lhL2hvbmcta29uZy1wcm90ZXN0cy1hbmdlci1pbnRsL2luZGV4Lmh0bWzSAUVodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDE5LzA3LzAyL2FzaWEvaG9uZy1rb25nLXByb3Rlc3RzLWFuZ2VyLWludGw?oc=5\n", "title": "Hong Kong’s democracy movement was about hope. These protests are driven by desperation | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_122", "input": "", "char_offset": "0-2625"}
{"language": "English", "url": "https://www.chinadaily.com.cn/a/201908/18/WS5d58f7efa310cf3e355665d7_2.html", "title": "How violence has disrupted Hong Kong over last 2 months", "stance": "neg", "content": "", "translation": "", "uid": "02_06_112", "input": "", "char_offset": "0-1820"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDE5LzcvMy9ob25nLWtvbmctcHJvdGVzdHMtYWxsLXRoZS1sYXRlc3QtdXBkYXRlc9IBVWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAxOS83LzMvaG9uZy1rb25nLXByb3Rlc3RzLWFsbC10aGUtbGF0ZXN0LXVwZGF0ZXM?oc=5\n", "title": "Hong Kong protests: All the latest updates | Hong Kong Protests News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_137", "input": "", "char_offset": "0-2191"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_16", "input": "", "char_offset": "0-325"}
{"language": "English", "url": "https://www.chinadaily.com.cn/global/2019-07/03/content_37487390.htm", "title": "Manipulated protests harming Hong Kong", "stance": "neg", "content": "", "translation": "", "uid": "02_06_184", "input": "", "char_offset": "0-988"}
{"language": "Chinese", "url": "https://world.huanqiu.com/article/44L8ry2e53p", "title": "惊讶！BBC抢先报道乱港组织解散，把“称XXXXX”发出来了！", "stance": "neg", "content": "", "translation": "The BBC has repeatedly published unfair, unobjective, and irresponsible reports. Recently, the BBC reported that institutional research showed that hundreds of fake accounts on social media are promoting narratives that are favorable to China and discrediting opponents of the Chinese government. The Chinese Embassy in the UK responded by saying that we advise the BBC and relevant institutions to cherish their own image and credibility, stop malicious slander against China, and abide by the principles of objective, truthful and accurate news reporting. Otherwise, you will encounter opposition and resistance from more people.\n\nAs for the \"Democratic Front\", it was established in 2002. It initially carried out opposition activities against the legislation of Article 23 of the Basic Law. After the \"July 1\" march in 2003, it gradually became a joint platform for the opposition, gathering almost all the opposition parties. member. During the 2019 \"revision disturbance\", the \"Democratic Front\" instigated demonstrations, and thugs stormed the SAR government headquarters, surrounded the Legislative Council, and set fire to more than 10 locations on Hong Kong Island. A march initiated by the Democratic Front from Tsim Sha Tsui to West Kowloon Station also turned into a riot in Kowloon.\n\nSome Hong Kong media revealed that the Democratic Front has been colluding with foreign forces to undermine the administration of the SAR government. In April 2013, the National Endowment for Democracy (NED) and others held the \"Eighth Ethnic Youth Leaders Training Camp\" in Taipei. Among those invited to participate was the then convener of the Democratic Front, Yang Zhengxian. In 2019, the Democratic Front wrote to 61 foreign consulates general in Hong Kong and the European Union Office in Hong Kong and Macao, inciting countries to issue travel warnings against Hong Kong and openly slandering \"one country, two systems.\" In December 2020, the Democratic Front, together with 26 groups including the Stake Alliance, wrote to the United Nations High Commissioner for Human Rights, requesting the United Nations to investigate multiple cases of so-called \"torture.\"\n\nAccording to a report by Oriental Daily on the 12th, in June 2019, the Democratic Front had 48 member groups, but now only 8 remain. In early March this year, some foreign media claimed that the Democratic Front was being investigated for violating the national security law and might soon be banned by the SAR government. Soon, members of many groups withdrew from the \"Democratic Front\" one after another, including street workers, the Association for Democracy, the Civic Party, the Democratic Party, etc.\n\nHong Kong Police Commissioner Xiao Zeyi said on the 12th that he would investigate whether the \"Democratic Front\" is suspected of violating Hong Kong's national security law. He revealed that the police have been collecting evidence and will take action against illegal organizations in accordance with the law at any time. He emphasized that offenders should not think that they can \"escape\" by disbanding.", "uid": "02_06_20", "input": "", "char_offset": "0-744"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy0xMTIyMDkyOTRlNDgxODJjMzM2YmNhODViNDIxN2U1NNIBAA?oc=5\n", "title": "AP PHOTOS: The rise and fall of Hong Kong's July 1 protests | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_22", "input": "", "char_offset": "0-457"}
{"language": "Chinese", "url": "https://wenhui.whb.cn/third/baidu/201907/19/278019.html", "title": "部分冲击香港立法会的暴徒已躲至台湾！前特首质问：他们为啥急着出逃？", "stance": "neg", "content": "", "translation": "More than 30 rioters who stormed the Hong Kong Legislative Council on July 1 and wreaked havoc have fled to Taiwan to escape!\n\nSome members of the Legislative Council pointed out that this group of thugs was able to obtain \"assistance\" from the Taiwan authorities in a short period of time, proving that some of the Hong Kong opposition and illegal demonstrators are indeed connected with overseas political forces.\nAccording to a report by Hong Kong media \"Ta Kung Pao\" on the 19th, according to internal reports from the opposition, more than 30 thugs who forced their way into the Legislative Council on July 1 and wreaked havoc have fled to Taiwan and have contacted relevant agencies of the Taiwan authorities. It is reported that most of the escaped thugs are students, some are seeking \"asylum\", and some are planning to study in Taiwan to extend their stay.\n\nAccording to Global Network, Tsai Ing-wen has previously said that if illegal demonstrators in Hong Kong seek \"political asylum,\" Taiwan will deal with them appropriately and in a humane manner. At the press conference of the Ministry of Foreign Affairs held on the 19th, spokesman Geng Shuang responded: \"I advise some people on the island not to jump out and pretend to be compassionate at this time. They themselves are just clay Buddhas.\"\n\nIn fact, after the violent attack on the Legislative Council on July 1, relevant posts were posted online, claiming that illegal demonstrators who participated in the violent attack had left Hong Kong by plane that night. Later reports pointed out that Liang Jiping, a \"Hong Kong independence\" element who incited others to stay behind and advocated \"dropping the charges against the protesters\" that day, had booked his flight tickets in advance and flew to Taipei the next day.\n\nIn addition, after the destruction of the Legislative Council, a number of posts appeared on Hong Kong social media instructing illegal demonstrators how to seek \"asylum\" in Taiwan.\n\nIn this regard, Hong Kong Democratic Alliance for the Betterment of Hong Kong Legislative Council member Ge Peifan pointed out that the absconders claim to love Hong Kong and are righteous, but they leave immediately when there is a problem, evading responsibility and showing no commitment. She also noticed that the absconders were able to receive assistance in Taiwan within a short period of time, proving that they were indeed connected to overseas political forces.", "uid": "02_06_88", "input": "", "char_offset": "0-602"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vZWRpdGlvbi5jbm4uY29tL2FzaWEvbGl2ZS1uZXdzL2hvbmcta29uZy1qdWx5LTEtcHJvdGVzdHMtaW50bC1obmsvaF83OGZlMjcxZGRiZmU1NzlkNWFkNzZjMGU0NDFkNjUzOdIBAA?oc=5\n", "title": "Hong Kong's July 1 protests: What's happened so far", "stance": "pos", "content": "", "translation": "", "uid": "02_00_45", "input": "", "char_offset": "0-846"}
{"language": "English", "url": "http://www.chinadaily.com.cn/a/202011/30/WS5fc444c2a31024ad0ba983aa.html", "title": "Violence doesn't advance political agenda as verified by Hong Kong experience", "stance": "neg", "content": "", "translation": "", "uid": "02_06_236", "input": "", "char_offset": "0-1401"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2FwbmV3cy5jb20vYXJ0aWNsZS94aS1qaW5waW5nLWhvbmcta29uZy1jYXJyaWUtbGFtLWdvdmVybm1lbnQtYW5kLXBvbGl0aWNzLWRvbmFsZC10c2FuZy0yZWVjMzA1MmY2NTdlNjRmMjg2YmIwY2Q4NjIzMWFiZtIBAA?oc=5\n", "title": "Xi defends vision of Hong Kong on 25th anniversary of return | AP News", "stance": "pos", "content": "", "translation": "", "uid": "02_00_171", "input": "", "char_offset": "0-1854"}
{"language": "English", "url": "https://www.chinadaily.com.cn/kindle/2019-08/25/content_37505382.htm", "title": "Protests disrupt city's stability and operations", "stance": "neg", "content": "", "translation": "", "uid": "02_06_132", "input": "", "char_offset": "0-2620"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/21/c_138326851.htm", "title": "Woman's courage inspires Hong Kong society against violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_174", "input": "", "char_offset": "0-1649"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LnZvYW5ld3MuY29tL2EvaG9uZy1rb25nLXMtbmV3LW5hdGlvbmFsLXNlY3VyaXR5LWJpbGwtaW5jbHVkZXMtbW9yZS1wb3dlci10by1zdXBwcmVzcy1kaXNzZW50LS83NTE4OTQ2Lmh0bWzSAXhodHRwczovL3d3dy52b2FuZXdzLmNvbS9hbXAvaG9uZy1rb25nLXMtbmV3LW5hdGlvbmFsLXNlY3VyaXR5LWJpbGwtaW5jbHVkZXMtbW9yZS1wb3dlci10by1zdXBwcmVzcy1kaXNzZW50LS83NTE4OTQ2Lmh0bWw?oc=5\n", "title": "Hong Kong's New National Security Bill Includes More Power to Suppress Dissent ", "stance": "pos", "content": "", "translation": "", "uid": "02_00_5", "input": "", "char_offset": "0-755"}
{"language": "Chinese", "url": "https://finance.ifeng.com/a/20160704/14557056_0.shtml", "title": "香港激进反对派“七一游行”后内讧 成员挑衅互殴", "stance": "neg", "content": "", "translation": "Hong Kong's \"Social Democratic League\", \"People Power\", \"Hong Kong People's Liberation Army\" and other opposition groups recently launched a demonstration. After the demonstration, serious internal strife broke out, and internal members provoked each other to fight. It was criticized as another \"farce\".\n\nAccording to Hong Kong media reports, several radical organizations such as the \"Social Democratic League\" failed to illegally attack Government House after the demonstration on the evening of July 1 and withdrew to the SAR Court of Final Appeal for \"discussions.\" During this period, Zhou Shufeng, the radical local president of the Chinese University Student Union, was dissatisfied with the \"Social Democratic League\" and others' refusal to block the road. When he stepped forward to \"reason\", he was surrounded and cursed. Conflicts broke out within the opposition, and the incident continued to escalate.\n\nZhou Shufeng and the CUHK Student Union respectively posted on Facebook, stating that on the evening of the 1st, while discussing road occupation with the Social Democratic League at Chater Garden in Central, Zhou Shufeng was punched and kicked by members of the \"Social Democratic League\". They severely condemned this. However, the \"Social Democratic League\" and \"People Power\" refuted the students' claims. The \"Social Democratic League\" criticized the students for suddenly switching from surrounding the Central Liaison Office in Western District to fighting in Central, claiming that they were provoked by pseudo-localist troublemakers. Both sides insist on their own opinions, but so far no one has called the police about the incident.", "uid": "02_06_14", "input": "", "char_offset": "0-338"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1666105065670489802&wfr=spider&for=pc", "title": "香港修例风波回望：当青年被绑上暴力战车", "stance": "neg", "content": "", "translation": "The network that incites violence\nIn June and July 2019, some anti-extradition law demonstrators in Hong Kong clashed with law enforcement police. Subsequently, the personal and family information of some police officers was made public on the Internet, including the names, ID numbers and families of the police officers and their family members. Address, etc.\nSome police officers said that they and their families received a large number of harassing and threatening calls and text messages. According to statistics, 150 cases were transferred to the Office of the Privacy Commissioner for Personal Data in a short period of time.\nAmid the turmoil over the amendment bill, some online forums and social media in Hong Kong have become breeding grounds for thugs and classrooms for inciting atrocities, becoming the biggest source of chaos in Hong Kong. Faced with Hong Kong teenagers who have grown up with the Internet and are deeply dependent on it, as long as they seize the right to speak online through various means, constantly cater to their interests and preferences, and stimulate their extremes and hatred, they can trap their hearts and incite them. They roam the streets.\nA survey by the Hong Kong Federation of Youth Groups found that nearly 90% of Hong Kong youth own smartphones and use them for an average of 3.5 hours a day. Social media represented by Facebook has become the most commonly used platform by Hong Kong youth, and nearly half of Hong Kong youth use it as the main source of information on public affairs.\nOn social platforms such as Twitter, Facebook, and YouTube in Hong Kong, rumors are costless and lies are flying everywhere. \"Police sexually assaulted an arrested woman\", \"Police undercover threw incendiary bombs\", \"People died at Prince Edward Station on August 31\"... Internet rumors pushed some young people who did not know what was going on into an inexplicable \"revenge\" mood and lost their rational thinking. and independent judgment. Even if the police and relevant departments provide evidence to prove that the online rumors are completely false, the inciters continue to spread the rumors online and conduct \"memorial\" activities online and offline.\nMalicious subversion and arrogance are the most common means to incite violence and inspire hatred and fear. In August, some maliciously modified pictures and videos were circulated online. An image shows a family being chased by riot police at New Town Plaza in Sha Tin. The video played by the police at the press conference clearly showed that the police were escorting them to a safe place. The family later publicly thanked the police for protecting them.\nIn a video of the demonstration played by the police, a young man suddenly jumped off the bridge, and multiple police officers caught him in time to avoid a tragedy. However, the incident was described online as \"the police pushing the young man off the bridge\".\nViolent instigation is not considered strange on the Internet, and it has even turned into violent and terrorist teaching with a terrorist nature. Social media represented by the \"Lian Deng\" online discussion forum and \"Telegram\" have become the source and command post of \"black terror\" and the base camp for instigating atrocities.\nLog into these two online platforms and you will be flooded with inciting posts. Want to make your own assault weapon and use it correctly? There are graphic or video tutorials here to teach you \"step by step\" how to make and use incendiary bombs, smoke bombs, improvised bombs, and corrosive liquid bombs. In addition, there are \"dog sticks\", bows and arrows, modified slingshots... \"Eighteen kinds of weapons\" used by black-clad thugs when they attack police and siege institutions. You can find \"warfare instruction manuals\" here.\n\"The online public opinion environment in Hong Kong is particularly bad.\" Chen Zhihao, vice chairman of the Hong Kong Youth Current Affairs Commentators Association, felt deeply. \"The opposition is very comfortable on the popular Internet, and all kinds of rumors and slanderous things can be circulated unimpeded.\"", "uid": "02_06_49", "input": "", "char_offset": "0-1031"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy53YXNoaW5ndG9ucG9zdC5jb20vd29ybGQvYXNpYV9wYWNpZmljL2hvbmcta29uZy1wcm90ZXN0cy1wb2xpY2UtY2hpbmEvMjAyMC8xMC8wMS8zMzFjMmVmZS0wMTQ1LTExZWItYjkyZS0wMjk2NzZmOWViZWNfc3RvcnkuaHRtbNIBAA?oc=5\n", "title": "Hong Kong police thwart protests set for China's national day - The Washington Post", "stance": "pos", "content": "", "translation": "", "uid": "02_00_92", "input": "", "char_offset": "0-1848"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1666105065670489802&wfr=spider&for=pc", "title": "香港修例风波回望：当青年被绑上暴力战车", "stance": "neg", "content": "", "translation": "distorted education\nOn October 13, 2019, black-clad thugs wreaked havoc in many places in Hong Kong. Police officer Ali (pseudonym) and his colleagues were ordered to handle a criminal damage case at Kwun Tong MTR station. Suddenly a sharp blade stuck out from the crowd and stabbed Ali in the neck.\nThe person who injured someone with a knife was actually an 18-year-old sixth form student.\nMore than a month later, Ali sadly told reporters on his hospital bed: \"In the past few months, some college and middle school students have used very violent methods to attack police and citizens, and destroyed shops. I think there is something wrong with Hong Kong's education.\"\nWhen Ali was interviewed by reporters at the Hong Kong Police Headquarters, the wound on his neck was clearly visible (photo taken on November 27, 2019). (Photo by Xinhua News Agency reporter Li Zhen)\nTeenagers are the most enthusiastic group in the turmoil over the extradition bill. They wantonly set fires and vandalism, smashed shops, destroyed public facilities, threw petrol bombs, and attacked police and citizens.\nBut what is ridiculous is that after some of them were punished by the police according to law, some schools not only did not criticize their illegal and violent behavior, but instead issued a statement accusing \"the police of violating regulations and exceeding their authority\" and calling on all walks of life to \"accept\" the violent students.\nThere are many teachers in Hong Kong who incite violence and commit violence. Huang Junyu, president of the Hong Kong Federation of Educators, said that there are more than 60,000 teachers in primary and secondary schools in Hong Kong, including some teachers with more radical ideas. Although they are small in number, they have great energy. They use the platform to carry out political propaganda and persuade some immature young people and even minors to take to the streets. The most violent members among them were trained to be \"brave\" men who did not distinguish right from wrong and despised the law.\nAccording to statistics from the education department of the Hong Kong SAR government, from June last year to the end of January this year, a total of 171 complaints were received about possible professional misconduct by teachers, most of which involved making inappropriate remarks such as hatred and curses. A middle school assistant principal actually cursed that \"a gangster policeman will kill his whole family\" and \"the policeman's children will not survive until the age of seven.\" Public opinion in Hong Kong called this a \"shame on the education sector.\"\nAs the largest single-industry trade union in Hong Kong and the organization with the largest number of participating members, the Hong Kong \"Teachers' Association\" has long been controlled by opposition forces. The leader of the organization, Ye Jianyuan, once expressed support for middle school students in promoting \"Hong Kong independence\" on campus, beautifying it as \"having independent opinions, having personal opinions and caring about current affairs.\"\n“If Hong Kong’s education is ‘sick’, then there is something wrong with the educators first.” Gu Minkang, former deputy dean of the School of Law of City University of Hong Kong, wrote in an article.\nIn addition to educators, there are also many problems with teaching content. \"Hong Kong lacks national education with positive guidance, but is full of negative expressions of the opposition and 'education' full of hatred.\" said Deng Fei, principal of Hong Kong Island Secondary School in Tseung Kwan O.", "uid": "02_06_47", "input": "", "char_offset": "0-825"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vbmV3cy8yMDE5LzcvMy9ob25nLWtvbmctcHJvdGVzdHMtYWxsLXRoZS1sYXRlc3QtdXBkYXRlc9IBVWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vYW1wL25ld3MvMjAxOS83LzMvaG9uZy1rb25nLXByb3Rlc3RzLWFsbC10aGUtbGF0ZXN0LXVwZGF0ZXM?oc=5\n", "title": "Hong Kong protests: All the latest updates | Hong Kong Protests News | Al Jazeera", "stance": "pos", "content": "", "translation": "", "uid": "02_00_125", "input": "", "char_offset": "0-1877"}
{"language": "English", "url": "https://www.chinadaily.com.cn/global/2019-08/01/content_37497652.htm", "title": "Preserving HK's bridging role in everyone's interest", "stance": "neg", "content": "", "translation": "", "uid": "02_06_216", "input": "", "char_offset": "0-1205"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1685474234536848592&wfr=spider&for=pc", "title": "港媒：香港警方拘捕“民阵”召集人等8人，涉七一非法集会", "stance": "neg", "content": "", "translation": "According to a report by Hong Kong's \"East Net\" on the 8th, the Hong Kong police arrested 8 people including former Legislative Council member Leung Kwok-hsiung and the convener of the opposition organization \"Democratic Front\" Chen Haohuan in the early morning of today (8th). These people are suspected of being involved in the incident on July 1 this year. Related to illegal assembly and procession, the case has been handed over to the Criminal Division of the Hong Kong Island Region for follow-up.\nAccording to reports, Hong Kong police arrested Chen Haohuan at Tai Hing Garden in Tuen Mun at about 6 a.m. and Leung Kwok-hung at Kai Yip Estate in Kowloon Bay. In addition, Hu Zhiwei, the former chairman of the opposition Democratic Party, said on social networking sites that he was arrested by the police in the early morning; former opposition member of the Legislative Council, Chu Kai-dy, also said on social networks that he was arrested on charges related to the July 1 demonstration. In addition, Hong Kong Eastern District Councilors Tsang Kin-shing and Chan Wing-tai also said on social networking sites that they were arrested by the police in the early morning of the 8th.", "uid": "02_06_10", "input": "", "char_offset": "0-239"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/11/c_138299437.htm", "title": "Xinhua Headlines: Hong Kong people express support for police, calling for end to violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_204", "input": "", "char_offset": "0-1364"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vaG9uZ2tvbmdmcC5jb20vMjAyMy8wNy8wMy8xNS1zdG9wcGVkLWJ5LWhvbmcta29uZy1wb2xpY2Utb24tYW5uaXZlcnNhcnktb2YtY2l0eXMtcmV0dXJuLXRvLWNoaW5lc2UtcnVsZS_SAQA?oc=5\n", "title": "15 stopped by Hong Kong police on anniversary of city's return to Chinese rule | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_79", "input": "", "char_offset": "0-2735"}
{"language": "English", "url": "https://www.chinadaily.com.cn/hkedition/2019-10/15/content_37515511.htm", "title": "US has 'hidden agenda' with Act", "stance": "neg", "content": "", "translation": "", "uid": "02_06_189", "input": "", "char_offset": "0-1749"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LnZvYW5ld3MuY29tL2EvZWFzdC1hc2lhLXBhY2lmaWNfcmlvdC1wb2xpY2UtbWVldC1ob25nLWtvbmctcHJvdGVzdGVycy1wZXBwZXItc3ByYXktYmF0b25zLzYxNzA4ODIuaHRtbNIBdGh0dHBzOi8vd3d3LnZvYW5ld3MuY29tL2FtcC9lYXN0LWFzaWEtcGFjaWZpY19yaW90LXBvbGljZS1tZWV0LWhvbmcta29uZy1wcm90ZXN0ZXJzLXBlcHBlci1zcHJheS1iYXRvbnMvNjE3MDg4Mi5odG1s?oc=5\n", "title": "Riot Police Meet Hong Kong Protesters with Pepper Spray, Batons ", "stance": "pos", "content": "", "translation": "", "uid": "02_00_198", "input": "", "char_offset": "0-3519"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/11/c_138299437.htm", "title": "Xinhua Headlines: Hong Kong people express support for police, calling for end to violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_203", "input": "", "char_offset": "0-1184"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1638005817349968609&wfr=spider&for=pc", "title": "香港立法会建制派议员强烈谴责暴力冲击立法会行为", "stance": "neg", "content": "", "translation": "On July 1, some radicals in Hong Kong violently attacked and occupied the Legislative Council building, wreaking havoc on the facilities inside the Legislative Council chamber. On the 2nd, all pro-establishment members of the Legislative Council severely condemned this serious illegal behavior. At the same time, they hope that the police will strictly enforce the law and the lawbreakers will be punished as soon as possible.\nLiao Changjiang, the convener of the pro-establishment members of the Legislative Council, said that day that the actions of criminals caused unprecedented damage to the facilities of the Legislative Council. The pro-establishment faction unanimously issued the strongest condemnation, and this serious illegal behavior has also seriously affected people's livelihood. \"We I went to see it and it was devastated. The elevators were damaged and many computers were damaged. We, the pro-establishment members of the Legislative Council, condemned this violence in the strongest terms. But the biggest issue now is financial allocation, and many of them are related to people's livelihood. Some of the funding problems cannot be solved, so it not only affects the Legislative Council, but also seriously affects people’s livelihood.”\nSandra Ip, a member of the pro-establishment faction of the Legislative Council and chairperson of the Hong Kong New Democratic Party, also strongly condemned the series of lawless and vandalistic activities that occurred in the Legislative Council building. She said that the violent acts destroyed Hong Kong's reputation and the interests of citizens, and hoped that the police would take action as soon as possible. Bring the criminals to justice. \"I strongly condemn this unprecedented violent incident, which has greatly affected the overall security of Hong Kong and the interests of the general public. It needs to be strongly condemned. I also hope that the police will arrest the criminals as soon as possible.\" Bring to justice.\"\nAt a press conference held by pro-establishment members of the Legislative Council on the 2nd, Lee Wai-king, a pro-establishment member of the Legislative Council and chairman of the Democratic Alliance for the Betterment of Hong Kong, also emphasized that the Legislative Council is a symbol of the rule of law in Hong Kong, but this time it was vandalized and she expected the police to strictly enforce the law. , \"The Legislative Council is a symbol of the rule of law in Hong Kong. Yesterday, everyone saw the wanton destruction of the Legislative Council. We hereby condemn in the strongest possible terms all serious illegal acts of violence. From the afternoon of (July 1) until the evening, everyone Seeing (criminals) throwing corrosive liquids and powders, and then rushing to the Legislative Council to cause wanton destruction is an insult to the Legislative Council and an insult to the rule of law in Hong Kong. \"We demand that the police strictly enforce the law.\"", "uid": "02_06_86", "input": "", "char_offset": "0-663"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/21/c_138326851.htm", "title": "Woman's courage inspires Hong Kong society against violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_171", "input": "", "char_offset": "0-909"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wNy8wMS9hc2lhL2hvbmcta29uZy1qdWx5LTEtcHJvdGVzdC1leHRyYWRpdGlvbi1pbnRsLWhuay9pbmRleC5odG1s0gFVaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAxOS8wNy8wMS9hc2lhL2hvbmcta29uZy1qdWx5LTEtcHJvdGVzdC1leHRyYWRpdGlvbi1pbnRsLWhuaw?oc=5\n", "title": "Hong Kong protests: Carrie Lam responds to protestor takeover | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_56", "input": "", "char_offset": "0-1760"}
{"language": "Chinese", "url": "https://baijiahao.baidu.com/s?id=1688329721018743119&wfr=spider&for=pc", "title": "华春莹9分钟答记者问 详解为何美国会和香港暴乱场景相似但反应不同", "stance": "neg", "content": "", "translation": "There are two differences between the attack on the Legislative Council in Hong Kong and the riots in the U.S. Congress.\nHua Chunying said, I have noticed that some media said that the attack on the Legislative Council in Hong Kong is different from what will happen in the United States and should not be compared. If there are differences between the two, I think there are at least two differences:\nFirst, the thugs who attacked the Hong Kong Legislative Council in July 2019 smashed and vandalized the legislative body, hunted down innocent people, and attacked the police with petrol bombs and knives. Such crimes are more serious and more vicious than climbing on the outer wall of the Congress and storming into the Congress in the United States. They should be defined as \"thugs\" and \"terrorists\" and should be severely punished by law.\nSecond, what happened in the U.S. Congress was organized by the Americans themselves, while what happened in Hong Kong was instigated, planned, organized, directed and implemented by external forces, and some people in the United States played a very disgraceful role in it. .", "uid": "02_06_87", "input": "", "char_offset": "0-275"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZm9yZWlnbnBvbGljeS5jb20vMjAxOS8xMi8yMC9ob25nLWtvbmctcHJvdGVzdHMtMjAxOS_SAQA?oc=5\n", "title": "Hong Kong’s Protest Year", "stance": "pos", "content": "", "translation": "", "uid": "02_00_180", "input": "", "char_offset": "0-2051"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-10/16/c_138477191.htm", "title": "Commentary: Washington's phony concern brings real hate to Hong Kong streets", "stance": "neg", "content": "", "translation": "", "uid": "02_06_213", "input": "", "char_offset": "0-1283"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vaG9uZ2tvbmdmcC5jb20vMjAyMi8wNy8wMi90aW1lbGluZS1ob25nLWtvbmdzLWp1bHktMS1jYXJuaXZhbC1vZi1kaXNzZW50LWhvdy0xNy15ZWFycy1vZi1wcm90ZXN0LWRlbWFuZHMtZmVsbC1zaWxlbnQv0gEA?oc=5\n", "title": "Timeline: Hong Kong's July 1 carnival of dissent - how 17 years of protest demands fell silent | Hong Kong Free Press HKFP", "stance": "pos", "content": "", "translation": "", "uid": "02_00_49", "input": "", "char_offset": "0-2390"}
{"language": "English", "url": "http://www.xinhuanet.com/english/2019-08/11/c_138299437.htm", "title": "Xinhua Headlines: Hong Kong people express support for police, calling for end to violence", "stance": "neg", "content": "", "translation": "", "uid": "02_06_202", "input": "", "char_offset": "0-1527"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy93b3JsZC1hc2lhLWNoaW5hLTQ4ODIxNjQw0gE2aHR0cHM6Ly93d3cuYmJjLmNvbS9uZXdzL3dvcmxkLWFzaWEtY2hpbmEtNDg4MjE2NDAuYW1w?oc=5\n", "title": "Hong Kong: Protesters storm and deface parliament on handover anniversary", "stance": "pos", "content": "", "translation": "", "uid": "02_00_109", "input": "", "char_offset": "0-4370"}
{"language": "English", "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNubi5jb20vMjAxOS8wOC8xNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0cy1ldm9sdXRpb24taW50bC1obmstdHJuZC9pbmRleC5odG1s0gFSaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAxOS8wOC8xNi9hc2lhL2hvbmcta29uZy1wcm90ZXN0cy1ldm9sdXRpb24taW50bC1obmstdHJuZA?oc=5\n", "title": "Hong Kong protest timeline: The evolution of a movement | CNN", "stance": "pos", "content": "", "translation": "", "uid": "02_00_217", "input": "", "char_offset": "0-1587"}
